{
	"version": "https://jsonfeed.org/version/1",
	"title": "Darby M. Dixon III",
	"icon": "https://micro.blog/darby3/avatar.jpg",
	"home_page_url": "https://darby3.micro.blog/",
	"feed_url": "https://darby3.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://darby3.micro.blog/2022/12/28/first-run-in.html",
				
				"content_html": "<p>First run in two and a half weeks today. That was fun. Back to the cookies now.</p>\n",
				"content_text": "First run in two and a half weeks today. That was fun. Back to the cookies now.\n",
				"date_published": "2022-12-28T13:29:58-05:00",
				"url": "https://darby3.micro.blog/2022/12/28/first-run-in.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/22/made-it-up.html",
				
				"content_html": "<p>Made it up through day 10 of Advent of Code. Probably won&rsquo;t get past that as I slowly descend into a bottomless pit of cheese and holiday torpor.</p>\n",
				"content_text": "Made it up through day 10 of Advent of Code. Probably won't get past that as I slowly descend into a bottomless pit of cheese and holiday torpor.\n",
				"date_published": "2022-12-22T13:56:38-05:00",
				"url": "https://darby3.micro.blog/2022/12/22/made-it-up.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/21/finally-pulling-together.html",
				
				"content_html": "<p>Finally pulling together the next issue of my books newsletter. I guess I just have to go long enough between issues that I literally annoy myself into feeling like I have to write the next one. 📚</p>\n",
				"content_text": "Finally pulling together the next issue of my books newsletter. I guess I just have to go long enough between issues that I literally annoy myself into feeling like I have to write the next one. 📚\n",
				"date_published": "2022-12-21T15:40:57-05:00",
				"url": "https://darby3.micro.blog/2022/12/21/finally-pulling-together.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/12/21/ill-hit-books.html",
				
				"content_html": "<p>I&rsquo;ll hit <a href=\"https://app.thestorygraph.com/stats/darby3?year=2022\">43 books for the year</a> today. It&rsquo;s been a weird year! On the one hand that number is low for me. On the other, I&rsquo;ve read more 500+ page books this year than I have since I&rsquo;ve started keeping track, I think. 📚</p>\n",
				"content_text": "I'll hit [43 books for the year](https://app.thestorygraph.com/stats/darby3?year=2022) today. It's been a weird year! On the one hand that number is low for me. On the other, I've read more 500+ page books this year than I have since I've started keeping track, I think. 📚\n",
				"date_published": "2022-12-21T09:52:15-05:00",
				"url": "https://darby3.micro.blog/2022/12/21/ill-hit-books.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/12/20/finally-dipped-back.html",
				
				"content_html": "<p>Finally dipped back into Advent of Code. Got horrifyingly hung up on day 7 part 1. Because of a very, very, very silly bug. Good news is I think I get to rip out half of what I did for part 2. (Famous last words.)</p>\n",
				"content_text": "Finally dipped back into Advent of Code. Got horrifyingly hung up on day 7 part 1. Because of a very, very, very silly bug. Good news is I think I get to rip out half of what I did for part 2. (Famous last words.)\n",
				"date_published": "2022-12-20T14:27:13-05:00",
				"url": "https://darby3.micro.blog/2022/12/20/finally-dipped-back.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/19/spend-a-lot.html",
				
				"content_html": "<p>Spend a lot of time in <a href=\"https://iterm2.com/\">iTerm2</a>. Finding reasons to dip into more advanced features the last week or so. Kind of feel like I&rsquo;ve dusted off an old Nintendo Power Glove except it&rsquo;s actually got power.</p>\n",
				"content_text": "Spend a lot of time in [iTerm2](https://iterm2.com/). Finding reasons to dip into more advanced features the last week or so. Kind of feel like I've dusted off an old Nintendo Power Glove except it's actually got power.\n",
				"date_published": "2022-12-19T09:51:55-05:00",
				"url": "https://darby3.micro.blog/2022/12/19/spend-a-lot.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/16/for-those-of.html",
				
				"content_html": "<p>For those of you playing along at home as I move this git branch from one repo to another via git format-patch and git am, I&rsquo;m currently flying around Maximilian in the closing sequence of the 1979 Disney film <em>The Black Hole</em>.</p>\n",
				"content_text": "For those of you playing along at home as I move this git branch from one repo to another via git format-patch and git am, I'm currently flying around Maximilian in the closing sequence of the 1979 Disney film *The Black Hole*.\n",
				"date_published": "2022-12-16T12:33:39-05:00",
				"url": "https://darby3.micro.blog/2022/12/16/for-those-of.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/16/introduce-yourself-with.html",
				
				"content_html": "<p>📺 Introduce yourself with 5 TV shows</p>\n<ul>\n<li><em>The Leftovers</em></li>\n<li><em>Halt and Catch Fire</em></li>\n<li><em>Battlestar Gallactica</em></li>\n<li><em>Twin Peaks</em></li>\n<li><em>The Americans</em></li>\n</ul>\n<p>Brett made this easy, as I was able to just <a href=\"https://brett.micro.blog/2022/12/15/introduce-yourself-with.html\">copy the bulk of his list</a>.</p>\n",
				"content_text": "📺 Introduce yourself with 5 TV shows\r\n\r\n- *The Leftovers*\r\n- *Halt and Catch Fire*\r\n- *Battlestar Gallactica*\r\n- *Twin Peaks*\r\n- *The Americans*\r\n\r\nBrett made this easy, as I was able to just [copy the bulk of his list](https://brett.micro.blog/2022/12/15/introduce-yourself-with.html).\n",
				"date_published": "2022-12-16T10:43:36-05:00",
				"url": "https://darby3.micro.blog/2022/12/16/introduce-yourself-with.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/15/if-you-notice.html",
				
				"content_html": "<p>If you notice any disturbances in the space-time continuum today that&rsquo;s me trying to move a complex git branch from one repository to another tangentially-related respository. My apologies for the inconvenience&hellip;</p>\n",
				"content_text": "If you notice any disturbances in the space-time continuum today that's me trying to move a complex git branch from one repository to another tangentially-related respository. My apologies for the inconvenience...\n",
				"date_published": "2022-12-15T10:44:46-05:00",
				"url": "https://darby3.micro.blog/2022/12/15/if-you-notice.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/14/completely-fallen-off.html",
				
				"content_html": "<p>Completely fallen off the Advent of Code wagon because life. Still, hoping to play catch-up. Eventually. (It <em>is</em> interesting how solving these puzzles opens up ideas relevant to my actual work.)</p>\n",
				"content_text": "Completely fallen off the Advent of Code wagon because life. Still, hoping to play catch-up. Eventually. (It *is* interesting how solving these puzzles opens up ideas relevant to my actual work.)\n",
				"date_published": "2022-12-14T08:30:26-05:00",
				"url": "https://darby3.micro.blog/2022/12/14/completely-fallen-off.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/10/weird-to-not.html",
				
				"content_html": "<p>Weird to not be writing about running. But: not much to write about. I&rsquo;ve done some running! I had a particularly crummy run this week. It was long overdue! Next week, I won&rsquo;t run at all, for reasons. Won&rsquo;t mind the week off, though. (He says, optimistically.) 🏃</p>\n",
				"content_text": "Weird to not be writing about running. But: not much to write about. I've done some running! I had a particularly crummy run this week. It was long overdue! Next week, I won't run at all, for reasons. Won't mind the week off, though. (He says, optimistically.) 🏃\n",
				"date_published": "2022-12-10T10:32:55-05:00",
				"url": "https://darby3.micro.blog/2022/12/10/weird-to-not.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/12/09/theres-a-social.html",
				
				"content_html": "<p>There&rsquo;s a Social Media Outrage Thing going on on Mastodon that honestly makes me want to immediately remove myself from that service. Having been happily away from Twitter for so long, and being re-exposed to something So Online like that, sucks.</p>\n",
				"content_text": "There's a Social Media Outrage Thing going on on Mastodon that honestly makes me want to immediately remove myself from that service. Having been happily away from Twitter for so long, and being re-exposed to something So Online like that, sucks.\n",
				"date_published": "2022-12-09T14:48:26-05:00",
				"url": "https://darby3.micro.blog/2022/12/09/theres-a-social.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/09/having-a-real.html",
				
				"content_html": "<p>Having a real &ldquo;every task leads to another task&rdquo; kind of day. My stack trace goes hard. I am a nesting doll of tasks. And the little one in the center is about to toss a big core dump file on the floor and run away into the sunset. Possibly with giggles.</p>\n",
				"content_text": "Having a real \"every task leads to another task\" kind of day. My stack trace goes hard. I am a nesting doll of tasks. And the little one in the center is about to toss a big core dump file on the floor and run away into the sunset. Possibly with giggles.\n",
				"date_published": "2022-12-09T11:41:37-05:00",
				"url": "https://darby3.micro.blog/2022/12/09/having-a-real.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/09/this-week-i.html",
				
				"content_html": "<p>This week I realized the <a href=\"https://en.wikipedia.org/wiki/Tostitos#/media/File:Tostitos_brand_logo.png\">Tostitos logo</a> features two people collaborating to taunt a smaller third person by holding a single chip just out of the third individual&rsquo;s reach.</p>\n",
				"content_text": "This week I realized the [Tostitos logo](https://en.wikipedia.org/wiki/Tostitos#/media/File:Tostitos_brand_logo.png) features two people collaborating to taunt a smaller third person by holding a single chip just out of the third individual's reach.\n",
				"date_published": "2022-12-09T10:16:27-05:00",
				"url": "https://darby3.micro.blog/2022/12/09/this-week-i.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/08/the-cool-thing.html",
				
				"content_html": "<p>The cool thing about migrating an entire website to a new host is that it is never stressful and everything is always fine. For someone. Somewhere.</p>\n",
				"content_text": "The cool thing about migrating an entire website to a new host is that it is never stressful and everything is always fine. For someone. Somewhere.\n",
				"date_published": "2022-12-08T09:31:12-05:00",
				"url": "https://darby3.micro.blog/2022/12/08/the-cool-thing.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/06/all-caught-up.html",
				
				"content_html": "<p>All caught up on Advent of Code. Feels like a lot of what I learned last year is making this year a bit easier&hellip;so far.</p>\n",
				"content_text": "All caught up on Advent of Code. Feels like a lot of what I learned last year is making this year a bit easier...so far.\n",
				"date_published": "2022-12-06T11:01:38-05:00",
				"url": "https://darby3.micro.blog/2022/12/06/all-caught-up.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/05/that-thing-where.html",
				
				"content_html": "<p>That thing where you wake up on the Monday of a stressful week and the car does something bad. 😑</p>\n",
				"content_text": "That thing where you wake up on the Monday of a stressful week and the car does something bad. 😑\n",
				"date_published": "2022-12-05T10:23:42-05:00",
				"url": "https://darby3.micro.blog/2022/12/05/that-thing-where.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/02/really-feeling-this.html",
				
				"content_html": "<p>Really feeling <a href=\"https://soundcloud.com/resident-advisor/ra822-gigi-fm\">this GiGi FM DJ set</a> right now. 🎵</p>\n",
				"content_text": "Really feeling [this GiGi FM DJ set](https://soundcloud.com/resident-advisor/ra822-gigi-fm) right now. 🎵\n",
				"date_published": "2022-12-02T10:22:30-05:00",
				"url": "https://darby3.micro.blog/2022/12/02/really-feeling-this.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/12/01/happy-advent-of.html",
				
				"content_html": "<p>Happy <a href=\"https://adventofcode.com/\">Advent of Code</a> season, fellow nerds. Decided to go with JS again this year. We&rsquo;ll see how long I last before I accidentally reduce the laptop to a smoking slag by doing something <em>completely wrong</em>.</p>\n",
				"content_text": "Happy [Advent of Code](https://adventofcode.com/) season, fellow nerds. Decided to go with JS again this year. We'll see how long I last before I accidentally reduce the laptop to a smoking slag by doing something *completely wrong*.\n",
				"date_published": "2022-12-01T11:23:29-05:00",
				"url": "https://darby3.micro.blog/2022/12/01/happy-advent-of.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/30/ive-kept-my.html",
				
				"content_html": "<p>I&rsquo;ve kept my mastodon following activity separate from who I follow on micro.blog. They feel like different mindsets, different vibes. I&rsquo;m peeking at mastodon a little more these days but I&rsquo;m still unsure what I&rsquo;m doing there.</p>\n",
				"content_text": "I've kept my mastodon following activity separate from who I follow on micro.blog. They feel like different mindsets, different vibes. I'm peeking at mastodon a little more these days but I'm still unsure what I'm doing there.\n",
				"date_published": "2022-11-30T10:28:45-05:00",
				"url": "https://darby3.micro.blog/2022/11/30/ive-kept-my.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/29/just-squeaked-past.html",
				
				"content_html": "<p>Just squeaked past 100 km for November. Not going to make that happen in December. 🏃</p>\n",
				"content_text": "Just squeaked past 100 km for November. Not going to make that happen in December. 🏃\n",
				"date_published": "2022-11-29T22:45:56-05:00",
				"url": "https://darby3.micro.blog/2022/11/29/just-squeaked-past.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/29/183000.html",
				"title": "2023 Running Plans 🏃",
				"content_html": "<p>I&rsquo;m planning on running a full marathon in 2024.</p>\n<p>I&rsquo;ve been planning for this since I started training for the half marathon I just ran. I looked at the half marathon as a chance to dip my toe in the distance-running water to see whether I liked the feel for this kind of training or whether it felt like too much. So far, so good: nothing about the half marathon cycle I just went through made me want to give up.</p>\n<p>It&rsquo;s funny, because even with what I&rsquo;ve done, I still feel like I have a little imposter syndrome, when it comes to running. I still feel very conservative in my approach, using the word &ldquo;training&rdquo; still kind of makes me want to break out in hives, and I come into this knowing that running a full marathon isn&rsquo;t some huge life-long dream of mine. (For that, you&rsquo;d have to look at biking. While I&rsquo;ve biked one metric century, I still feel like I&rsquo;ve got at least one full 100 mile ride in me. Some day.) I started running three years ago in order to support a particular charity 5k, and with two kids in the house I was looking for a form of exercise that was a bit more effective than bicycling (which long rides, when I was training for that metric century, took me out of the house <em>forrrevvvver</em>), and because I generally thought it would be cool to be able to run a full mile without stopping. After a couple rocky years I got more consistent with running last year and started wondering if I could run a marathon.</p>\n<p>And I started to think that maybe I could. And I started to think that maybe if I thought I could, if I even had an inkling of interest in it, maybe I should do something about it sooner rather than later, because while I&rsquo;m not old, I&rsquo;m certainly not getting any younger. At one point I thought about just going straight for it in 2023 but then decided I&rsquo;m just not that hardcore. So I came up with a loose plan to give myself well over a year to build up to it while also giving myself plenty of freedom to back out at any time for any reason with no penalty.</p>\n<p>And now here I am, my first half marathon in the books, and as of right now, that big-picture goal still seems reasonable. I mean, it seems crazy, but also possible. Nothing about this process the last few months made me want to quit. Whether or not I actually make it all the way I feel like I&rsquo;m having fun right now, like I&rsquo;m building up a sustainable running practice, and I&rsquo;m learning a lot about what motivates me to keep going, and of which is worth it.</p>\n<p>And I can still run <em>one whole mile</em> without stopping. And that still does feel pretty cool!</p>\n<p>That said, I&rsquo;ve learned a bit about how goal motivated I am. Races—as much as I anguish over them—bring structure and focus to all the runs that come before them. So I&rsquo;m going to keep doing them, and I&rsquo;m planning on doing two more half-marathons in 2023. I want to re-run the Fall Classic in November, because I want to have at least one year-over-year apples-to-apples comparison, just to see what there is to see. Before that I want to try for a late spring race, I think, because I&rsquo;d like to run at least one of these races in (hopefully) nice weather. I&rsquo;ve earned that!</p>\n<p>I&rsquo;m also ready to care about pace a little more. Admittedly, I ran the November race slow enough that it would be tough <em>not</em> to beat that time next time out, after another round of training, but also I just <em>know</em> I can go faster than that, and I want to specifically try for that. I never expect to be competitive at these things, nor am I interested in trying hard enough to be. But I also know it&rsquo;s fun to surprise yourself, and I can get behind trying hard enough for that. So I&rsquo;m setting out with the loose goal this spring of beating my first time, and then going for something reasonably ambitious in the fall.</p>\n<p>To that end, in the short term, I want to run more during the next training cycle. Not necessarily harder, but more. I know I trained at about the barest possible minimal level for the fall race. Next time out I want to go from three days a week to four. I think I&rsquo;m going to repeat the same basic 12-week training calendar as the last time out, which I liked the general feel of, with the addition of the fourth day, which would be a shorter, light/easy day. I have no plans to target five days as I want to keep a day or two free for an elliptical session or finding a strength training or yoga habit I like.</p>\n<p>While I said I don&rsquo;t necessarily want to run harder, I do generally want to bring my paces up across the board. Sometimes these last few months I felt fine, sometimes I felt like I had more to give but was holding back. I&rsquo;m still not quite sure what easy <em>should</em> actually feel like but I think just in general the more I run the more efficient I get and if I can maintain my consistency through into the new year I&rsquo;ll naturally feel a little more okay going a little more fast a little more often. Maybe more importantly though, for confidence purposes, I want to push my race pace experiments more aggressively. I want to pick an ambitious target early and stick with it the whole way through. I really wasn&rsquo;t sure what felt right this last time through, and now I think I want to use those runs to push myself to give a little more. Still, even if it&rsquo;s nothing like what I run on race day, having those faster days in the training cycle feels fun.</p>\n<p>I&rsquo;m also hoping to do some shorter races that I can really try for my best-possible paces. I&rsquo;m thinking about re-doing the 10k I ran last spring, which left me feeling like I had something unresolved there that I&rsquo;d like to make good on. I&rsquo;m also curious to see if I can beat my summer 5k race&rsquo;s time from last year, too. Which actually feels like it could be the most ambitious goal of the year! If I find some 10k races that fit in with the half marathon plans, I might try to slide those in, too, for practice purposes, but I&rsquo;m not sure that&rsquo;s going to work out or not.</p>\n<p>So that&rsquo;s the year in a nutshell, as I picture it right now: a half, some shorter stuff, and then a give-it-my-all half by the year&rsquo;s end. Working on confidence, pace, and strength. And then all going well, launching into full marathon training come January 2024.</p>\n",
				"content_text": "I'm planning on running a full marathon in 2024.\n\nI've been planning for this since I started training for the half marathon I just ran. I looked at the half marathon as a chance to dip my toe in the distance-running water to see whether I liked the feel for this kind of training or whether it felt like too much. So far, so good: nothing about the half marathon cycle I just went through made me want to give up.\n\nIt's funny, because even with what I've done, I still feel like I have a little imposter syndrome, when it comes to running. I still feel very conservative in my approach, using the word \"training\" still kind of makes me want to break out in hives, and I come into this knowing that running a full marathon isn't some huge life-long dream of mine. (For that, you'd have to look at biking. While I've biked one metric century, I still feel like I've got at least one full 100 mile ride in me. Some day.) I started running three years ago in order to support a particular charity 5k, and with two kids in the house I was looking for a form of exercise that was a bit more effective than bicycling (which long rides, when I was training for that metric century, took me out of the house *forrrevvvver*), and because I generally thought it would be cool to be able to run a full mile without stopping. After a couple rocky years I got more consistent with running last year and started wondering if I could run a marathon. \n\nAnd I started to think that maybe I could. And I started to think that maybe if I thought I could, if I even had an inkling of interest in it, maybe I should do something about it sooner rather than later, because while I'm not old, I'm certainly not getting any younger. At one point I thought about just going straight for it in 2023 but then decided I'm just not that hardcore. So I came up with a loose plan to give myself well over a year to build up to it while also giving myself plenty of freedom to back out at any time for any reason with no penalty.\n\nAnd now here I am, my first half marathon in the books, and as of right now, that big-picture goal still seems reasonable. I mean, it seems crazy, but also possible. Nothing about this process the last few months made me want to quit. Whether or not I actually make it all the way I feel like I'm having fun right now, like I'm building up a sustainable running practice, and I'm learning a lot about what motivates me to keep going, and of which is worth it.\n\nAnd I can still run *one whole mile* without stopping. And that still does feel pretty cool!\n\nThat said, I've learned a bit about how goal motivated I am. Races—as much as I anguish over them—bring structure and focus to all the runs that come before them. So I'm going to keep doing them, and I'm planning on doing two more half-marathons in 2023. I want to re-run the Fall Classic in November, because I want to have at least one year-over-year apples-to-apples comparison, just to see what there is to see. Before that I want to try for a late spring race, I think, because I'd like to run at least one of these races in (hopefully) nice weather. I've earned that!\n\nI'm also ready to care about pace a little more. Admittedly, I ran the November race slow enough that it would be tough *not* to beat that time next time out, after another round of training, but also I just *know* I can go faster than that, and I want to specifically try for that. I never expect to be competitive at these things, nor am I interested in trying hard enough to be. But I also know it's fun to surprise yourself, and I can get behind trying hard enough for that. So I'm setting out with the loose goal this spring of beating my first time, and then going for something reasonably ambitious in the fall.\n\nTo that end, in the short term, I want to run more during the next training cycle. Not necessarily harder, but more. I know I trained at about the barest possible minimal level for the fall race. Next time out I want to go from three days a week to four. I think I'm going to repeat the same basic 12-week training calendar as the last time out, which I liked the general feel of, with the addition of the fourth day, which would be a shorter, light/easy day. I have no plans to target five days as I want to keep a day or two free for an elliptical session or finding a strength training or yoga habit I like.\n\nWhile I said I don't necessarily want to run harder, I do generally want to bring my paces up across the board. Sometimes these last few months I felt fine, sometimes I felt like I had more to give but was holding back. I'm still not quite sure what easy *should* actually feel like but I think just in general the more I run the more efficient I get and if I can maintain my consistency through into the new year I'll naturally feel a little more okay going a little more fast a little more often. Maybe more importantly though, for confidence purposes, I want to push my race pace experiments more aggressively. I want to pick an ambitious target early and stick with it the whole way through. I really wasn't sure what felt right this last time through, and now I think I want to use those runs to push myself to give a little more. Still, even if it's nothing like what I run on race day, having those faster days in the training cycle feels fun. \n\nI'm also hoping to do some shorter races that I can really try for my best-possible paces. I'm thinking about re-doing the 10k I ran last spring, which left me feeling like I had something unresolved there that I'd like to make good on. I'm also curious to see if I can beat my summer 5k race's time from last year, too. Which actually feels like it could be the most ambitious goal of the year! If I find some 10k races that fit in with the half marathon plans, I might try to slide those in, too, for practice purposes, but I'm not sure that's going to work out or not.\n\nSo that's the year in a nutshell, as I picture it right now: a half, some shorter stuff, and then a give-it-my-all half by the year's end. Working on confidence, pace, and strength. And then all going well, launching into full marathon training come January 2024.\n",
				"date_published": "2022-11-29T18:30:00-05:00",
				"url": "https://darby3.micro.blog/2022/11/29/183000.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/29/oh-its-almost.html",
				
				"content_html": "<p>Oh it&rsquo;s almost <a href=\"https://adventofcode.com/\">Advent of Code</a> season. Looks like I made it 14 days before tapping out last year&hellip;though I&rsquo;m not sure how long those 14 days actually took.</p>\n",
				"content_text": "Oh it's almost [Advent of Code](https://adventofcode.com/) season. Looks like I made it 14 days before tapping out last year...though I'm not sure how long those 14 days actually took.\n",
				"date_published": "2022-11-29T15:35:07-05:00",
				"url": "https://darby3.micro.blog/2022/11/29/oh-its-almost.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/29/new-mug.html",
				
				"content_html": "<p>New mug. ☕️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "New mug. ☕️\n\n<img src=\"uploads/2022/7a8a6d9168.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-11-29T12:28:57-05:00",
				"url": "https://darby3.micro.blog/2022/11/29/new-mug.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/28/i-have-never.html",
				
				"content_html": "<p>I have never been so full of pie as I’ve been the last four days. 🥧</p>\n",
				"content_text": "I have never been so full of pie as I’ve been the last four days. 🥧\n",
				"date_published": "2022-11-28T19:26:01-05:00",
				"url": "https://darby3.micro.blog/2022/11/28/i-have-never.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/28/183000.html",
				"title": "Week twelve running report ... race week! 🏃",
				"content_html": "<p>Monday afternoon, about 24 hours after I crossed the finish line, is when I finally started to believe that I&rsquo;d just run my first half marathon. I felt pretty spaced out before that, like I&rsquo;d been walking through a post-race cloud, and it was only when I started to come out of it that I felt like I could not just know I did it as a fact but feel that I did it as a truth. If that makes sense. Like I could feel the nervous energy start to dissipate into a sense of accomplishment. It made for a nice post-race high.</p>\n<p>That said: oh my lord, I have never before felt <em>cold</em> like I did right after that race.</p>\n<p>To back up a bit: the week before the race I continued my taper. It got a little weird! I&rsquo;d planned on Tuesday/Thursday runs like usual with super-easy Monday/Friday elliptical sessions, all basically just to keep loose while resting up. Monday went fine, then Tuesday fell apart for various reasons, including truly miserable weather, and I wound up cancelling. So then I went back out for a handful of miles Wednesday night, a few at &ldquo;race pace,&rdquo; then had to turn around and get up early on Friday to get one more run in before work and the weekend. It all worked out fine, and my fears of over-sleeping Friday came to nothing, but the whole stutter-step of a final week&rsquo;s schedule was <em>slightly</em> nerve-wracking.</p>\n<p>I felt good Friday, and slept like a baby that night, which was nice, because I knew I&rsquo;d probably <em>not</em> sleep like a baby the night before the race. (Spoiler alert: I did not sleep good Saturday night.) Saturday felt like one of the longest days of my life. I&rsquo;m learning just how susceptible I am to pre-race nerves. I know it&rsquo;s healthy to a degree, the body&rsquo;s way of getting amped up for the coming event. But I also think I was tipping a bit past &ldquo;excitement&rdquo; and more into &ldquo;bro, you <em>must chill</em>&rdquo; territory. I did not enjoy myself much that day. Again, everything worked out! But I know I want to work out a better day-before strategy for the future.</p>\n<p>Leading up to race day I was watching the weather forecast. Specifically, I was watching the forecasted temperature drop like a rock. Signing up for a late November race in northeast Ohio, I have some idea what I&rsquo;m getting myself into. But! Yikes! Based on my experience at the 5k at the same event last year, I was happily anticipating low-40s, gray clouds, maybe some fog. You know&hellip;perfect running weather. I was not prepared for the low 20s. With a wind chill that took it down to single-digit territory.</p>\n<p>&ldquo;How cold was it,&rdquo; you ask? Could enough that I&rsquo;d never adequately had the chance to test race day gear—I&rsquo;d run in three layers of clothing earlier that week, but decided at the last minute to throw on a fourth vest layer on top on my running fleece layer. Cold enough that every time I thought I was warmed up enough during the run that I could unzip those top two layers to vent, I was zipping back up within minutes. Cold enough that the water they were giving out on the course was actually freezing—at least, there were definitely ice chips in mine. Cold enough that a friend of mine said her water pack vest froze up on her, so she couldn&rsquo;t use it during the race. Like, this was not fun running cold. This was <em>real</em> cold. Did I need to score those extra bad-ass points my first time out? No. Did I, though? I guess so!</p>\n<p>The good news is the snow that hit near my house up by the lake was a non-issue to the south, and we got some beautiful (if heatless) sun for the entirety of the race, too. Good for keeping spirits up, at least. And yet, still, it was <em>cold</em> cold.</p>\n<p>As for how I did: I did it. If you&rsquo;ve been following along you know my one goal going into the run was to run the whole way and&hellip;I did that. I ran the whole way. I took full advantage of my &ldquo;I don&rsquo;t care about pace this time out&rdquo; mindset. My pace was way at the slowest end of my anticipated range, but I still came in just ahead of my &ldquo;Something probably went wrong&rdquo; time. I&rsquo;ll take it! I definitely went very conservative on pacing, as thoughts of burning out early were strong. And of course the weather this fall was way too kind, affording no appropriate lead-in down to race-day temperatures.</p>\n<p>All that said, there really were some nice stretches in the middle where the miles did kind of melt into each other. Five through eight, maybe? Things did get uglier as I went on, though. While I knew for a fact I could do it, I still felt like I had to dig in a bit to convince myself that I was <em>going</em> to do it. That it was going to be <em>way</em> more fun to be able to tell everyone afterward that I did in fact make it. That working for the hard thing, and then achieving it, was exactly the kind of example I wanted to set for my two kids. That if I stopped running, it was going to be a real cold walk back to the finish line&hellip;</p>\n<p>The course was nice—an out-and-back double-loop along the Cleveland Metroparks parkway drive. Quiet; I did in fact run without music, to prove to myself I could, and without getting into future plans yet, I&rsquo;m not sure I&rsquo;m going to feel the need to do that again! Not much in the way of spectators, of course, because of the weather and because of where the course was run. It was fun to see all the fast people running back the other way several times over from my back-of-the-pack vantage point. Huge props to all the volunteers along the course. Every kind word was incredible.</p>\n<p>Crossing the finish line, which I finally actually really believed I was going to do once I finally caught sight of it, wasn&rsquo;t exactly anti-climactic, but it also wasn&rsquo;t really accompanied by an orchestral swell, either—that feeling, as I said above, really didn&rsquo;t come until 24 hours later. Crossing the finish line mostly meant <em>oh my god wow I can stop running now</em>. Which felt really nice for a while. Until the cold settled in. Which I knew to anticipate, but, like, I couldn&rsquo;t <em>really</em> anticipate what standing in freezing temperatures in four sweaty layers was actually going to feel like. Suffice it to say I did not finish my post-race beer—though no cold was going to stop me from having at least a few victory chugs—before I went home, showered with all the hot water in the house, and then collapsed under multiple blankets for a few hours, until my body finally felt <em>almost</em> warm again.</p>\n<p>And thus concludes my first half-marathon training cycle, which was as much about the journey as the destination. It&rsquo;s been a week and I&rsquo;m feeling surprisingly good. I was concerned about post-race blues, but knock on wood, so far my spirits have stayed up—landing the race right before a busy holiday week probably helped with that. And knowing even before going into the race that it was always going to be part of a bigger picture, with some next steps already tentatively laid out, certainly hasn&rsquo;t hurt. For now, though, I&rsquo;ve been out for a couple short, light recovery runs, and I&rsquo;m feeling okay, and I think it&rsquo;s going to be nice to just run for fun with no training expectations for a little while, which I haven&rsquo;t actually done since&hellip;April, I think? What a wild year it has been&hellip;</p>\n",
				"content_text": "Monday afternoon, about 24 hours after I crossed the finish line, is when I finally started to believe that I'd just run my first half marathon. I felt pretty spaced out before that, like I'd been walking through a post-race cloud, and it was only when I started to come out of it that I felt like I could not just know I did it as a fact but feel that I did it as a truth. If that makes sense. Like I could feel the nervous energy start to dissipate into a sense of accomplishment. It made for a nice post-race high.\n\nThat said: oh my lord, I have never before felt *cold* like I did right after that race.\n\nTo back up a bit: the week before the race I continued my taper. It got a little weird! I'd planned on Tuesday/Thursday runs like usual with super-easy Monday/Friday elliptical sessions, all basically just to keep loose while resting up. Monday went fine, then Tuesday fell apart for various reasons, including truly miserable weather, and I wound up cancelling. So then I went back out for a handful of miles Wednesday night, a few at \"race pace,\" then had to turn around and get up early on Friday to get one more run in before work and the weekend. It all worked out fine, and my fears of over-sleeping Friday came to nothing, but the whole stutter-step of a final week's schedule was *slightly* nerve-wracking.\n\nI felt good Friday, and slept like a baby that night, which was nice, because I knew I'd probably *not* sleep like a baby the night before the race. (Spoiler alert: I did not sleep good Saturday night.) Saturday felt like one of the longest days of my life. I'm learning just how susceptible I am to pre-race nerves. I know it's healthy to a degree, the body's way of getting amped up for the coming event. But I also think I was tipping a bit past \"excitement\" and more into \"bro, you *must chill*\" territory. I did not enjoy myself much that day. Again, everything worked out! But I know I want to work out a better day-before strategy for the future.\n\nLeading up to race day I was watching the weather forecast. Specifically, I was watching the forecasted temperature drop like a rock. Signing up for a late November race in northeast Ohio, I have some idea what I'm getting myself into. But! Yikes! Based on my experience at the 5k at the same event last year, I was happily anticipating low-40s, gray clouds, maybe some fog. You know...perfect running weather. I was not prepared for the low 20s. With a wind chill that took it down to single-digit territory.\n\n\"How cold was it,\" you ask? Could enough that I'd never adequately had the chance to test race day gear—I'd run in three layers of clothing earlier that week, but decided at the last minute to throw on a fourth vest layer on top on my running fleece layer. Cold enough that every time I thought I was warmed up enough during the run that I could unzip those top two layers to vent, I was zipping back up within minutes. Cold enough that the water they were giving out on the course was actually freezing—at least, there were definitely ice chips in mine. Cold enough that a friend of mine said her water pack vest froze up on her, so she couldn't use it during the race. Like, this was not fun running cold. This was *real* cold. Did I need to score those extra bad-ass points my first time out? No. Did I, though? I guess so!\n\nThe good news is the snow that hit near my house up by the lake was a non-issue to the south, and we got some beautiful (if heatless) sun for the entirety of the race, too. Good for keeping spirits up, at least. And yet, still, it was *cold* cold. \n\nAs for how I did: I did it. If you've been following along you know my one goal going into the run was to run the whole way and...I did that. I ran the whole way. I took full advantage of my \"I don't care about pace this time out\" mindset. My pace was way at the slowest end of my anticipated range, but I still came in just ahead of my \"Something probably went wrong\" time. I'll take it! I definitely went very conservative on pacing, as thoughts of burning out early were strong. And of course the weather this fall was way too kind, affording no appropriate lead-in down to race-day temperatures.\n\nAll that said, there really were some nice stretches in the middle where the miles did kind of melt into each other. Five through eight, maybe? Things did get uglier as I went on, though. While I knew for a fact I could do it, I still felt like I had to dig in a bit to convince myself that I was *going* to do it. That it was going to be *way* more fun to be able to tell everyone afterward that I did in fact make it. That working for the hard thing, and then achieving it, was exactly the kind of example I wanted to set for my two kids. That if I stopped running, it was going to be a real cold walk back to the finish line...\n\nThe course was nice—an out-and-back double-loop along the Cleveland Metroparks parkway drive. Quiet; I did in fact run without music, to prove to myself I could, and without getting into future plans yet, I'm not sure I'm going to feel the need to do that again! Not much in the way of spectators, of course, because of the weather and because of where the course was run. It was fun to see all the fast people running back the other way several times over from my back-of-the-pack vantage point. Huge props to all the volunteers along the course. Every kind word was incredible.\n\nCrossing the finish line, which I finally actually really believed I was going to do once I finally caught sight of it, wasn't exactly anti-climactic, but it also wasn't really accompanied by an orchestral swell, either—that feeling, as I said above, really didn't come until 24 hours later. Crossing the finish line mostly meant *oh my god wow I can stop running now*. Which felt really nice for a while. Until the cold settled in. Which I knew to anticipate, but, like, I couldn't *really* anticipate what standing in freezing temperatures in four sweaty layers was actually going to feel like. Suffice it to say I did not finish my post-race beer—though no cold was going to stop me from having at least a few victory chugs—before I went home, showered with all the hot water in the house, and then collapsed under multiple blankets for a few hours, until my body finally felt *almost* warm again.\n\nAnd thus concludes my first half-marathon training cycle, which was as much about the journey as the destination. It's been a week and I'm feeling surprisingly good. I was concerned about post-race blues, but knock on wood, so far my spirits have stayed up—landing the race right before a busy holiday week probably helped with that. And knowing even before going into the race that it was always going to be part of a bigger picture, with some next steps already tentatively laid out, certainly hasn't hurt. For now, though, I've been out for a couple short, light recovery runs, and I'm feeling okay, and I think it's going to be nice to just run for fun with no training expectations for a little while, which I haven't actually done since...April, I think? What a wild year it has been...\n",
				"date_published": "2022-11-28T18:30:00-05:00",
				"url": "https://darby3.micro.blog/2022/11/28/183000.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/28/editing-an-email.html",
				
				"content_html": "<p>Editing an email I drafted before the long weekend. Chop chop chop. Wow. I should institute a 96-hour quarantine on all outgoing mail&hellip;</p>\n",
				"content_text": "Editing an email I drafted before the long weekend. Chop chop chop. Wow. I should institute a 96-hour quarantine on all outgoing mail...\n",
				"date_published": "2022-11-28T09:26:46-05:00",
				"url": "https://darby3.micro.blog/2022/11/28/editing-an-email.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/27/i-never-feel.html",
				
				"content_html": "<p>I never feel so old as when I think about my son’s interest in Pokémon.</p>\n",
				"content_text": "I never feel so old as when I think about my son’s interest in Pokémon. \n",
				"date_published": "2022-11-27T14:34:45-05:00",
				"url": "https://darby3.micro.blog/2022/11/27/i-never-feel.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/27/ill-say-that.html",
				
				"content_html": "<p>I’ll say that running that race directly before a holiday week was nice for lots of reasons but having an abundance of time to write up the post-race write up has not been one of them…</p>\n",
				"content_text": "I’ll say that running that race directly before a holiday week was nice for lots of reasons but having an abundance of time to write up the post-race write up has not been one of them…\n",
				"date_published": "2022-11-27T10:04:03-05:00",
				"url": "https://darby3.micro.blog/2022/11/27/ill-say-that.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/27/going-to-do.html",
				
				"content_html": "<p>Going to do a load of laundry that’s nothing but duvet covers and accidentally tear open a hole in the multiverse.</p>\n",
				"content_text": "Going to do a load of laundry that’s nothing but duvet covers and accidentally tear open a hole in the multiverse. \n",
				"date_published": "2022-11-27T09:51:44-05:00",
				"url": "https://darby3.micro.blog/2022/11/27/going-to-do.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/26/a-good-ipa.html",
				
				"content_html": "<p>A good IPA pairs well with <em>John Wick</em>.</p>\n",
				"content_text": "A good IPA pairs well with *John Wick*. \n",
				"date_published": "2022-11-26T22:17:52-05:00",
				"url": "https://darby3.micro.blog/2022/11/26/a-good-ipa.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/25/i-want-to.html",
				
				"content_html": "<p>I want to start a podcast that’s just a critical review of the usability of DVD/Blu-Ray menu interfaces.</p>\n",
				"content_text": "I want to start a podcast that’s just a critical review of the usability of DVD/Blu-Ray menu interfaces. \n",
				"date_published": "2022-11-25T21:34:02-05:00",
				"url": "https://darby3.micro.blog/2022/11/25/i-want-to.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/23/picked-up-the.html",
				
				"content_html": "<p>Picked up the starter Ableton offering via the black Friday sale the other day. I haven&rsquo;t touched it before this week in ages. I still kind of love it. Like a big box of toy parts.</p>\n",
				"content_text": "Picked up the starter Ableton offering via the black Friday sale the other day. I haven't touched it before this week in ages. I still kind of love it. Like a big box of toy parts.\n",
				"date_published": "2022-11-23T14:19:29-05:00",
				"url": "https://darby3.micro.blog/2022/11/23/picked-up-the.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/23/still-working-on.html",
				
				"content_html": "<p>Still working on that post-race running update. Lots to say, lots to say&hellip;</p>\n",
				"content_text": "Still working on that post-race running update. Lots to say, lots to say...\n",
				"date_published": "2022-11-23T12:52:59-05:00",
				"url": "https://darby3.micro.blog/2022/11/23/still-working-on.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/23/thus-concludes-the.html",
				
				"content_html": "<p>(Thus concludes the navel-gazing for a bit.)</p>\n",
				"content_text": "(Thus concludes the navel-gazing for a bit.)\n",
				"date_published": "2022-11-23T10:28:17-05:00",
				"url": "https://darby3.micro.blog/2022/11/23/thus-concludes-the.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/23/also-realizing-just.html",
				
				"content_html": "<p>Also realizing just how much my real-life introvert personality is spilling over into my approach to online, whether or not it shows to anyone aside from me, or whether it even matters.</p>\n",
				"content_text": "Also realizing just how much my real-life introvert personality is spilling over into my approach to online, whether or not it shows to anyone aside from me, or whether it even matters. \n",
				"date_published": "2022-11-23T10:28:01-05:00",
				"url": "https://darby3.micro.blog/2022/11/23/also-realizing-just.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/23/having-been-away.html",
				
				"content_html": "<p>Having been away from Twitter for much of the year now, having gotten away from the surprisingly heavy personal emotional baggage that went along with being on that platform&hellip;.I&rsquo;m not sure I&rsquo;m enjoying seeing Mastodon picking up steam.</p>\n",
				"content_text": "Having been away from Twitter for much of the year now, having gotten away from the surprisingly heavy personal emotional baggage that went along with being on that platform....I'm not sure I'm enjoying seeing Mastodon picking up steam.\n",
				"date_published": "2022-11-23T10:25:44-05:00",
				"url": "https://darby3.micro.blog/2022/11/23/having-been-away.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/21/surreal-detail-stuck.html",
				
				"content_html": "<p>Surreal detail, stuck in my memory: during yesterday&rsquo;s half marathon race, the water served on the course had bits of ice in it.</p>\n",
				"content_text": "Surreal detail, stuck in my memory: during yesterday's half marathon race, the water served on the course had bits of ice in it.\n",
				"date_published": "2022-11-21T13:16:58-05:00",
				"url": "https://darby3.micro.blog/2022/11/21/surreal-detail-stuck.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/20/full-write-up.html",
				
				"content_html": "<p>Full write up to come, but for now: I did it! I ran my first half marathon. In 20 degree weather. With really breezy breezes. (I kind of can’t believe I actually did that.) 🏃</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Full write up to come, but for now: I did it! I ran my first half marathon. In 20 degree weather. With really breezy breezes. (I kind of can’t believe I actually did that.) 🏃\n\n<img src=\"uploads/2022/0c81c7cc52.jpg\" width=\"450\" height=\"600\" alt=\"Darby holding Fall Classic 2022 half marathon finisher's coaster\">\n",
				"date_published": "2022-11-20T17:39:16-05:00",
				"url": "https://darby3.micro.blog/2022/11/20/full-write-up.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/18/i-woke-up.html",
				
				"content_html": "<p>I woke up pretty early today for my last pre-race run. Here&rsquo;s to hoping I don&rsquo;t tire out too hard before the day&rsquo;s end. 🏃</p>\n",
				"content_text": "I woke up pretty early today for my last pre-race run. Here's to hoping I don't tire out too hard before the day's end. 🏃\n",
				"date_published": "2022-11-18T11:58:35-05:00",
				"url": "https://darby3.micro.blog/2022/11/18/i-woke-up.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/17/years-not-over.html",
				
				"content_html": "<p>Year&rsquo;s not over yet, but unless something really sneaks up on me, I&rsquo;ve realized recently that my album of the year is probably going to be <a href=\"https://hatchie.bandcamp.com/album/giving-the-world-away\"><em>Giving the World Away</em> by Hatchie.</a> 🎵</p>\n",
				"content_text": "Year's not over yet, but unless something really sneaks up on me, I've realized recently that my album of the year is probably going to be [*Giving the World Away* by Hatchie.](https://hatchie.bandcamp.com/album/giving-the-world-away) 🎵\n",
				"date_published": "2022-11-17T16:22:07-05:00",
				"url": "https://darby3.micro.blog/2022/11/17/years-not-over.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/17/ive-got-the.html",
				
				"content_html": "<p>I&rsquo;ve got the updated look for gmail now and I don&rsquo;t like it. I don&rsquo;t know why I don&rsquo;t like it. I&rsquo;m not even sure I know what&rsquo;s changed. But I really don&rsquo;t like it.</p>\n",
				"content_text": "I've got the updated look for gmail now and I don't like it. I don't know why I don't like it. I'm not even sure I know what's changed. But I really don't like it.\n",
				"date_published": "2022-11-17T09:28:24-05:00",
				"url": "https://darby3.micro.blog/2022/11/17/ive-got-the.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/16/trying-to-read.html",
				
				"content_html": "<p>Trying to read through a book on advanced PHP on my iPad. Reminded why I’m never going to use screens for my main method of reading.</p>\n",
				"content_text": "Trying to read through a book on advanced PHP on my iPad. Reminded why I’m never going to use screens for my main method of reading. \n",
				"date_published": "2022-11-16T19:41:11-05:00",
				"url": "https://darby3.micro.blog/2022/11/16/trying-to-read.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/16/currently-readinggods-help.html",
				
				"content_html": "<p>Currently reading&hellip;gods help me: <a href=\"https://micro.blog/books/9781250768681\">The Eye of the World</a> by Robert Jordan 📚</p>\n",
				"content_text": "Currently reading...gods help me: [The Eye of the World](https://micro.blog/books/9781250768681) by Robert Jordan 📚\n",
				"date_published": "2022-11-16T15:27:18-05:00",
				"url": "https://darby3.micro.blog/2022/11/16/currently-readinggods-help.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/16/not-that-im.html",
				
				"content_html": "<p>Not that I&rsquo;m <em>obsessing</em> or anything, but I&rsquo;ve been watching race-day weather. Specifically, I&rsquo;ve been watching the expected race-day temperatures drop, drop, drop. It&rsquo;s&hellip;gonna be a cold one. 🥶 🏃</p>\n",
				"content_text": "Not that I'm *obsessing* or anything, but I've been watching race-day weather. Specifically, I've been watching the expected race-day temperatures drop, drop, drop. It's...gonna be a cold one. 🥶 🏃\n",
				"date_published": "2022-11-16T12:02:12-05:00",
				"url": "https://darby3.micro.blog/2022/11/16/not-that-im.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/15/issue-thirteen-of.html",
				
				"content_html": "<p>Issue thirteen of my <a href=\"https://tinyletter.com/darby3\">books newsletter</a> is out! Covering books by David Abraham, Jennifer Egan, Ottessa Moshfegh, and Sanjena Sathian. 📚</p>\n",
				"content_text": "Issue thirteen of my [books newsletter](https://tinyletter.com/darby3) is out! Covering books by David Abraham, Jennifer Egan, Ottessa Moshfegh, and Sanjena Sathian. 📚\n",
				"date_published": "2022-11-15T20:10:06-05:00",
				"url": "https://darby3.micro.blog/2022/11/15/issue-thirteen-of.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/14/week-eleven-running.html",
				"title": "Week eleven running report 🏃",
				"content_html": "<p>Taper week! Ran four easy miles on Tuesday, four miles on Thursday with two of those at race pace, and five miles on Saturday, my shortest long run since week two. If I was bemoaning the lack of seasonably appropriate training weather the last few weeks, well, Saturday&rsquo;s run threw a big bucket of cold drizzly slushy nonsense right in my face. Felt good to have at least one proper day for testing out possible race day clothing, I suppose?</p>\n<p>I knew going into the week I was ready for this taper time, and while I don&rsquo;t have anything extremely specific to point at to confirm this, I can say I do feel like I&rsquo;m&hellip;actively recharging. Like I can now not just know but also <em>feel</em> the fact that I&rsquo;ve made real gains the last few months. If running week ten&rsquo;s total of 22.5 miles was a stretch and a challenge, one I felt proud to meet, running this week&rsquo;s total of 13 miles left me feeling like my body knew it had more to give. And I&rsquo;m both nervous and excited about tapping into that feeling this coming weekend. (How unfair is it, by the way, that it&rsquo;s when you have the most nervous energy, that you least get to do the thing that helps you vent that energy?)</p>\n<p>All of which&hellip;brings us to this coming Sunday. My goal for the race remains as clear as it has been since the start—get to the finish line without walking breaks. I know for a fact now that I can make it twelve miles—when I&rsquo;m pretty well under-rested, at that!—and I think I can reasonably trust that a mix of adrenaline and pure stubbornness will get me past the last 1.1 miles. I&rsquo;m feeling generally confident about this.</p>\n<p>The strategy to get to that point feels like it&rsquo;s all about how I start the race. That&rsquo;s where I&rsquo;ve got some mental baggage I need to shed: the first time I did a 5k and the one time I&rsquo;ve done a 10k, adrenaline and nerves pushed me out too hot, which killed me later in the run. I started training for this race assuming there&rsquo;s a good chance I&rsquo;d make similar mistakes&hellip;but now that I&rsquo;ve gotten to this point, I really, obviously don&rsquo;t want to! So I&rsquo;m hoping to learn from my past and to manage my nerves as I wait for the start, and to keep things real conservative and chill for as long as feels right. I&rsquo;ve been trying to listen to my body during my long runs, and I&rsquo;ve been trying to figure out when and how to ease up before reaching that red-line zone, without needing to come to a stop. If I feel good toward the middle of the race I know I can loosen up a bit more, and I hope there&rsquo;s a point toward the end when I can stop holding back and just <em>go</em>, because that sounds like it would be really, really fun&hellip;but to get to those points I need to avoid frying myself too early.</p>\n<p>Part of all this is reminding myself that I don&rsquo;t have a time goal this time out. I have a general idea where I &ldquo;should&rdquo; fall but I&rsquo;m choosing not to make that my concern this time. In large part because, well&hellip;like, this whole process has been an education and a trial, and as part of that, pace has been generally mysterious to me, anyways. Like: Saturday&rsquo;s miles <em>felt</em> easy, but turned out to be a bit on the quick side of my recent range, but not quite at the race pace I&rsquo;ve been practicing at (without any real intent of actually meeting on race day!). It felt really good; does it feel like the kind of easy-fast I can keep for a half-marathon? No idea! At this point I can happily admit I&rsquo;ve never had a good sense these last few months of what my pace zones should feel like. Whatever does happen Sunday I know I&rsquo;ve made obvious gains that I think I can have fun playing around with going forward.</p>\n<p>Which, yes, I have a lot of thoughts already about the <em>going forward</em> part. Which I am trying hard to keep on a shelf for the moment. Because for now I&rsquo;ve got a couple more taper runs to get through and then <a href=\"https://www.clewestrunningclub.org/fall-classic.html#/\">it&rsquo;s time to go do the thing</a>. (Okay, maybe I can go ahead and visualize going forward, a little bit&hellip;specifically, going forward from the finish line to the beer garden?&hellip;)</p>\n",
				"content_text": "Taper week! Ran four easy miles on Tuesday, four miles on Thursday with two of those at race pace, and five miles on Saturday, my shortest long run since week two. If I was bemoaning the lack of seasonably appropriate training weather the last few weeks, well, Saturday's run threw a big bucket of cold drizzly slushy nonsense right in my face. Felt good to have at least one proper day for testing out possible race day clothing, I suppose?\r\n\r\nI knew going into the week I was ready for this taper time, and while I don't have anything extremely specific to point at to confirm this, I can say I do feel like I'm...actively recharging. Like I can now not just know but also *feel* the fact that I've made real gains the last few months. If running week ten's total of 22.5 miles was a stretch and a challenge, one I felt proud to meet, running this week's total of 13 miles left me feeling like my body knew it had more to give. And I'm both nervous and excited about tapping into that feeling this coming weekend. (How unfair is it, by the way, that it's when you have the most nervous energy, that you least get to do the thing that helps you vent that energy?)\r\n\r\nAll of which...brings us to this coming Sunday. My goal for the race remains as clear as it has been since the start—get to the finish line without walking breaks. I know for a fact now that I can make it twelve miles—when I'm pretty well under-rested, at that!—and I think I can reasonably trust that a mix of adrenaline and pure stubbornness will get me past the last 1.1 miles. I'm feeling generally confident about this.\r\n\r\nThe strategy to get to that point feels like it's all about how I start the race. That's where I've got some mental baggage I need to shed: the first time I did a 5k and the one time I've done a 10k, adrenaline and nerves pushed me out too hot, which killed me later in the run. I started training for this race assuming there's a good chance I'd make similar mistakes...but now that I've gotten to this point, I really, obviously don't want to! So I'm hoping to learn from my past and to manage my nerves as I wait for the start, and to keep things real conservative and chill for as long as feels right. I've been trying to listen to my body during my long runs, and I've been trying to figure out when and how to ease up before reaching that red-line zone, without needing to come to a stop. If I feel good toward the middle of the race I know I can loosen up a bit more, and I hope there's a point toward the end when I can stop holding back and just *go*, because that sounds like it would be really, really fun...but to get to those points I need to avoid frying myself too early.\r\n\r\nPart of all this is reminding myself that I don't have a time goal this time out. I have a general idea where I \"should\" fall but I'm choosing not to make that my concern this time. In large part because, well...like, this whole process has been an education and a trial, and as part of that, pace has been generally mysterious to me, anyways. Like: Saturday's miles *felt* easy, but turned out to be a bit on the quick side of my recent range, but not quite at the race pace I've been practicing at (without any real intent of actually meeting on race day!). It felt really good; does it feel like the kind of easy-fast I can keep for a half-marathon? No idea! At this point I can happily admit I've never had a good sense these last few months of what my pace zones should feel like. Whatever does happen Sunday I know I've made obvious gains that I think I can have fun playing around with going forward.\r\n\r\nWhich, yes, I have a lot of thoughts already about the *going forward* part. Which I am trying hard to keep on a shelf for the moment. Because for now I've got a couple more taper runs to get through and then [it's time to go do the thing](https://www.clewestrunningclub.org/fall-classic.html#/). (Okay, maybe I can go ahead and visualize going forward, a little bit...specifically, going forward from the finish line to the beer garden?...)\n",
				"date_published": "2022-11-14T12:43:53-05:00",
				"url": "https://darby3.micro.blog/2022/11/14/week-eleven-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/14/i-see-interesting.html",
				
				"content_html": "<p>I see interesting conversations happen on MIcro.blog, and I kind of wish there was, like, something like a &ldquo;room&rdquo; you could join to follow them and/or chime in. Then I wonder if that&rsquo;s turning micro.blog into something like slack/discord, which I wouldn&rsquo;t want.</p>\n",
				"content_text": "I see interesting conversations happen on MIcro.blog, and I kind of wish there was, like, something like a \"room\" you could join to follow them and/or chime in. Then I wonder if that's turning micro.blog into something like slack/discord, which I wouldn't want.\n",
				"date_published": "2022-11-14T10:28:43-05:00",
				"url": "https://darby3.micro.blog/2022/11/14/i-see-interesting.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/10/twitter-whose-communication.html",
				
				"content_html": "<p>&ldquo;Twitter, whose communication department has been almost entirely laid off, did not immediately respond to a request for comment.&rdquo; Well, <a href=\"https://www.nytimes.com/2022/11/10/technology/elon-musk-twitter-employees.html?campaign_id=190&amp;emc=edit_ufn_20221110&amp;instance_id=77152&amp;nl=from-the-times&amp;regi_id=73937539&amp;segment_id=112738&amp;te=1&amp;user_id=6718190d78c8e47515b8f885d47cd446\">that</a> got a dark lol out of me.</p>\n",
				"content_text": "\"Twitter, whose communication department has been almost entirely laid off, did not immediately respond to a request for comment.\" Well, [that](https://www.nytimes.com/2022/11/10/technology/elon-musk-twitter-employees.html?campaign_id=190&emc=edit_ufn_20221110&instance_id=77152&nl=from-the-times&regi_id=73937539&segment_id=112738&te=1&user_id=6718190d78c8e47515b8f885d47cd446) got a dark lol out of me.\n",
				"date_published": "2022-11-10T12:04:29-05:00",
				"url": "https://darby3.micro.blog/2022/11/10/twitter-whose-communication.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/10/starting-to-prematurely.html",
				
				"content_html": "<p>Starting to (prematurely!) get into eyes-on-race-day-weather mode. Bummed many recent runs have been in such nice weather. Not the best prep for race morning&rsquo;s likely-in-the-30s temps. At least this weekend&rsquo;s short long run will be a bit chillier. 🏃</p>\n",
				"content_text": "Starting to (prematurely!) get into eyes-on-race-day-weather mode. Bummed many recent runs have been in such nice weather. Not the best prep for race morning's likely-in-the-30s temps. At least this weekend's short long run will be a bit chillier. 🏃\n",
				"date_published": "2022-11-10T11:05:12-05:00",
				"url": "https://darby3.micro.blog/2022/11/10/starting-to-prematurely.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/08/after-downloading-it.html",
				
				"content_html": "<p>After downloading it and then not really knowing what to do with it, I&rsquo;ve finally been settling into Obsidian as a general purpose writing app. Newsletter and blog post drafts, alongside misc. notes. Not doing anything fancy with it, but&hellip;I kind of like it for that.</p>\n",
				"content_text": "After downloading it and then not really knowing what to do with it, I've finally been settling into Obsidian as a general purpose writing app. Newsletter and blog post drafts, alongside misc. notes. Not doing anything fancy with it, but...I kind of like it for that.\n",
				"date_published": "2022-11-08T11:32:13-05:00",
				"url": "https://darby3.micro.blog/2022/11/08/after-downloading-it.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/08/love-to-hear.html",
				
				"content_html": "<p>Love to hear half the office is out sick. Love to hear it.</p>\n",
				"content_text": "Love to hear half the office is out sick. Love to hear it.\n",
				"date_published": "2022-11-08T09:22:02-05:00",
				"url": "https://darby3.micro.blog/2022/11/08/love-to-hear.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/07/when-i-see.html",
				
				"content_html": "<p>When I see people saying, re: Twitter, they don&rsquo;t want to quit because it would be like ceding the ground the wrong sort, I just think, you can&rsquo;t cede anything here—it was never yours to begin with. But I&rsquo;m afraid I&rsquo;ll come off as a jerk for saying so.</p>\n",
				"content_text": "When I see people saying, re: Twitter, they don't want to quit because it would be like ceding the ground the wrong sort, I just think, you can't cede anything here—it was never yours to begin with. But I'm afraid I'll come off as a jerk for saying so.\n",
				"date_published": "2022-11-07T16:28:56-05:00",
				"url": "https://darby3.micro.blog/2022/11/07/when-i-see.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/07/currently-reading-the.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780593535226\">The Passenger</a> by Cormac McCarthy 📚</p>\n",
				"content_text": "Currently reading: [The Passenger](https://micro.blog/books/9780593535226) by Cormac McCarthy 📚\n",
				"date_published": "2022-11-07T11:32:29-05:00",
				"url": "https://darby3.micro.blog/2022/11/07/currently-reading-the.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/05/week-ten-running.html",
				"title": "Week ten running report 🏃",
				"content_html": "<p>AKA…peak week!</p>\n<p>Spoiler alert: I made it!</p>\n<p>Tuesday was 4.5 miles, easy, down from last week’s five. I’ve been letting these “easy” runs get away from me, so, knowing this week‘s other two runs were going to be intense in their own ways, I consciously kept this one light. The kind of light that feels comical. Like, <em>am</em> I even running? I think I was successful. Kept my pace slow-for-me and heart rate down, and felt pretty good at the end. It’s a bit late in the game to reconnect with this kind of run for this training cycle, though it will come in handy during tapering, for sure. And it will be worth focusing on after the race, too.</p>\n<p>Thursday’s race pace run added a full mile, taking me up to four miles of pace (plus warm up and cool down miles). I kept that pace right around where I’d kept it the week before, with relatively few “Slow down, dummy!” alerts from my watch, all the way through the fourth mile. It felt really good and also <em>oh gee</em> did I feel it afterward, all the way through Friday. (It wasn’t exactly concerning so much as I felt generally beat up. Like I’ve been training for ten solid weeks to run my first half-marathon, or something. I imagine it would be weirder if I were still feeling extra fresh right now, right?) These pace runs have remained fun, though they still feel a bit aspirational. I’m not planning to actively seek that pace during this race, but maybe I’ve laid some good groundwork for future races.</p>\n<p>Then came Saturday’s twelve miler, a big jump from last week’s ten. My dream of the perfectly restorative night’s sleep didn’t pan out, and while I felt somewhat better this morning, I know I wasn’t back to one hundred percent, either. So I’m not surprised my average pace was slower than my last few long runs…but I <em>am</em> actually pleasantly surprised that I made it all twelve miles. (Those miles past ten are real big Life Choices, aren’t they?)</p>\n<p>I set my watch to alert me every three miles, which felt right; it wasn’t a twelve mile run, it wasn’t a run two miles longer than my last long run, it was just four three mile runs, back to back! For that first three miles I felt tight, like the whole thing was going to be too much <em>work</em>, and I was a little certain I was going to bag the whole thing by the halfway point. But…once I got into sections two and three, I loosened up, and it really didn’t feel so bad for a while. Until I got into the last segment, when my body was really starting to complain. Still, even then, that last bit of adrenaline pumped in, and I pulled off a nice final kick. Not my fastest stretch ever, but boy oh boy did realizing <em>I was still doing the thing</em> feel amazing.</p>\n<p>Which, again, just doing the thing is about all I’m looking for this time out, come race day. Race day, which is now two weeks away, on the other side of some <em>sweet, sweet, sweet</em> tapering. Oh, yes, I am looking forward to tapering. The rest is going to be nice. As will be not waking up approximately a million hours before dawn next Saturday!</p>\n",
				"content_text": "AKA…peak week! \n\nSpoiler alert: I made it!\n\nTuesday was 4.5 miles, easy, down from last week’s five. I’ve been letting these “easy” runs get away from me, so, knowing this week‘s other two runs were going to be intense in their own ways, I consciously kept this one light. The kind of light that feels comical. Like, *am* I even running? I think I was successful. Kept my pace slow-for-me and heart rate down, and felt pretty good at the end. It’s a bit late in the game to reconnect with this kind of run for this training cycle, though it will come in handy during tapering, for sure. And it will be worth focusing on after the race, too.\n\nThursday’s race pace run added a full mile, taking me up to four miles of pace (plus warm up and cool down miles). I kept that pace right around where I’d kept it the week before, with relatively few “Slow down, dummy!” alerts from my watch, all the way through the fourth mile. It felt really good and also *oh gee* did I feel it afterward, all the way through Friday. (It wasn’t exactly concerning so much as I felt generally beat up. Like I’ve been training for ten solid weeks to run my first half-marathon, or something. I imagine it would be weirder if I were still feeling extra fresh right now, right?) These pace runs have remained fun, though they still feel a bit aspirational. I’m not planning to actively seek that pace during this race, but maybe I’ve laid some good groundwork for future races.\n\nThen came Saturday’s twelve miler, a big jump from last week’s ten. My dream of the perfectly restorative night’s sleep didn’t pan out, and while I felt somewhat better this morning, I know I wasn’t back to one hundred percent, either. So I’m not surprised my average pace was slower than my last few long runs…but I *am* actually pleasantly surprised that I made it all twelve miles. (Those miles past ten are real big Life Choices, aren’t they?) \n\nI set my watch to alert me every three miles, which felt right; it wasn’t a twelve mile run, it wasn’t a run two miles longer than my last long run, it was just four three mile runs, back to back! For that first three miles I felt tight, like the whole thing was going to be too much *work*, and I was a little certain I was going to bag the whole thing by the halfway point. But…once I got into sections two and three, I loosened up, and it really didn’t feel so bad for a while. Until I got into the last segment, when my body was really starting to complain. Still, even then, that last bit of adrenaline pumped in, and I pulled off a nice final kick. Not my fastest stretch ever, but boy oh boy did realizing *I was still doing the thing* feel amazing. \n\nWhich, again, just doing the thing is about all I’m looking for this time out, come race day. Race day, which is now two weeks away, on the other side of some *sweet, sweet, sweet* tapering. Oh, yes, I am looking forward to tapering. The rest is going to be nice. As will be not waking up approximately a million hours before dawn next Saturday!\n",
				"date_published": "2022-11-05T18:52:48-05:00",
				"url": "https://darby3.micro.blog/2022/11/05/week-ten-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/04/the-fun-thing.html",
				
				"content_html": "<p>The fun thing about liking coffee and running is trying to limit intake on Fridays in order to try to get decent sleep before early Saturday morning long runs. Wait, did I say fun? I meant…something else, I’m too zonked to know what I meant. 🏃☕️</p>\n",
				"content_text": "The fun thing about liking coffee and running is trying to limit intake on Fridays in order to try to get decent sleep before early Saturday morning long runs. Wait, did I say fun? I meant…something else, I’m too zonked to know what I meant. 🏃☕️\n",
				"date_published": "2022-11-04T13:34:15-05:00",
				"url": "https://darby3.micro.blog/2022/11/04/the-fun-thing.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/04/on-behalf-of.html",
				
				"content_html": "<p>On behalf of all my fellow beer lovers who also have nut allergies: dear breweries, please stop the new trend of using pecans during brewing. 🍺</p>\n",
				"content_text": "On behalf of all my fellow beer lovers who also have nut allergies: dear breweries, please stop the new trend of using pecans during brewing. 🍺\n",
				"date_published": "2022-11-04T12:07:55-05:00",
				"url": "https://darby3.micro.blog/2022/11/04/on-behalf-of.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/03/spoiler-alert-tonights.html",
				
				"content_html": "<p>Spoiler alert: tonight’s six mile run was prettttttty nice. Intense. Nice. 🏃</p>\n",
				"content_text": "Spoiler alert: tonight’s six mile run was prettttttty nice. Intense. Nice. 🏃\n",
				"date_published": "2022-11-03T18:49:44-05:00",
				"url": "https://darby3.micro.blog/2022/11/03/spoiler-alert-tonights.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/03/well-my-nanowrimo.html",
				
				"content_html": "<p>Well, my nanowrimo document is up to 547 words, which is &hellip; 504 more words than I remember getting down last year. So there&rsquo;s that.</p>\n",
				"content_text": "Well, my nanowrimo document is up to 547 words, which is ... 504 more words than I remember getting down last year. So there's that.\n",
				"date_published": "2022-11-03T12:59:41-05:00",
				"url": "https://darby3.micro.blog/2022/11/03/well-my-nanowrimo.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/11/02/currently-reading-gold.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781984882059\">Gold Diggers</a> by Sanjena Sathian 📚</p>\n",
				"content_text": "Currently reading: [Gold Diggers](https://micro.blog/books/9781984882059) by Sanjena Sathian 📚\n",
				"date_published": "2022-11-02T12:45:32-05:00",
				"url": "https://darby3.micro.blog/2022/11/02/currently-reading-gold.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/11/01/and-so-i.html",
				
				"content_html": "<p>&hellip;and so I says to the date, a figure not&hellip;</p>\n",
				"content_text": "...and so I says to the date, a figure not...\n",
				"date_published": "2022-11-01T14:14:09-05:00",
				"url": "https://darby3.micro.blog/2022/11/01/and-so-i.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/31/created-a-nanowrimo.html",
				
				"content_html": "<p>Created a nanowrimo document. We&rsquo;ll see if I actually put anything into it this year.</p>\n",
				"content_text": "Created a nanowrimo document. We'll see if I actually put anything into it this year.\n",
				"date_published": "2022-10-31T10:54:33-05:00",
				"url": "https://darby3.micro.blog/2022/10/31/created-a-nanowrimo.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/30/week-nine-running.html",
				"title": "Week nine running report 🏃",
				"content_html": "<p>When I started writing up these weekly summaries, I wanted to document the downs as much as the ups, and based on my experience training for the 5k in July, I honestly thought there’d be more dramatic downs. Missed runs, weird injuries, crummy weeks. Knock on wood, there hasn’t been much of any of that. There’s minor things, weird things I’m maybe not getting into much, in the interest of keeping these updates somewhat brief, or maybe because I’m doing a bad job of writing down as much as I actually should. But…while I would never describe this process as <em>easy</em>, I‘m also really surprised—and, of course, pleased—at how generally smooth things have been going.</p>\n<p>Case in point: after the slightly weird, mildly narratively interesting week that was week eight, week nine felt…pretty fine! Essentially uneventful! Except of course not exactly uneventful because I ran 20 miles this week for the second time ever, which is certainly an <em>event</em>. But it also kind of just happened, which is nice.</p>\n<p>Five of those miles came from my easy run on Tuesday, which became an unintentional race pace kind of run for a bit, because I kind of just felt good and the weather kind of just felt perfect and I kind of just went faster than I meant to. It did not suck.</p>\n<p>Another five miles came from my actual race pace run on Thursday. In an effort to avoid the “I’m going to go <em>extra</em> sort of fast for the last stretch” thing I’ve been doing the last few weeks, I set my watch to just notify me when the three race pace miles were done, rather than notifying me at each mile. That helped, I think. I mean, it made the race pace segment feel very long, but it stayed pretty steady, which felt nice.</p>\n<p>And then of course ten miles came on Saturday morning, which had me out the door before sunrise. I kept the route generally more flat than the previous time I went out for ten miles. It felt long, but it also felt pretty good; certainly better than the week previous. I definitely felt like I needed to push myself to finish, a bit, near the end—ten miles really is so many miles! I think it showed up in my pace graph; my first three miles were on my slower side, but then my last three miles were pretty fast, the last two actually edging into my hypothetical race pace range. All in, where my last three long runs all hit the exact same average pace, this one landed the average at exactly two seconds faster. I’ll take it!</p>\n<p>I know, intuitively, that running can be as much a mental game as a physical one. That said, it has long been hard to imagine ever reaching the point where a run could get long enough to become kind of boring. While I’m not exactly there yet, I feel like I can see that territory around me, now, on some of these runs. I’m starting to consciously play with that a bit.</p>\n<p>So like, for this long run, instead of having my watch buzz me after every mile, I had it buzz me after every 2.5 miles, to see what it feels like when I thought of the run less as being a collection of ten miles and more as four longer segments. I’m not sure how much of a difference it made, until near the end, when that last segment started, and it felt like, somewhat irrationally, it was going to be <em>so much longer than all the others</em>.</p>\n<p>More dramatically, I also took this long run without music. Though I run with music all the time—a subject worth its own post—I’ll leave the headphones behind on race day. It’s not that I’m worried anyone’s going to think I’m tempo matching or anything—I’m clearly too slow for that to even matter! It’s more out of, in part, wanting to keep my situational awareness levels up, as I never run with others around me, and also, in part, because letting in spectator noise, picking up that energy, feels really cool; in the shorter races I’ve done, it’s a huge part of what’s made the actual race feel like a real thing. Still, thirteen (point one!) miles is a long time to run without one of my primary crutches, and I wanted to take at least one test run ahead of time without music to make sure I actually could do it. Confirmed: I can actually do it! At least, I can for ten miles. I’ll have to trust race day adrenaline will keep me going for the last three, though, because I’m definitely soundtracking next week’s twelve miler. It’s just way more fun that way.</p>\n<p>Three more weeks to go.</p>\n",
				"content_text": "When I started writing up these weekly summaries, I wanted to document the downs as much as the ups, and based on my experience training for the 5k in July, I honestly thought there’d be more dramatic downs. Missed runs, weird injuries, crummy weeks. Knock on wood, there hasn’t been much of any of that. There’s minor things, weird things I’m maybe not getting into much, in the interest of keeping these updates somewhat brief, or maybe because I’m doing a bad job of writing down as much as I actually should. But…while I would never describe this process as *easy*, I‘m also really surprised—and, of course, pleased—at how generally smooth things have been going. \n\nCase in point: after the slightly weird, mildly narratively interesting week that was week eight, week nine felt…pretty fine! Essentially uneventful! Except of course not exactly uneventful because I ran 20 miles this week for the second time ever, which is certainly an *event*. But it also kind of just happened, which is nice. \n\nFive of those miles came from my easy run on Tuesday, which became an unintentional race pace kind of run for a bit, because I kind of just felt good and the weather kind of just felt perfect and I kind of just went faster than I meant to. It did not suck.\n\nAnother five miles came from my actual race pace run on Thursday. In an effort to avoid the “I’m going to go *extra* sort of fast for the last stretch” thing I’ve been doing the last few weeks, I set my watch to just notify me when the three race pace miles were done, rather than notifying me at each mile. That helped, I think. I mean, it made the race pace segment feel very long, but it stayed pretty steady, which felt nice.\n\nAnd then of course ten miles came on Saturday morning, which had me out the door before sunrise. I kept the route generally more flat than the previous time I went out for ten miles. It felt long, but it also felt pretty good; certainly better than the week previous. I definitely felt like I needed to push myself to finish, a bit, near the end—ten miles really is so many miles! I think it showed up in my pace graph; my first three miles were on my slower side, but then my last three miles were pretty fast, the last two actually edging into my hypothetical race pace range. All in, where my last three long runs all hit the exact same average pace, this one landed the average at exactly two seconds faster. I’ll take it!\n\nI know, intuitively, that running can be as much a mental game as a physical one. That said, it has long been hard to imagine ever reaching the point where a run could get long enough to become kind of boring. While I’m not exactly there yet, I feel like I can see that territory around me, now, on some of these runs. I’m starting to consciously play with that a bit. \n\nSo like, for this long run, instead of having my watch buzz me after every mile, I had it buzz me after every 2.5 miles, to see what it feels like when I thought of the run less as being a collection of ten miles and more as four longer segments. I’m not sure how much of a difference it made, until near the end, when that last segment started, and it felt like, somewhat irrationally, it was going to be *so much longer than all the others*.\n\nMore dramatically, I also took this long run without music. Though I run with music all the time—a subject worth its own post—I’ll leave the headphones behind on race day. It’s not that I’m worried anyone’s going to think I’m tempo matching or anything—I’m clearly too slow for that to even matter! It’s more out of, in part, wanting to keep my situational awareness levels up, as I never run with others around me, and also, in part, because letting in spectator noise, picking up that energy, feels really cool; in the shorter races I’ve done, it’s a huge part of what’s made the actual race feel like a real thing. Still, thirteen (point one!) miles is a long time to run without one of my primary crutches, and I wanted to take at least one test run ahead of time without music to make sure I actually could do it. Confirmed: I can actually do it! At least, I can for ten miles. I’ll have to trust race day adrenaline will keep me going for the last three, though, because I’m definitely soundtracking next week’s twelve miler. It’s just way more fun that way.\n\nThree more weeks to go.\n",
				"date_published": "2022-10-30T22:59:36-05:00",
				"url": "https://darby3.micro.blog/2022/10/30/week-nine-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/28/havent-been-playing.html",
				
				"content_html": "<p>Haven&rsquo;t been playing as much on the PS5 as I&rsquo;d like, but did finish off the main story of Ratchet &amp; Clank: Rift Apart last night. As pure spectacle in the form of gaming comfort food, it did not disappoint. 🎮</p>\n",
				"content_text": "Haven't been playing as much on the PS5 as I'd like, but did finish off the main story of Ratchet & Clank: Rift Apart last night. As pure spectacle in the form of gaming comfort food, it did not disappoint. 🎮\n",
				"date_published": "2022-10-28T11:05:03-05:00",
				"url": "https://darby3.micro.blog/2022/10/28/havent-been-playing.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/28/feeling-professionally-restless.html",
				
				"content_html": "<p>Feeling professionally restless, which energy I appear to be pouring into fiddling with equalizer settings. H&rsquo;rm.</p>\n",
				"content_text": "Feeling professionally restless, which energy I appear to be pouring into fiddling with equalizer settings. H'rm.\n",
				"date_published": "2022-10-28T08:20:43-05:00",
				"url": "https://darby3.micro.blog/2022/10/28/feeling-professionally-restless.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/26/i-finished-reading.html",
				
				"content_html": "<p>I finished reading <em>Mordew</em> by Alex Pheby over lunch and I might have to be done with books for the year. I don&rsquo;t know that I can follow it up with anything. True magic. Perhaps&hellip;<em>post-magic</em>. I want to give this book to everyone. 📚</p>\n",
				"content_text": "I finished reading *Mordew* by Alex Pheby over lunch and I might have to be done with books for the year. I don't know that I can follow it up with anything. True magic. Perhaps...*post-magic*. I want to give this book to everyone. 📚\n",
				"date_published": "2022-10-26T14:40:25-05:00",
				"url": "https://darby3.micro.blog/2022/10/26/i-finished-reading.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/26/my-latest-books.html",
				
				"content_html": "<p><a href=\"https://tinyletter.com/darby3\">My latest books newsletter just went out</a>, featuring novels by Wole Soyinka, Minae Mizumura, and Jon Fosse. 📚</p>\n",
				"content_text": "[My latest books newsletter just went out](https://tinyletter.com/darby3), featuring novels by Wole Soyinka, Minae Mizumura, and Jon Fosse. 📚\n",
				"date_published": "2022-10-26T13:01:49-05:00",
				"url": "https://darby3.micro.blog/2022/10/26/my-latest-books.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/26/the-fun-thing.html",
				
				"content_html": "<p>The fun thing about switching code editors is the inevitable period of chaos that finding a suitable color scheme invokes.</p>\n",
				"content_text": "The fun thing about switching code editors is the inevitable period of chaos that finding a suitable color scheme invokes.\n",
				"date_published": "2022-10-26T09:28:22-05:00",
				"url": "https://darby3.micro.blog/2022/10/26/the-fun-thing.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/24/123000.html",
				"title": "Week eight running report 🏃",
				"content_html": "<p>I was in a weird headspace this week. Nothing calamitous, just enough to feel slightly <em>off</em>. Despite two of my three runs going longer, it was still technically a lighter week in terms of total mileage, so I guess if there was a week to feel a bit off, this was the one.</p>\n<p>My Tuesday evening easy run went up to 4.5 miles. After several failed attempts to run early to avoid rain, I wound up running at my usual time…in the rain. It was fine. Fairly light. Cold, though. I&rsquo;m glad I invested earlier this year in a good rain jacket for running.</p>\n<p>Thursday took me out for five miles, three playing with race pace. I kept a pleasant pace for the first two then pushed it for number three, going fast-for-me and definitely outside my distance-run comfort zone. Fun to go past the point of sustainability, though I really do want to convince myself to keep it in check the next couple weeks. I think there&rsquo;s a sweet spot in there somewhere. Not sure I&rsquo;m going to feel comfortable trying for it this coming race, because really still all I want to do is get to that finish line in one piece. But, again, fun to play. And maybe lay groundwork for mnore ambitious (yet still hypothetical) future attempts.</p>\n<p>Saturday&rsquo;s long run was eight miles. Ignoring the fact that I only actually just ran eight for the first time ever three weeks earlier, I took a slightly-too-nonchalant attitude toward this run, because it was technically less than the previous week&rsquo;s ten miles. Eight, after doing ten? Ought to be a breeze, right? So after three morning long runs I went back to my usual afternoon slot, after spending the morning out with my family, putting in at least a mile of photography-and-kids-chasing time around Metroparks trails. Then I had a heavy lunch, much heavier than the lighter &ldquo;let&rsquo;s see what might actually work on race day&rdquo; breakfasts I&rsquo;ve been trying out. Oh, and it was like 30 degrees warmer outside than either of my weekday runs from this week.</p>\n<p>Long story short, this run felt ugly. But! My average pace exactly matched that from the previous two long runs. Three long runs in a row with the exact same average pace is weird, right?</p>\n<p>So, glad I got it done, grateful for the educational experience, but I&rsquo;m also happy to put this week behind me. Feels like one to shake off, like a good time to take a deep breath and recenter. The next two weeks are doozies for me, at 20 and 22.5 miles, respectively. I&rsquo;ll definitely be trying to get back out in the morning for those long runs.</p>\n<p>Four weeks until race day! Four weeks until race day? Four weeks until race day&hellip;</p>\n",
				"content_text": "I was in a weird headspace this week. Nothing calamitous, just enough to feel slightly *off*. Despite two of my three runs going longer, it was still technically a lighter week in terms of total mileage, so I guess if there was a week to feel a bit off, this was the one.  \n\nMy Tuesday evening easy run went up to 4.5 miles. After several failed attempts to run early to avoid rain, I wound up running at my usual time…in the rain. It was fine. Fairly light. Cold, though. I'm glad I invested earlier this year in a good rain jacket for running.\n\nThursday took me out for five miles, three playing with race pace. I kept a pleasant pace for the first two then pushed it for number three, going fast-for-me and definitely outside my distance-run comfort zone. Fun to go past the point of sustainability, though I really do want to convince myself to keep it in check the next couple weeks. I think there's a sweet spot in there somewhere. Not sure I'm going to feel comfortable trying for it this coming race, because really still all I want to do is get to that finish line in one piece. But, again, fun to play. And maybe lay groundwork for mnore ambitious (yet still hypothetical) future attempts.\n\nSaturday's long run was eight miles. Ignoring the fact that I only actually just ran eight for the first time ever three weeks earlier, I took a slightly-too-nonchalant attitude toward this run, because it was technically less than the previous week's ten miles. Eight, after doing ten? Ought to be a breeze, right? So after three morning long runs I went back to my usual afternoon slot, after spending the morning out with my family, putting in at least a mile of photography-and-kids-chasing time around Metroparks trails. Then I had a heavy lunch, much heavier than the lighter \"let's see what might actually work on race day\" breakfasts I've been trying out. Oh, and it was like 30 degrees warmer outside than either of my weekday runs from this week. \n\nLong story short, this run felt ugly. But! My average pace exactly matched that from the previous two long runs. Three long runs in a row with the exact same average pace is weird, right? \n\nSo, glad I got it done, grateful for the educational experience, but I'm also happy to put this week behind me. Feels like one to shake off, like a good time to take a deep breath and recenter. The next two weeks are doozies for me, at 20 and 22.5 miles, respectively. I'll definitely be trying to get back out in the morning for those long runs.\n\nFour weeks until race day! Four weeks until race day? Four weeks until race day...\n",
				"date_published": "2022-10-24T11:30:00-05:00",
				"url": "https://darby3.micro.blog/2022/10/24/123000.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/24/been-thinking-about.html",
				
				"content_html": "<p>Been thinking about finally upgrading my laptop when the 16&quot; M2s come out. But now there&rsquo;s a particular refurbished M1, way overpowered for my needs, but which is significantly discounted. Tempted to the point of analysis paralysis.</p>\n",
				"content_text": "Been thinking about finally upgrading my laptop when the 16\" M2s come out. But now there's a particular refurbished M1, way overpowered for my needs, but which is significantly discounted. Tempted to the point of analysis paralysis.\n",
				"date_published": "2022-10-24T08:49:51-05:00",
				"url": "https://darby3.micro.blog/2022/10/24/been-thinking-about.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/21/had-to-scratch.html",
				
				"content_html": "<p>Had to scratch that itch: I&rsquo;ve got a super basic Firefox browser extension going now that adds those  hide mentions/hide short posts micro.blog bookmarklets directly into the browser.</p>\n<p><a href=\"https://youtu.be/j_OxIKMYw7w\">youtu.be/j_OxIKMYw&hellip;</a></p>\n",
				"content_text": "Had to scratch that itch: I've got a super basic Firefox browser extension going now that adds those  hide mentions/hide short posts micro.blog bookmarklets directly into the browser.\n\n[youtu.be/j_OxIKMYw...](https://youtu.be/j_OxIKMYw7w)\n",
				"date_published": "2022-10-21T11:16:03-05:00",
				"url": "https://darby3.micro.blog/2022/10/21/had-to-scratch.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/21/happy-new-brutusthe.html",
				
				"content_html": "<p>Happy new Brutus/The Otolith/Taylor Swift/Carly Rae Jensen/Burial day to all\nWho celebrate. 🎶</p>\n",
				"content_text": "Happy new Brutus/The Otolith/Taylor Swift/Carly Rae Jensen/Burial day to all\nWho celebrate. 🎶\n",
				"date_published": "2022-10-21T07:32:50-05:00",
				"url": "https://darby3.micro.blog/2022/10/21/happy-new-brutusthe.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/20/in-other-news.html",
				
				"content_html": "<p>In other news, just learned that Thunderbird is still around. Giving it a shot. My other email app has been acting mildly weird lately.</p>\n",
				"content_text": "In other news, just learned that Thunderbird is still around. Giving it a shot. My other email app has been acting mildly weird lately.\n",
				"date_published": "2022-10-20T11:12:32-05:00",
				"url": "https://darby3.micro.blog/2022/10/20/in-other-news.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/19/do-i-have.html",
				
				"content_html": "<p>Do I have time to do NaNoWriMo this year? No. Do y&rsquo;all make me think about it anyway? Yes&hellip;</p>\n",
				"content_text": "Do I have time to do NaNoWriMo this year? No. Do y'all make me think about it anyway? Yes...\n",
				"date_published": "2022-10-19T14:25:46-05:00",
				"url": "https://darby3.micro.blog/2022/10/19/do-i-have.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/19/i-resisted-for.html",
				
				"content_html": "<p>I resisted for a long time, because nothing free is actually free, but I think I&rsquo;m finally switching from PHPStorm to VS Code. Feels like PHPStorm has turned into a bug-ridden nightmare pool that crashes daily. I think I&rsquo;m done with it.</p>\n",
				"content_text": "I resisted for a long time, because nothing free is actually free, but I think I'm finally switching from PHPStorm to VS Code. Feels like PHPStorm has turned into a bug-ridden nightmare pool that crashes daily. I think I'm done with it.\n",
				"date_published": "2022-10-19T09:52:04-05:00",
				"url": "https://darby3.micro.blog/2022/10/19/i-resisted-for.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/19/just-saw-a.html",
				
				"content_html": "<p>Just saw a process called &ldquo;XProtectRemediatorSheepSwap&rdquo; running on my laptop. I think I need to go back to bed.</p>\n",
				"content_text": "Just saw a process called \"XProtectRemediatorSheepSwap\" running on my laptop. I think I need to go back to bed.\n",
				"date_published": "2022-10-19T09:35:41-05:00",
				"url": "https://darby3.micro.blog/2022/10/19/just-saw-a.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/18/on-the-one.html",
				
				"content_html": "<p>On the one hand I&rsquo;d like to up my php game so I can do more stuff. On the other hand I&rsquo;d like to see daylight more often.</p>\n",
				"content_text": "On the one hand I'd like to up my php game so I can do more stuff. On the other hand I'd like to see daylight more often.\n",
				"date_published": "2022-10-18T09:25:29-05:00",
				"url": "https://darby3.micro.blog/2022/10/18/on-the-one.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/17/week-seven-running.html",
				"title": "Week seven running report 🏃",
				"content_html": "<p>I live in Lakewood, a fairly dense city directly to the west of Cleveland. I work forty minutes outside Cleveland, in Oberlin, which is surrounded by farmland. I used to run down there a lot back in 2019, when I first started running, doing my couch-to-5k program. Then, something happened, in 2020, and I didn&rsquo;t run down there much? I&rsquo;m not sure, the timeline gets a little blurry&hellip;</p>\n<p>In any case, I&rsquo;ve been craving some fresh scenery, so I finally remembered to pack my stuff and take it with me this past week, so I could do my weekday runs out of the office. It felt weird! I guess I have a lot of place-memory/sense-memory of struggle-running down there, of thinking three miles was <em>so flipping far</em>, and coming into this week, I had a weird amount of pointless nervous energy built up, like I was going to immediately fall on my face as soon as I started, or something.</p>\n<p>For Tuesday I did a specific four mile loop that I&rsquo;d eyed up as a <em>big crazy stretch goal</em> route back in 2019. It felt so ambitious, back then. Little did I imagine when I&rsquo;d finally run it it would be totally chill weekday training. Training for a run more than three times longer than that one. No big deal. (Basically. I actually went maybe one notch harder than I probably should have. I blame coming off the extra rest day as my schedule slid back to normal; I felt a little coiled up, going into it. Went okay, in any event, so it&rsquo;s cool.)</p>\n<p>With most of my running happening in urban areas, it was fun to add some corn into the mix.</p>\n<!-- raw HTML omitted -->\n<p>Thursday had me going 4.5 miles, with 2.5 at &ldquo;race&rdquo; pace. I successfully kept the race pace slower by about 30 seconds for the first two miles (before I kicked it up a bit for the last half mile, because why not) from where I&rsquo;d been the week before, when I&rsquo;d felt I&rsquo;d been going a bit too hard for something sustainable. This felt really good. This felt like the fun kind of tempo run/threshold run/&ldquo;this feels like a good workout&rdquo; run I remember from 5k training in the summer. Faster, for me, without feeling like I was punishing myself. It&rsquo;s a really fun run to include in the weekly mix. (I <em>kind of</em> miss interval running, but I <em>definitely</em> missed these tempo runs.) Still probably not a realistic pace for the whole race, but maybe something I could reach for on the back third, when the final puddle of adrenaline has nowhere else to go?</p>\n<p>And then there&rsquo;s this week&rsquo;s huge milestone: my first 10 mile run.</p>\n<!-- raw HTML omitted -->\n<p>I tried to spin this into a coherent narrative, but really I just have lots of random thoughts and observations:</p>\n<ul>\n<li>I made it! Wow!</li>\n<li>It&rsquo;s not to say that my first nine and my first eight mile runs weren’t huge milestones, but something about crossing over into double-digit territory feels significant.</li>\n<li>Wildly&hellip;ten felt easier than nine. There&rsquo;s a lot of reasons why that could be. I’ve been adding a mile to the long run each week for seven straight weeks now, and maybe finally my body was just like, “Oh, okay, yup, this is what we do, now.&quot; Maybe there was a little extra adrenaline kick from going to ten. Maybe it was the route, or the time of day, or the breeze hit just right, or something I ate. Maybe I actually stayed in bed and dreamed the whole run? I don&rsquo;t know. I am not complaining.</li>\n<li>I am decidedly <em>not</em> a morning person. I do most of my running at night or in the afternoon, partially because of life scheduling and partially because <em>I am decidedly not a morning person</em>. Because of scheduling I had to get up for this one at 5:30 AM, though, like some kind of &ldquo;real&rdquo; runner. I was nervous about that, both about actually responding to the alarm that early and then about my body actually <em>doing</em> the thing, which I&rsquo;ve historically had some issues with. But clearly everything worked out.</li>\n<li>I ran ten miles. <em>Ten miles</em>.</li>\n<li>The ascending pace graph wasn&rsquo;t as picture-perfect as the nine miler from the week before, but it was still very, very pretty, and when you average it out to 2.5 mile splits, it looked even nicer. I like this because it&rsquo;s not something I&rsquo;m explicitly trying for, and it&rsquo;s nice to feel like my body is kind of doing something &ldquo;right&rdquo; without me having to force it. It felt natural, I guess.</li>\n<li>I explored a lot of options for the route, then just wound up&hellip;going. Which was fun. My city&rsquo;s about 6-ish square miles of city blocks, and I live pretty close to smack dab in the center of it, and it turns out it&rsquo;s pretty easy to wind up and down and around to get the miles in without too much planning, so long as you&rsquo;re vaguely aware of how far from home you&rsquo;ve gotten. (I like trying to know about where I&rsquo;m going to end a run; visualizing a finish line keeps me going.)</li>\n<li>I wound up doing a lot of north-south back-and-forth, which is fun, because when you go south, away from the lake, you can get <em>a bit</em> of an upward climb, and then when you head back north, you can get <em>a bit</em> of a descent. Not much! Not even close to much! Ohio&rsquo;s pretty flat around where I&rsquo;m at. But literally any climbing is more climbing than no climbing. Just having that little bit of variance in the route helps keep things interesting. All told I think it added up to about three times more &ldquo;climbing&rdquo; than the half-marathon route will entail. I probably actually need to consciously make sure my long runs are more flat just to make sure that&rsquo;s not a big factor come race day.</li>\n<li>Did I mention the part where I ran for <em>ten miles</em>?</li>\n<li>Up to this run I&rsquo;ve generally felt okay about this project—like the half-marathon goal is possible, but still kind of a huge abstraction, something I&rsquo;m working toward, but who knows if I&rsquo;ll actually make it. With this run I finally felt like, yeah, okay: I&rsquo;ve got this. Not that I&rsquo;m going to get cocky or anything, there&rsquo;s still a lot miles between me and the finish line, but I actually definitely mostly sort of kind of feel like I&rsquo;m probably certainly maybe going to make it. Potentially! Which is a cool feeling.</li>\n</ul>\n<p>This coming week brings a relative breather—my two weekday runs both go up by half a mile but my weekend run drops back to eight, the first time my weekend run goes shorter since I began the training plan. (&ldquo;Shorter&rdquo; in this case meaning &ldquo;will qualify as one of my four longest runs ever to date.&quot;) So I lose a mile this week but then the following two weeks pack on multiple extra miles ahead of the taper week. Those two weeks will probably put my whole good-vibes feeling to the test, I suspect.</p>\n",
				"content_text": "I live in Lakewood, a fairly dense city directly to the west of Cleveland. I work forty minutes outside Cleveland, in Oberlin, which is surrounded by farmland. I used to run down there a lot back in 2019, when I first started running, doing my couch-to-5k program. Then, something happened, in 2020, and I didn't run down there much? I'm not sure, the timeline gets a little blurry...\n\nIn any case, I've been craving some fresh scenery, so I finally remembered to pack my stuff and take it with me this past week, so I could do my weekday runs out of the office. It felt weird! I guess I have a lot of place-memory/sense-memory of struggle-running down there, of thinking three miles was *so flipping far*, and coming into this week, I had a weird amount of pointless nervous energy built up, like I was going to immediately fall on my face as soon as I started, or something.\n\nFor Tuesday I did a specific four mile loop that I'd eyed up as a *big crazy stretch goal* route back in 2019. It felt so ambitious, back then. Little did I imagine when I'd finally run it it would be totally chill weekday training. Training for a run more than three times longer than that one. No big deal. (Basically. I actually went maybe one notch harder than I probably should have. I blame coming off the extra rest day as my schedule slid back to normal; I felt a little coiled up, going into it. Went okay, in any event, so it's cool.)\n\nWith most of my running happening in urban areas, it was fun to add some corn into the mix.\n\n <img src=\"uploads/2022/fdd69ce579.jpg\" width=\"600\" height=\"450\" alt=\"Corn field under sunny blue sky.\" />\n\nThursday had me going 4.5 miles, with 2.5 at \"race\" pace. I successfully kept the race pace slower by about 30 seconds for the first two miles (before I kicked it up a bit for the last half mile, because why not) from where I'd been the week before, when I'd felt I'd been going a bit too hard for something sustainable. This felt really good. This felt like the fun kind of tempo run/threshold run/\"this feels like a good workout\" run I remember from 5k training in the summer. Faster, for me, without feeling like I was punishing myself. It's a really fun run to include in the weekly mix. (I *kind of* miss interval running, but I *definitely* missed these tempo runs.) Still probably not a realistic pace for the whole race, but maybe something I could reach for on the back third, when the final puddle of adrenaline has nowhere else to go?\n\nAnd then there's this week's huge milestone: my first 10 mile run. \n\n<img src=\"uploads/2022/ec42cc7510.jpg\" width=\"600\" height=\"600\" alt=\"A map showing the route of a ten mile run.\" />\n\nI tried to spin this into a coherent narrative, but really I just have lots of random thoughts and observations:\n\n- I made it! Wow!\n- It's not to say that my first nine and my first eight mile runs weren’t huge milestones, but something about crossing over into double-digit territory feels significant. \n- Wildly...ten felt easier than nine. There's a lot of reasons why that could be. I’ve been adding a mile to the long run each week for seven straight weeks now, and maybe finally my body was just like, “Oh, okay, yup, this is what we do, now.\" Maybe there was a little extra adrenaline kick from going to ten. Maybe it was the route, or the time of day, or the breeze hit just right, or something I ate. Maybe I actually stayed in bed and dreamed the whole run? I don't know. I am not complaining.\n- I am decidedly *not* a morning person. I do most of my running at night or in the afternoon, partially because of life scheduling and partially because *I am decidedly not a morning person*. Because of scheduling I had to get up for this one at 5:30 AM, though, like some kind of \"real\" runner. I was nervous about that, both about actually responding to the alarm that early and then about my body actually *doing* the thing, which I've historically had some issues with. But clearly everything worked out.\n- I ran ten miles. *Ten miles*.\n- The ascending pace graph wasn't as picture-perfect as the nine miler from the week before, but it was still very, very pretty, and when you average it out to 2.5 mile splits, it looked even nicer. I like this because it's not something I'm explicitly trying for, and it's nice to feel like my body is kind of doing something \"right\" without me having to force it. It felt natural, I guess.\n- I explored a lot of options for the route, then just wound up...going. Which was fun. My city's about 6-ish square miles of city blocks, and I live pretty close to smack dab in the center of it, and it turns out it's pretty easy to wind up and down and around to get the miles in without too much planning, so long as you're vaguely aware of how far from home you've gotten. (I like trying to know about where I'm going to end a run; visualizing a finish line keeps me going.)\n- I wound up doing a lot of north-south back-and-forth, which is fun, because when you go south, away from the lake, you can get *a bit* of an upward climb, and then when you head back north, you can get *a bit* of a descent. Not much! Not even close to much! Ohio's pretty flat around where I'm at. But literally any climbing is more climbing than no climbing. Just having that little bit of variance in the route helps keep things interesting. All told I think it added up to about three times more \"climbing\" than the half-marathon route will entail. I probably actually need to consciously make sure my long runs are more flat just to make sure that's not a big factor come race day.\n- Did I mention the part where I ran for *ten miles*?\n- Up to this run I've generally felt okay about this project—like the half-marathon goal is possible, but still kind of a huge abstraction, something I'm working toward, but who knows if I'll actually make it. With this run I finally felt like, yeah, okay: I've got this. Not that I'm going to get cocky or anything, there's still a lot miles between me and the finish line, but I actually definitely mostly sort of kind of feel like I'm probably certainly maybe going to make it. Potentially! Which is a cool feeling.\n\nThis coming week brings a relative breather—my two weekday runs both go up by half a mile but my weekend run drops back to eight, the first time my weekend run goes shorter since I began the training plan. (\"Shorter\" in this case meaning \"will qualify as one of my four longest runs ever to date.\") So I lose a mile this week but then the following two weeks pack on multiple extra miles ahead of the taper week. Those two weeks will probably put my whole good-vibes feeling to the test, I suspect.\n",
				"date_published": "2022-10-17T17:00:00-05:00",
				"url": "https://darby3.micro.blog/2022/10/17/week-seven-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/17/in-other-news.html",
				
				"content_html": "<p>In other news, also just realized I could probably turn my silly little microblog bookmarklets into a silly little microblog Firefox extension. Uh oh.</p>\n",
				"content_text": "In other news, also just realized I could probably turn my silly little microblog bookmarklets into a silly little microblog Firefox extension. Uh oh.\n",
				"date_published": "2022-10-17T14:15:51-05:00",
				"url": "https://darby3.micro.blog/2022/10/17/in-other-news.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/17/just-realized-porting.html",
				
				"content_html": "<p>Just realized porting this Drupal site to Backdrop is like playing an open-world videogame. Getting through the initial migration was the part <em>before</em> the &ldquo;Oh, hey, where do I even go next&rdquo; bit.</p>\n",
				"content_text": "Just realized porting this Drupal site to Backdrop is like playing an open-world videogame. Getting through the initial migration was the part *before* the \"Oh, hey, where do I even go next\" bit.\n",
				"date_published": "2022-10-17T14:14:52-05:00",
				"url": "https://darby3.micro.blog/2022/10/17/just-realized-porting.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/17/currently-reading-mordew.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781250817235\">Mordew</a> by Alex Pheby 📚</p>\n",
				"content_text": "Currently reading: [Mordew](https://micro.blog/books/9781250817235) by Alex Pheby 📚\n",
				"date_published": "2022-10-17T10:13:04-05:00",
				"url": "https://darby3.micro.blog/2022/10/17/currently-reading-mordew.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/14/a-day-in.html",
				
				"content_html": "<p>A Day in the Life - a little splash of autumnal color from Oberlin, OH.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "A Day in the Life - a little splash of autumnal color from Oberlin, OH. \n\n\n\n<img src=\"uploads/2022/6aabf99392.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2022-10-14T09:20:16-05:00",
				"url": "https://darby3.micro.blog/2022/10/14/a-day-in.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/13/saw-lots-of.html",
				
				"content_html": "<p>Saw lots of nice things on my run that would have been nice for the photo challenge. Ran right past ‘em, though. 🏃</p>\n",
				"content_text": "Saw lots of nice things on my run that would have been nice for the photo challenge. Ran right past ‘em, though. 🏃\n",
				"date_published": "2022-10-13T18:22:46-05:00",
				"url": "https://darby3.micro.blog/2022/10/13/saw-lots-of.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/12/currently-reading-my.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780525522133\">My Year of Rest and Relaxation</a> by Ottessa Moshfegh 📚</p>\n",
				"content_text": "Currently reading: [My Year of Rest and Relaxation](https://micro.blog/books/9780525522133) by Ottessa Moshfegh 📚\n",
				"date_published": "2022-10-12T15:24:05-05:00",
				"url": "https://darby3.micro.blog/2022/10/12/currently-reading-my.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/12/had-an-old.html",
				
				"content_html": "<p>Had an old friend ask me for running advice today. I offered what I could but also I&rsquo;m inwardly cringing, like&hellip;No! Don&rsquo;t listen to me! I can&rsquo;t possibly know what I&rsquo;m talking about! I&rsquo;ve only been flailing at it for three years!&hellip; 🏃</p>\n",
				"content_text": "Had an old friend ask me for running advice today. I offered what I could but also I'm inwardly cringing, like...No! Don't listen to me! I can't possibly know what I'm talking about! I've only been flailing at it for three years!... 🏃\n",
				"date_published": "2022-10-12T13:18:09-05:00",
				"url": "https://darby3.micro.blog/2022/10/12/had-an-old.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/12/excuse-me-what.html",
				
				"content_html": "<p>Excuse me what now: 📚</p>\n<p><a href=\"https://lithub.com/cate-blanchett-is-working-on-a-stage-production-of-ducks-newburyport/\">Cate Blanchett is working on a stage production of Ducks, Newburyport</a></p>\n",
				"content_text": "Excuse me what now: 📚\r\n\r\n[Cate Blanchett is working on a stage production of Ducks, Newburyport](https://lithub.com/cate-blanchett-is-working-on-a-stage-production-of-ducks-newburyport/)\n",
				"date_published": "2022-10-12T11:45:06-05:00",
				"url": "https://darby3.micro.blog/2022/10/12/excuse-me-what.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/12/realizing-the-mastodon.html",
				
				"content_html": "<p>Realizing the mastodon instance I (barely) use is shutting down at the same time micro.blog has basically <em>become</em> a mastodon instance? Priceless.</p>\n",
				"content_text": "Realizing the mastodon instance I (barely) use is shutting down at the same time micro.blog has basically *become* a mastodon instance? Priceless.\n",
				"date_published": "2022-10-12T08:35:47-05:00",
				"url": "https://darby3.micro.blog/2022/10/12/realizing-the-mastodon.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/11/oh-the-mastodon.html",
				
				"content_html": "<p>Oh, the mastodon instance I use (barely) is shutting down. Not sure whether I should actually bother finding a new one to use.</p>\n",
				"content_text": "Oh, the mastodon instance I use (barely) is shutting down. Not sure whether I should actually bother finding a new one to use.\n",
				"date_published": "2022-10-11T14:11:26-05:00",
				"url": "https://darby3.micro.blog/2022/10/11/oh-the-mastodon.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/11/probably-foolish-to.html",
				
				"content_html": "<p>Probably foolish to hope for a late-career highlight from The Cure, whenever these new albums finally come out&hellip;but these new songs they&rsquo;re playing live aren&rsquo;t horrible, at least!..</p>\n",
				"content_text": "Probably foolish to hope for a late-career highlight from The Cure, whenever these new albums finally come out...but these new songs they're playing live aren't horrible, at least!..\n",
				"date_published": "2022-10-11T10:16:32-05:00",
				"url": "https://darby3.micro.blog/2022/10/11/probably-foolish-to.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/07/currently-reading-the.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781476716787\">The Candy House</a> by Jennifer Egan 📚</p>\n",
				"content_text": "Currently reading: [The Candy House](https://micro.blog/books/9781476716787) by Jennifer Egan 📚\n",
				"date_published": "2022-10-07T19:14:27-05:00",
				"url": "https://darby3.micro.blog/2022/10/07/currently-reading-the.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/07/week-six-running.html",
				"title": "Week six running report 🏃",
				"content_html": "<p>Okay! Week six! The build continues, with a nine mile run following last week’s eight miler. And it went swimmingly: without really trying, I managed to create the most beautiful pace graph ever, with every mile either at or a bit above the pace of the previous mile, right on through to the end. Even past the point around the start of mile seven when I started having mild doubts about whether or not I was even going to make it to the end. Cardiovascularly I was feeling pretty good, and my energy level was okay, though I was definitely <em>feeling</em> it—the basic endurance required to just keep going for that long is truly something else…but oh gosh did my legs feel like I was trying to run nine miles for the first time a week after running eight miles for the first time. Not horrible, but not exactly strain-free, either! It’s possible there was some internal motivational screaming happening during mile eight. It’s possible there was some <em>audible</em> motivational screaming happening in mile nine. Possibly! Maybe! It’s fine. I’m fine and definitely not crazy or weird.</p>\n<p>We’re at the point here near Cleveland where the temperature is starting to drop, which makes me start thinking really hard about <em>hey wait how the heck do I dress for these conditions again</em>? I’ve been through enough of these cycles now that I’m going into this fall season knowing well that I just run hot, in general, doubly so when I’m actually running, and that whatever other people might be wearing, I’m going to be better off wearing <em>less</em> than what my rational mind tells me to wear. For today’s low-fifties-and-overcast run, that meant skipping the extra layers I was starting to think I should start thinking about piling on. Though I did upgrade from a thin running shirt to a merino running shirt! Short sleeves, though! Felt good, and once I warmed up a bit, it took stronger gusts to remind me that, hey, it was actually kind of chilly out there. But yeah, it’s probably time to think about pulling out the extra stuff.</p>\n<p>The easy four miler on Monday was…an easy four miles. I ran a weird route because I’ve got this side thing going where I’m trying to run so that my heat map on Strava eventually indicates that I’ve run every single street in Lakewood. Picked up a couple streets that I’d somehow skipped over to date. It’s a silly project but a fun way to force me to mix up my routes a bit, now and then. (There’s going to be some really weird runs in my future dedicated to logging time on weird little tiny side streets.)</p>\n<p>My pace race run on Wednesday, I was up to two miles of race pace running, for which I’d slid my target pace another thirty seconds faster from the week previous, and I landed both miles pretty close to the fastest end of that minute. And…yeah, I think it’s time to try to figure out how to consciously slide my pace back into the slower half of that minute. I think what I’m looking for is a pace where it feels like I’m running fast but not hard; the race pace portion of Wednesday’s run was fast, for me, but probably a bit too hard, for a sustainable long-distance effort. Or at least, I don’t feel compelled to try to maintain that pace for that long, not yet, not at this stage. I’m just not quite sure that I know how to fine-tune my pace to such a degree, yet, though I guess actually consciously trying to will be a good start!</p>\n<p>Which all brings me to the exact halfway point of this half-marathon training plan. At least in terms of weeks—there’s a <em>lot</em> of miles to cover yet! Right now, today, eight hours after I finished my long run, I’m feeling pretty good about all this. I feel like, so long as I can keep my motivation up, I’m still on track to make it to that half-marathon finish line in something resembling one piece. Knock on wood, fingers crossed, all that good stuff….</p>\n",
				"content_text": "Okay! Week six! The build continues, with a nine mile run following last week’s eight miler. And it went swimmingly: without really trying, I managed to create the most beautiful pace graph ever, with every mile either at or a bit above the pace of the previous mile, right on through to the end. Even past the point around the start of mile seven when I started having mild doubts about whether or not I was even going to make it to the end. Cardiovascularly I was feeling pretty good, and my energy level was okay, though I was definitely *feeling* it—the basic endurance required to just keep going for that long is truly something else…but oh gosh did my legs feel like I was trying to run nine miles for the first time a week after running eight miles for the first time. Not horrible, but not exactly strain-free, either! It’s possible there was some internal motivational screaming happening during mile eight. It’s possible there was some *audible* motivational screaming happening in mile nine. Possibly! Maybe! It’s fine. I’m fine and definitely not crazy or weird.\n\nWe’re at the point here near Cleveland where the temperature is starting to drop, which makes me start thinking really hard about *hey wait how the heck do I dress for these conditions again*? I’ve been through enough of these cycles now that I’m going into this fall season knowing well that I just run hot, in general, doubly so when I’m actually running, and that whatever other people might be wearing, I’m going to be better off wearing *less* than what my rational mind tells me to wear. For today’s low-fifties-and-overcast run, that meant skipping the extra layers I was starting to think I should start thinking about piling on. Though I did upgrade from a thin running shirt to a merino running shirt! Short sleeves, though! Felt good, and once I warmed up a bit, it took stronger gusts to remind me that, hey, it was actually kind of chilly out there. But yeah, it’s probably time to think about pulling out the extra stuff. \n\nThe easy four miler on Monday was…an easy four miles. I ran a weird route because I’ve got this side thing going where I’m trying to run so that my heat map on Strava eventually indicates that I’ve run every single street in Lakewood. Picked up a couple streets that I’d somehow skipped over to date. It’s a silly project but a fun way to force me to mix up my routes a bit, now and then. (There’s going to be some really weird runs in my future dedicated to logging time on weird little tiny side streets.)\n\nMy pace race run on Wednesday, I was up to two miles of race pace running, for which I’d slid my target pace another thirty seconds faster from the week previous, and I landed both miles pretty close to the fastest end of that minute. And…yeah, I think it’s time to try to figure out how to consciously slide my pace back into the slower half of that minute. I think what I’m looking for is a pace where it feels like I’m running fast but not hard; the race pace portion of Wednesday’s run was fast, for me, but probably a bit too hard, for a sustainable long-distance effort. Or at least, I don’t feel compelled to try to maintain that pace for that long, not yet, not at this stage. I’m just not quite sure that I know how to fine-tune my pace to such a degree, yet, though I guess actually consciously trying to will be a good start!\n\nWhich all brings me to the exact halfway point of this half-marathon training plan. At least in terms of weeks—there’s a *lot* of miles to cover yet! Right now, today, eight hours after I finished my long run, I’m feeling pretty good about all this. I feel like, so long as I can keep my motivation up, I’m still on track to make it to that half-marathon finish line in something resembling one piece. Knock on wood, fingers crossed, all that good stuff….\n",
				"date_published": "2022-10-07T18:39:35-05:00",
				"url": "https://darby3.micro.blog/2022/10/07/week-six-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/07/made-it-to.html",
				
				"content_html": "<p>Made it to 9 miles today. Felt wild, gluing one of my favorite five mile runs to the start of one of my favorite four mile runs. 🏃</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Made it to 9 miles today. Felt wild, gluing one of my favorite five mile runs to the start of one of my favorite four mile runs. 🏃\n\n<img src=\"uploads/2022/a40053091e.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-10-07T12:58:57-05:00",
				"url": "https://darby3.micro.blog/2022/10/07/made-it-to.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/06/i-upgraded-to.html",
				
				"content_html": "<p>I upgraded to ios 16 and I think it breaks what I now realize was my favorite feature of the device: long-pressing my lock screen to see the wallpaper&rsquo;s live photo action, an absurdly cute clip of my kids. BRB, throwing my phone into the lake.</p>\n",
				"content_text": "I upgraded to ios 16 and I think it breaks what I now realize was my favorite feature of the device: long-pressing my lock screen to see the wallpaper's live photo action, an absurdly cute clip of my kids. BRB, throwing my phone into the lake.\n",
				"date_published": "2022-10-06T14:17:07-05:00",
				"url": "https://darby3.micro.blog/2022/10/06/i-upgraded-to.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/06/for-my-next.html",
				
				"content_html": "<p>For my next trick, I&rsquo;d love to get back that $10/month I&rsquo;m giving Adobe for the photography plan, if I could find a good Lightroom Classic alternative. Problem being, Lightroom Classic is&hellip;pretty darn good.</p>\n",
				"content_text": "For my next trick, I'd love to get back that $10/month I'm giving Adobe for the photography plan, if I could find a good Lightroom Classic alternative. Problem being, Lightroom Classic is...pretty darn good.\n",
				"date_published": "2022-10-06T10:03:58-05:00",
				"url": "https://darby3.micro.blog/2022/10/06/for-my-next.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/06/cancelled-a-bunch.html",
				
				"content_html": "<p>Cancelled a bunch of random subscriptions yesterday. Knew going in there were one or two I wanted to axe, didn&rsquo;t realize they&rsquo;d add up to me getting back ~$50/month.</p>\n",
				"content_text": "Cancelled a bunch of random subscriptions yesterday. Knew going in there were one or two I wanted to axe, didn't realize they'd add up to me getting back ~$50/month.\n",
				"date_published": "2022-10-06T09:57:00-05:00",
				"url": "https://darby3.micro.blog/2022/10/06/cancelled-a-bunch.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/04/i-could-crunch.html",
				
				"content_html": "<p>I could crunch the data better, but, a rough survey of my most recent long runs versus those from training for the 5k in July suggests my long run pace is trending faster. Many factors at play, of course, but it&rsquo;s an interesting development, at a glance. 🏃</p>\n",
				"content_text": "I could crunch the data better, but, a rough survey of my most recent long runs versus those from training for the 5k in July suggests my long run pace is trending faster. Many factors at play, of course, but it's an interesting development, at a glance. 🏃\n",
				"date_published": "2022-10-04T11:25:28-05:00",
				"url": "https://darby3.micro.blog/2022/10/04/i-could-crunch.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/04/throwing-a-code.html",
				
				"content_html": "<p>Throwing a couple bookmarklet code samples up here for reference.</p>\n<p>These stemmed from <a href=\"https://micro.blog/amit/13460628\">this conversation thread</a> which finally got me thinking about a couple super simple bookmarklets I could add for my own convenience. Add these as bookmarks to the browser toolbar, and click them as needed to filter out posts. They&rsquo;re not feature-rich, they&rsquo;re one-way only (i.e., to un-hide posts, you need to refresh the page!), and they&rsquo;re only tested (barely) in Firefox, so anyone else&rsquo;s mileage may vary.</p>\n<p>Here&rsquo;s a JS bookmarklet for hiding MB posts from the <a href=\"https://micro.blog\">https://micro.blog</a> timeline based on length. The &ldquo;25&rdquo; in the middle is a character count—that can be manually fine-tuned by changing the number, to hide various lengths of posts. Because sometimes there&rsquo;s lots of tiny short posts that fill up the timeline, and this is a way to quickly hide them, for convenience.</p>\n<pre tabindex=\"0\"><code>javascript: (() =&gt; { document.querySelectorAll('.post').forEach(post =&gt; {   const text = post.querySelector('.post_text');   if (text.innerText.length &lt; 25 ) {     post.style.display = &quot;none&quot;;   } })})()\n</code></pre><p>Here&rsquo;s a JS bookmarklet for hiding MB @ mention posts from the the <a href=\"https://micro.blog\">https://micro.blog</a> timeline. It&rsquo;s just looking for an &lsquo;@&rsquo; at the start of the post, and if it finds it, it hides the post. Because sometimes you want to see mentions because they lead to interesting conversations you wouldn&rsquo;t have otherwise discovered, and other times you just want to filter them out so you can see top-level posts by themselves.</p>\n<pre tabindex=\"0\"><code>javascript: (() =&gt; { document.querySelectorAll('.post').forEach(post =&gt; {      const text = post.querySelector('.post_text');   if (text.innerText[0] === '@' ) {     post.style.display = &quot;none&quot;;   } })})()\n</code></pre>",
				"content_text": "Throwing a couple bookmarklet code samples up here for reference.\n\nThese stemmed from [this conversation thread](https://micro.blog/amit/13460628) which finally got me thinking about a couple super simple bookmarklets I could add for my own convenience. Add these as bookmarks to the browser toolbar, and click them as needed to filter out posts. They're not feature-rich, they're one-way only (i.e., to un-hide posts, you need to refresh the page!), and they're only tested (barely) in Firefox, so anyone else's mileage may vary.\n\nHere's a JS bookmarklet for hiding MB posts from the https://micro.blog timeline based on length. The \"25\" in the middle is a character count—that can be manually fine-tuned by changing the number, to hide various lengths of posts. Because sometimes there's lots of tiny short posts that fill up the timeline, and this is a way to quickly hide them, for convenience.\n\n```\njavascript: (() => { document.querySelectorAll('.post').forEach(post => {   const text = post.querySelector('.post_text');   if (text.innerText.length < 25 ) {     post.style.display = \"none\";   } })})()\n```\n\nHere's a JS bookmarklet for hiding MB @ mention posts from the the https://micro.blog timeline. It's just looking for an '@' at the start of the post, and if it finds it, it hides the post. Because sometimes you want to see mentions because they lead to interesting conversations you wouldn't have otherwise discovered, and other times you just want to filter them out so you can see top-level posts by themselves.\n\n```\njavascript: (() => { document.querySelectorAll('.post').forEach(post => {      const text = post.querySelector('.post_text');   if (text.innerText[0] === '@' ) {     post.style.display = \"none\";   } })})()\n```\n",
				"date_published": "2022-10-04T09:07:47-05:00",
				"url": "https://darby3.micro.blog/2022/10/04/throwing-a-code.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/03/week-five-running.html",
				"title": "Week five running report 🏃",
				"content_html": "<p>For my second race pace run, this Wednesday, I’d set my target pace range minute 30 seconds faster than the prior week’s target, based on the earlier week&rsquo;s pace. Then I did the first mile 15 seconds faster than that. And the following half mile at a 45 seconds faster pace. Which felt amazing but also <em>whaaaaat</em>? I don&rsquo;t know. Either my body is telling me something my mind doesn&rsquo;t know what to do with, or my mind hasn&rsquo;t clearly communicated the <em>real</em> plan to my body yet. So I&rsquo;m kind of torn. I could try to let it rip like this for as long as I can, because after all, I clearly have no idea what my pace ranges actually are or should be, and seeing how far I can push these paces is definitely educational. On the flip side I could try to reign it back in, and try harder to target something closer to my easy run paces—faster, still, but not <em>that</em> much faster, so I gain a better sense of what an ambitious, but also realistic, pace feels like. I think I&rsquo;m going to just roll with it for another week before trying to course-correct just yet. If nothing else, it does feel really good to have this kind of fast-for-me run in the mix.</p>\n<p>Did my long run on Friday. 8 miles. My new longest run ever! Felt good! Felt long! Can&rsquo;t believe I&rsquo;m going to turn back around and go 9 miles this coming week! For as weirdly anxious as I was going into the run, my pace felt good, generally in the lower half of my original minute target range; I slowed down a bit around mile six, which, coincidentally, I&rsquo;m sure, was the one part of the run with something resembling actual climb. Then I finished strong. My last mile was my fastest. Whatever is happening on race pace days, I&rsquo;d be one hundred percent happy with running the half marathon the way I&rsquo;m running these weekend long runs, if it means successfully running the whole way without bonking out or redlining mid-race.</p>\n<p>Worth noting, I&rsquo;m generally trying to be conscious of how I feel <em>between</em> the runs, as one way of gauging how I&rsquo;m doing, and so far everything has felt, as best as I can tell, within reasonable bounds of expectation. I only felt a little rickety, this Saturday, is what I&rsquo;m saying. As a relatively old man doing his first half-marathon training I&rsquo;ll take &ldquo;a little rickety&rdquo; any day!</p>\n<p>Monday&rsquo;s easy four miler? It rained. Hard. I was drenched within a minute of walking out the door. It was fine enough once I got going, and then it actually mostly stopped raining for the middle portion of the run. Then the rain returned with a vengeance for the final mile. it&rsquo;s been a week and I may actually still be soaked through from that run. I may never be dry again. Honestly the novelty of running in weather that probably made me look like an absolute crazy person was kind of worth it, it was certainly an interesting thing to do, but here&rsquo;s to hoping I don&rsquo;t have to make a habit out of it.</p>\n<p>The other interesting thing about this week was that I&rsquo;d had to pull all these runs forward a day due to weekend scheduling conflicts. I can clearly say I did fine—I did it!—but also I felt sort of like could feel that missing extra full rest day, a bit. Not by much, and it felt good to know I could push through that, but there was maybe an extra notch of <em>ugh</em> on the old fatigue meter this week. I wasn&rsquo;t upset when I hit the weekend and had something resembling a full downtime day on Sunday.</p>\n<p>I also haven&rsquo;t mentioned cross-training efforts here yet, I think, mostly because they&rsquo;re not interesting, but I&rsquo;m generally keeping up with them, which is nice; if nothing else, increasing my activity level across the week is a plus. It&rsquo;s typically been either an elliptical session or a bike ride, neither too strenous, just enough to loosen up. Mostly it&rsquo;s been the elliptical, as the weather has started turning. (As much as biking is my first love, it sure is easier to run in the cold than to bike.) I&rsquo;ve hit every middle-of-the-week session so far, with weekends being a bit spottier, based on general life happenings. So, like, this past Saturday I couldn&rsquo;t do anything formal, but after walking around Michigan parks for over 11,000 steps with my family, I think I can say: I&rsquo;m good!</p>\n<p>Final bonus fun fact: I listened to the <a href=\"https://fujiyamiyagi.bandcamp.com/album/slight-variations\">new Fujiya &amp; Miyagi album</a> for the first time during my long run. They&rsquo;re great. The album is great. Hearing David Best sing the line &ldquo;We&rsquo;re closer to the end than we are the beginning&rdquo; as I was literally crossing the four-mile midpoint of the run? Truly cosmic.</p>\n",
				"content_text": "For my second race pace run, this Wednesday, I’d set my target pace range minute 30 seconds faster than the prior week’s target, based on the earlier week's pace. Then I did the first mile 15 seconds faster than that. And the following half mile at a 45 seconds faster pace. Which felt amazing but also *whaaaaat*? I don't know. Either my body is telling me something my mind doesn't know what to do with, or my mind hasn't clearly communicated the *real* plan to my body yet. So I'm kind of torn. I could try to let it rip like this for as long as I can, because after all, I clearly have no idea what my pace ranges actually are or should be, and seeing how far I can push these paces is definitely educational. On the flip side I could try to reign it back in, and try harder to target something closer to my easy run paces—faster, still, but not *that* much faster, so I gain a better sense of what an ambitious, but also realistic, pace feels like. I think I'm going to just roll with it for another week before trying to course-correct just yet. If nothing else, it does feel really good to have this kind of fast-for-me run in the mix. \n\nDid my long run on Friday. 8 miles. My new longest run ever! Felt good! Felt long! Can't believe I'm going to turn back around and go 9 miles this coming week! For as weirdly anxious as I was going into the run, my pace felt good, generally in the lower half of my original minute target range; I slowed down a bit around mile six, which, coincidentally, I'm sure, was the one part of the run with something resembling actual climb. Then I finished strong. My last mile was my fastest. Whatever is happening on race pace days, I'd be one hundred percent happy with running the half marathon the way I'm running these weekend long runs, if it means successfully running the whole way without bonking out or redlining mid-race.\n\nWorth noting, I'm generally trying to be conscious of how I feel *between* the runs, as one way of gauging how I'm doing, and so far everything has felt, as best as I can tell, within reasonable bounds of expectation. I only felt a little rickety, this Saturday, is what I'm saying. As a relatively old man doing his first half-marathon training I'll take \"a little rickety\" any day!\n\nMonday's easy four miler? It rained. Hard. I was drenched within a minute of walking out the door. It was fine enough once I got going, and then it actually mostly stopped raining for the middle portion of the run. Then the rain returned with a vengeance for the final mile. it's been a week and I may actually still be soaked through from that run. I may never be dry again. Honestly the novelty of running in weather that probably made me look like an absolute crazy person was kind of worth it, it was certainly an interesting thing to do, but here's to hoping I don't have to make a habit out of it. \n\nThe other interesting thing about this week was that I'd had to pull all these runs forward a day due to weekend scheduling conflicts. I can clearly say I did fine—I did it!—but also I felt sort of like could feel that missing extra full rest day, a bit. Not by much, and it felt good to know I could push through that, but there was maybe an extra notch of *ugh* on the old fatigue meter this week. I wasn't upset when I hit the weekend and had something resembling a full downtime day on Sunday.\n\nI also haven't mentioned cross-training efforts here yet, I think, mostly because they're not interesting, but I'm generally keeping up with them, which is nice; if nothing else, increasing my activity level across the week is a plus. It's typically been either an elliptical session or a bike ride, neither too strenous, just enough to loosen up. Mostly it's been the elliptical, as the weather has started turning. (As much as biking is my first love, it sure is easier to run in the cold than to bike.) I've hit every middle-of-the-week session so far, with weekends being a bit spottier, based on general life happenings. So, like, this past Saturday I couldn't do anything formal, but after walking around Michigan parks for over 11,000 steps with my family, I think I can say: I'm good!\n\nFinal bonus fun fact: I listened to the [new Fujiya & Miyagi album](https://fujiyamiyagi.bandcamp.com/album/slight-variations) for the first time during my long run. They're great. The album is great. Hearing David Best sing the line \"We're closer to the end than we are the beginning\" as I was literally crossing the four-mile midpoint of the run? Truly cosmic.\n",
				"date_published": "2022-10-03T18:00:00-05:00",
				"url": "https://darby3.micro.blog/2022/10/03/week-five-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/10/03/digging-back-into.html",
				
				"content_html": "<p>Digging back into converting a Drupal 7 site to Backdrop. In other news, side-eyeing a lot of my life choices.</p>\n",
				"content_text": "Digging back into converting a Drupal 7 site to Backdrop. In other news, side-eyeing a lot of my life choices.\n",
				"date_published": "2022-10-03T16:04:47-05:00",
				"url": "https://darby3.micro.blog/2022/10/03/digging-back-into.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/10/03/currently-reading-age.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780356515397\">Age of Ash</a> by Daniel Abraham 📚</p>\n",
				"content_text": "Currently reading: [Age of Ash](https://micro.blog/books/9780356515397) by Daniel Abraham 📚\n",
				"date_published": "2022-10-03T10:04:50-05:00",
				"url": "https://darby3.micro.blog/2022/10/03/currently-reading-age.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/29/currently-reading-trilogy.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781628973907\">Trilogy</a> by Jon Fosse 📚</p>\n",
				"content_text": "Currently reading: [Trilogy](https://micro.blog/books/9781628973907) by Jon Fosse 📚\n",
				"date_published": "2022-09-29T15:30:19-05:00",
				"url": "https://darby3.micro.blog/2022/09/29/currently-reading-trilogy.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/27/had-my-first.html",
				
				"content_html": "<p>Had my first book review in about a decade published today, for <a href=\"https://www.identitytheory.com/complicities-stacey-derasmo-book-review/\"><em>The Complicities</em> by Stacey D’Erasmo, at Identity Theory</a>. 📚</p>\n",
				"content_text": "Had my first book review in about a decade published today, for [*The Complicities* by Stacey D’Erasmo, at Identity Theory](https://www.identitytheory.com/complicities-stacey-derasmo-book-review/). 📚\n",
				"date_published": "2022-09-27T14:07:33-05:00",
				"url": "https://darby3.micro.blog/2022/09/27/had-my-first.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/27/tfw-you-open.html",
				
				"content_html": "<p>TFW you open up a folder of writings from 10–20 years ago.</p>\n",
				"content_text": "TFW you open up a folder of writings from 10–20 years ago.\n",
				"date_published": "2022-09-27T11:35:55-05:00",
				"url": "https://darby3.micro.blog/2022/09/27/tfw-you-open.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/26/just-sent-a.html",
				
				"content_html": "<p>Just sent a new issue of <a href=\"https://tinyletter.com/darby3\">my books newsletter</a>. I’m into John Gwynne’s ultraviolent fantasy! I’m feeling weird about Tamsyn Muir’s Locked Tomb series! I remain forever in love with <em>Shadow in the Cloud</em>! 📚</p>\n",
				"content_text": "Just sent a new issue of [my books newsletter](https://tinyletter.com/darby3). I’m into John Gwynne’s ultraviolent fantasy! I’m feeling weird about Tamsyn Muir’s Locked Tomb series! I remain forever in love with *Shadow in the Cloud*! 📚\n",
				"date_published": "2022-09-26T17:56:56-05:00",
				"url": "https://darby3.micro.blog/2022/09/26/just-sent-a.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/25/id-flashed-this.html",
				"title": "Week four running report 🏃",
				"content_html": "<p>I’d flagged this week as the start of my build phase, but now I think it was maybe my last “gimme” week—there wasn&rsquo;t anything in the plan I haven&rsquo;t done before and it was mostly a question of doing it <em>now</em> as proof that I could be ready in time for what comes next. So I guess I&rsquo;ll call it a transition week?</p>\n<p>My long run on Saturday was seven miles. I&rsquo;ve done seven before, a handful of times, and I felt comfortable taking it on this time, even keeping an average pace a notch faster than last week’s six miler. The weather didn&rsquo;t hurt—picture-perfect for running, overcast, low 60s, some breeze. In the past every time I&rsquo;ve hit this kind of distance I think I&rsquo;ve started to realize just how much the long run game is a mental one as it is a physical one. Running at a comfortable pace means feeling like I could, theoretically, physically do it forever; convincing myself, mentally, over and over again, that that is actually a good idea, a valid use of my time, <em>and</em> the actual goal is&hellip;weird. Realizing that Saturday&rsquo;s <em>last</em> mile was going to be my <em>middle</em> mile during the half marathon in eight weeks was also quite the rude perspective shift!</p>\n<p>Thursday was the first &ldquo;race pace&rdquo; run. A mile warm up, a mile cool down, a race pace mile sandwiched in the middle. (Hold the mayo.) (Yes, I&rsquo;m a dad, have I mentioned that yet?) I&rsquo;d set a minute-long pace range that I wanted to maintain for that middle mile that was meant to feel like a stretch while also giving me plenty of leeway to make it feel right. Turns out what felt right was a pace fifteen seconds <em>faster</em> than my target range. It felt good! It felt good to open back up some for the first time since the 5k; it was nice to feel like I hadn&rsquo;t completely lost all the gains I made during that training period. Now, I really don&rsquo;t believe the pace I ran Thursday was something I could actually maintain for 13 (and an oh and a point and a one-zero) miles; I mean, maybe it is, maybe I&rsquo;m holding myself back, I know I&rsquo;m perpetually concerned about over-doing it. (As my wife has put it, &ldquo;Darby is very aware of his limits.&quot;) I don&rsquo;t know. Either way, I do like those fast-but-not-absurd runs, and I&rsquo;ve missed them since finishing the 5k training. Having that variety in the week is fun, a little spicy. I think I can safely slide my original target pace range forward by about 30 seconds. We&rsquo;ll see what happens.</p>\n<p>Tuesday night&rsquo;s easy run continued the trend out of the previous week of my easy pace naturally starting to lift; it felt more like the race pace I expected to do on Thursday night (which probably translated to me pushing that mile faster on Thursday). I think I was running off some stress, too. Either way: faster than expected. Not the third-in-a-row ultra-low-heart-rate-Tuesday-run in a row I was on the lookout for, which is fine.</p>\n<p>Looking ahead, things definitely actually for-<em>real</em>-real get interesting the next three weeks. I add a mile a week to the long runs each week (three weeks of new longest runs ever!), and a half mile a week to the race pace segment on Thursdays; Tuesdays will lock in at four miles for a while. Plus I&rsquo;m pulling all my runs forward a day for the next two weeks, due to some weekend scheduling conflicts. Fingers crossed, that&rsquo;s not a recipe for disaster.</p>\n",
				"content_text": "I’d flagged this week as the start of my build phase, but now I think it was maybe my last “gimme” week—there wasn't anything in the plan I haven't done before and it was mostly a question of doing it *now* as proof that I could be ready in time for what comes next. So I guess I'll call it a transition week?\n\nMy long run on Saturday was seven miles. I've done seven before, a handful of times, and I felt comfortable taking it on this time, even keeping an average pace a notch faster than last week’s six miler. The weather didn't hurt—picture-perfect for running, overcast, low 60s, some breeze. In the past every time I've hit this kind of distance I think I've started to realize just how much the long run game is a mental one as it is a physical one. Running at a comfortable pace means feeling like I could, theoretically, physically do it forever; convincing myself, mentally, over and over again, that that is actually a good idea, a valid use of my time, *and* the actual goal is...weird. Realizing that Saturday's *last* mile was going to be my *middle* mile during the half marathon in eight weeks was also quite the rude perspective shift!\n\nThursday was the first \"race pace\" run. A mile warm up, a mile cool down, a race pace mile sandwiched in the middle. (Hold the mayo.) (Yes, I'm a dad, have I mentioned that yet?) I'd set a minute-long pace range that I wanted to maintain for that middle mile that was meant to feel like a stretch while also giving me plenty of leeway to make it feel right. Turns out what felt right was a pace fifteen seconds *faster* than my target range. It felt good! It felt good to open back up some for the first time since the 5k; it was nice to feel like I hadn't completely lost all the gains I made during that training period. Now, I really don't believe the pace I ran Thursday was something I could actually maintain for 13 (and an oh and a point and a one-zero) miles; I mean, maybe it is, maybe I'm holding myself back, I know I'm perpetually concerned about over-doing it. (As my wife has put it, \"Darby is very aware of his limits.\") I don't know. Either way, I do like those fast-but-not-absurd runs, and I've missed them since finishing the 5k training. Having that variety in the week is fun, a little spicy. I think I can safely slide my original target pace range forward by about 30 seconds. We'll see what happens.\n\nTuesday night's easy run continued the trend out of the previous week of my easy pace naturally starting to lift; it felt more like the race pace I expected to do on Thursday night (which probably translated to me pushing that mile faster on Thursday). I think I was running off some stress, too. Either way: faster than expected. Not the third-in-a-row ultra-low-heart-rate-Tuesday-run in a row I was on the lookout for, which is fine.\n\nLooking ahead, things definitely actually for-*real*-real get interesting the next three weeks. I add a mile a week to the long runs each week (three weeks of new longest runs ever!), and a half mile a week to the race pace segment on Thursdays; Tuesdays will lock in at four miles for a while. Plus I'm pulling all my runs forward a day for the next two weeks, due to some weekend scheduling conflicts. Fingers crossed, that's not a recipe for disaster.\n",
				"date_published": "2022-09-26T11:19:24-05:00",
				"url": "https://darby3.micro.blog/2022/09/25/id-flashed-this.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/26/saw-nine-inch.html",
				
				"content_html": "<p>Saw Nine Inch Nails on Saturday night. Second concert I&rsquo;ve been to this year. After seeing no shows for so long seeing a show with 22,998 of our closest friends felt wild. Nevermind that it was a <a href=\"https://pitchfork.com/news/nine-inch-nails-reunites-with-early-members-cover-filter-song-watch/\">news-worthy show</a>!</p>\n",
				"content_text": "Saw Nine Inch Nails on Saturday night. Second concert I've been to this year. After seeing no shows for so long seeing a show with 22,998 of our closest friends felt wild. Nevermind that it was a [news-worthy show](https://pitchfork.com/news/nine-inch-nails-reunites-with-early-members-cover-filter-song-watch/)!\n",
				"date_published": "2022-09-26T10:35:33-05:00",
				"url": "https://darby3.micro.blog/2022/09/26/saw-nine-inch.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/26/currently-reading-an.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780231192132\">An I-Novel</a> by Minae Mizumura 📚</p>\n",
				"content_text": "Currently reading: [An I-Novel](https://micro.blog/books/9780231192132) by Minae Mizumura 📚\n",
				"date_published": "2022-09-26T08:10:59-05:00",
				"url": "https://darby3.micro.blog/2022/09/26/currently-reading-an.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/21/not-an-audiobooks.html",
				
				"content_html": "<p>Not an audiobooks guy much, but if I were, I&rsquo;d probably pick <a href=\"https://libro.fm/\">Libro.fm</a> over Spotify in a heartbeat.</p>\n",
				"content_text": "Not an audiobooks guy much, but if I were, I'd probably pick [Libro.fm](https://libro.fm/) over Spotify in a heartbeat.\n",
				"date_published": "2022-09-21T12:00:58-05:00",
				"url": "https://darby3.micro.blog/2022/09/21/not-an-audiobooks.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/21/one-of-these.html",
				
				"content_html": "<p>One of these days I&rsquo;m going to unsubscribe from everything for a month. And I&rsquo;m going to use the money to treat everyone to ice cream. Everyone.</p>\n",
				"content_text": "One of these days I'm going to unsubscribe from everything for a month. And I'm going to use the money to treat everyone to ice cream. Everyone.\n",
				"date_published": "2022-09-21T09:06:21-05:00",
				"url": "https://darby3.micro.blog/2022/09/21/one-of-these.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/20/the-fact-that.html",
				
				"content_html": "<p>&hellip;the fact that it&rsquo;s been three years since I finished <em>Ducks, Newburyport</em>, the fact that it still doesn&rsquo;t take much to make me think about it, the fact that a recent post just reminded me to google &ldquo;everyday carry&rdquo;, the fact that it&rsquo;s just as Elmmann said&hellip; 📚</p>\n",
				"content_text": "...the fact that it's been three years since I finished *Ducks, Newburyport*, the fact that it still doesn't take much to make me think about it, the fact that a recent post just reminded me to google \"everyday carry\", the fact that it's just as Elmmann said... 📚\n",
				"date_published": "2022-09-20T10:54:02-05:00",
				"url": "https://darby3.micro.blog/2022/09/20/the-fact-that.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/19/ugh.html",
				
				"content_html": "<p>Ugh.</p>\n",
				"content_text": "Ugh.\n",
				"date_published": "2022-09-19T15:41:30-05:00",
				"url": "https://darby3.micro.blog/2022/09/19/ugh.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/18/started-watching-the.html",
				
				"content_html": "<p>Started watching The Rings of Power tonight. Darn it if I’m not hooked.</p>\n",
				"content_text": "Started watching The Rings of Power tonight. Darn it if I’m not hooked. \n",
				"date_published": "2022-09-18T22:01:13-05:00",
				"url": "https://darby3.micro.blog/2022/09/18/started-watching-the.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/17/185836.html",
				"title": "Week three running report 🏃",
				"content_html": "<p>When I was setting up this training plan, I had mentally flagged this week not as a do-or-die week, but maybe as a sort of…do-or-seriously-reassess-my-life-choices week. All three runs were longer this week, taking me up to 14.5 miles; nothing too far outside my comfort zone yet, but it was going to be a big jump over last week’s 12.</p>\n<p>The good news is, this week was…fairly uneventful! I feel like I’m relaxing into and enjoying the easy runs; my pace has been way below what I know I’m capable of, and I love it. After doing the speed thing earlier this year, running easy feels so pleasant. If I lost all interest in pushing my boundaries, I think I could happily repeat a week like this one for as long as my body wants to hold up.</p>\n<p>The most newsworthy run was my 3.5 mile Tuesday run, which was my second shockingly low heart rate Tuesday run in a row. Either my watch glitched twice in a row, or I’m figuring out the zone two thing when I’m at my most well-rested. If I make it three in a row I’ll start to think I’m actually on to something. The Thursday five miler was smooth sailing; I’ve done pretty well in the heat this year, but yeah, the cooler night temperatures are making me happy. Despite shifting into the warmer afternoon today for six miles, I didn’t have any trouble getting through it, and even managed to clock my fastest pace for the week. Still slow! Still easy! But I’d be lying if I said it didn’t feel good to lop a few seconds off my pace without feeling like I was punishing myself in the process.</p>\n<p>Looking ahead to week four, I’ll run less total mileage, but I’ll start introducing “race pace” runs on Thursdays. My plan for those miles right now (well, mile, this week—one race pace mile, between a warm up and cool down mile) is just to try to run a little faster than I have been lately; still trying to keep it completely doable, but a notch more intense. I’m giving myself a lot of latitude to experiment, to see what feels good and maintainable, while also knowing I’m not actually committing myself to running those paces on race day. I think it will be easier to figure out what I’m doing with those runs once I get a few behind me.</p>\n",
				"content_text": "When I was setting up this training plan, I had mentally flagged this week not as a do-or-die week, but maybe as a sort of…do-or-seriously-reassess-my-life-choices week. All three runs were longer this week, taking me up to 14.5 miles; nothing too far outside my comfort zone yet, but it was going to be a big jump over last week’s 12. \n\nThe good news is, this week was…fairly uneventful! I feel like I’m relaxing into and enjoying the easy runs; my pace has been way below what I know I’m capable of, and I love it. After doing the speed thing earlier this year, running easy feels so pleasant. If I lost all interest in pushing my boundaries, I think I could happily repeat a week like this one for as long as my body wants to hold up.\n\nThe most newsworthy run was my 3.5 mile Tuesday run, which was my second shockingly low heart rate Tuesday run in a row. Either my watch glitched twice in a row, or I’m figuring out the zone two thing when I’m at my most well-rested. If I make it three in a row I’ll start to think I’m actually on to something. The Thursday five miler was smooth sailing; I’ve done pretty well in the heat this year, but yeah, the cooler night temperatures are making me happy. Despite shifting into the warmer afternoon today for six miles, I didn’t have any trouble getting through it, and even managed to clock my fastest pace for the week. Still slow! Still easy! But I’d be lying if I said it didn’t feel good to lop a few seconds off my pace without feeling like I was punishing myself in the process.\n\nLooking ahead to week four, I’ll run less total mileage, but I’ll start introducing “race pace” runs on Thursdays. My plan for those miles right now (well, mile, this week—one race pace mile, between a warm up and cool down mile) is just to try to run a little faster than I have been lately; still trying to keep it completely doable, but a notch more intense. I’m giving myself a lot of latitude to experiment, to see what feels good and maintainable, while also knowing I’m not actually committing myself to running those paces on race day. I think it will be easier to figure out what I’m doing with those runs once I get a few behind me.\n",
				"date_published": "2022-09-17T17:58:36-05:00",
				"url": "https://darby3.micro.blog/2022/09/17/185836.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/16/i-just-dont.html",
				
				"content_html": "<p>I just don&rsquo;t think I was particularly itching for a &ldquo;nice, pleasant enough&rdquo; Mars Volta album. 🎵</p>\n",
				"content_text": "I just don't think I was particularly itching for a \"nice, pleasant enough\" Mars Volta album. 🎵\n",
				"date_published": "2022-09-16T09:28:16-05:00",
				"url": "https://darby3.micro.blog/2022/09/16/i-just-dont.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/15/id-like-to.html",
				
				"content_html": "<p>I&rsquo;d like to announce my intention to be acquired by Adobe for $20 billion.</p>\n<p>I&rsquo;d really, really like to.</p>\n<p>&hellip;</p>\n<p>Your move, Adobe.</p>\n",
				"content_text": "I'd like to announce my intention to be acquired by Adobe for $20 billion.\r\n\r\nI'd really, really like to.\r\n\r\n...\r\n\r\nYour move, Adobe.\n",
				"date_published": "2022-09-15T11:57:30-05:00",
				"url": "https://darby3.micro.blog/2022/09/15/id-like-to.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/15/is-feedly-still.html",
				
				"content_html": "<p>Is feedly still the basic go-to RSS feed reader out there?</p>\n",
				"content_text": "Is feedly still the basic go-to RSS feed reader out there? \n",
				"date_published": "2022-09-15T06:56:19-05:00",
				"url": "https://darby3.micro.blog/2022/09/15/is-feedly-still.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/14/love-to-run.html",
				
				"content_html": "<p>Love to run under those beautiful Cleveland night skies… 😂🏃</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Love to run under those beautiful Cleveland night skies… 😂🏃\n\n<img src=\"uploads/2022/8d3c141594.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-09-14T10:39:09-05:00",
				"url": "https://darby3.micro.blog/2022/09/14/love-to-run.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/14/had-my-second.html",
				
				"content_html": "<p>Had my second shockingly-low-heart-rate Tuesday night run in a row last night. Am I starting to figure out this whole zone 2 thing finally…? 🏃</p>\n",
				"content_text": "Had my second shockingly-low-heart-rate Tuesday night run in a row last night. Am I starting to figure out this whole zone 2 thing finally…? 🏃\n",
				"date_published": "2022-09-14T07:14:07-05:00",
				"url": "https://darby3.micro.blog/2022/09/14/had-my-second.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/14/shout-out-around.html",
				
				"content_html": "<p>Shout out around this time of year to all my fellow folks rocking ancient iPhones until they pull them out of our cold dead hands.</p>\n",
				"content_text": "Shout out around this time of year to all my fellow folks rocking ancient iPhones until they pull them out of our cold dead hands. \n",
				"date_published": "2022-09-14T07:12:03-05:00",
				"url": "https://darby3.micro.blog/2022/09/14/shout-out-around.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/14/i-dont-usually.html",
				
				"content_html": "<p>I don’t usually get up in arms over NY Times op-eds, but golly have I seen a couple doozy headlines recently. 😮</p>\n",
				"content_text": "I don’t usually get up in arms over NY Times op-eds, but golly have I seen a couple doozy headlines recently. 😮\n",
				"date_published": "2022-09-14T07:06:54-05:00",
				"url": "https://darby3.micro.blog/2022/09/14/i-dont-usually.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/12/going-on-hours.html",
				
				"content_html": "<p>Going on 18 hours post-super-booster shot, and the side effects are &hellip; mild, vague, like I feel generally askew to the world around me. (Which is usually how I feel, this time it&rsquo;s just more physical.) My arm hurt like heck overnight—forgot about that special fun.</p>\n",
				"content_text": "Going on 18 hours post-super-booster shot, and the side effects are ... mild, vague, like I feel generally askew to the world around me. (Which is usually how I feel, this time it's just more physical.) My arm hurt like heck overnight—forgot about that special fun. \n",
				"date_published": "2022-09-12T09:39:15-05:00",
				"url": "https://darby3.micro.blog/2022/09/12/going-on-hours.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/11/got-the-new.html",
				
				"content_html": "<p>Got the new booster today.</p>\n",
				"content_text": "Got the new booster today.\n",
				"date_published": "2022-09-11T18:05:01-05:00",
				"url": "https://darby3.micro.blog/2022/09/11/got-the-new.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/11/week-two-running.html",
				"title": "Week two running report 🏃",
				"content_html": "<p>Not a bad week!</p>\n<p>The three miler on Tuesday was weird. I knew I wanted to keep it light after the slugfest that was last Saturday, but…the maximum heart rate my watch reported at the end had to be an error. Was I even moving? Pace felt right, though, slow even for a generally slow runner like me, and I really didn’t feel even the slightest bit winded at the end of it, so…I don’t know. I’d like to try to do that again, whatever it is I did!</p>\n<p>Thursday felt more typical. It also felt really good. Pace averaged out down under 11/min which is my current rough (and evolving) target for the half. It just felt like a really good run, like exactly the kind of run I hope to maintain for the half. Too soon to tell if that’s optimistic or not yet.</p>\n<p>Saturday’s five miler I wound up running much earlier in the day than I usually do which mostly means it felt like I had to work for it a bit more than usual. But it was much smoother than last weekend’s four miler—never felt like I had to quit or stop, caught myself a couple times feeling like I was maybe starting to ramp up too much and started figuring out how to deliberately slow down a bit to compensate. (Also a good sign, I didn’t feel completely wiped out for the very long day of family activities I immediately transitioned to post-run.)</p>\n<p>Overall this week felt like what I needed; both further cementing a healthy base and also recovering from the rough run last weekend. Which is the kind of thing that really only comes with the perspective of having been doing a thing for a while—once upon a time a crummy run meant I was a total failure and all my progress was lost and also I’m a huge fraud. Now it’s more just a bump in the road of a much longer game. Not that I don’t beat myself up for it, just…not as much.</p>\n<p>The next two weeks I’ve felt for a while are going to be…interesting? Bellwethers? Things ramp up this week, all three runs are longer than the previous weeks’ counterparts, with a long 5 miler on Thursday and a 6 miler on Saturday. The following week mileage drops a bit for a bit but only because of the transition to race pace runs on Thursdays. It’s going to get interesting. And educational.</p>\n",
				"content_text": "Not a bad week!\n\nThe three miler on Tuesday was weird. I knew I wanted to keep it light after the slugfest that was last Saturday, but…the maximum heart rate my watch reported at the end had to be an error. Was I even moving? Pace felt right, though, slow even for a generally slow runner like me, and I really didn’t feel even the slightest bit winded at the end of it, so…I don’t know. I’d like to try to do that again, whatever it is I did! \n\nThursday felt more typical. It also felt really good. Pace averaged out down under 11/min which is my current rough (and evolving) target for the half. It just felt like a really good run, like exactly the kind of run I hope to maintain for the half. Too soon to tell if that’s optimistic or not yet. \n\nSaturday’s five miler I wound up running much earlier in the day than I usually do which mostly means it felt like I had to work for it a bit more than usual. But it was much smoother than last weekend’s four miler—never felt like I had to quit or stop, caught myself a couple times feeling like I was maybe starting to ramp up too much and started figuring out how to deliberately slow down a bit to compensate. (Also a good sign, I didn’t feel completely wiped out for the very long day of family activities I immediately transitioned to post-run.)\n\nOverall this week felt like what I needed; both further cementing a healthy base and also recovering from the rough run last weekend. Which is the kind of thing that really only comes with the perspective of having been doing a thing for a while—once upon a time a crummy run meant I was a total failure and all my progress was lost and also I’m a huge fraud. Now it’s more just a bump in the road of a much longer game. Not that I don’t beat myself up for it, just…not as much. \n\nThe next two weeks I’ve felt for a while are going to be…interesting? Bellwethers? Things ramp up this week, all three runs are longer than the previous weeks’ counterparts, with a long 5 miler on Thursday and a 6 miler on Saturday. The following week mileage drops a bit for a bit but only because of the transition to race pace runs on Thursdays. It’s going to get interesting. And educational. \n",
				"date_published": "2022-09-11T09:34:51-05:00",
				"url": "https://darby3.micro.blog/2022/09/11/week-two-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/09/currently-reading-chronicles.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780593320174\">Chronicles from the Land of the Happiest People on Earth</a> by Wole Soyinka 📚</p>\n",
				"content_text": "Currently reading: [Chronicles from the Land of the Happiest People on Earth](https://micro.blog/books/9780593320174) by Wole Soyinka 📚\n",
				"date_published": "2022-09-09T15:17:11-05:00",
				"url": "https://darby3.micro.blog/2022/09/09/currently-reading-chronicles.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/07/dropped-a-new.html",
				
				"content_html": "<p>Dropped a new issue of <a href=\"https://tinyletter.com/darby3\">my books newsletter</a> last night. Spoiler alert: I really liked <em>Rebecca</em> by Daphne du Maurier. 📚</p>\n",
				"content_text": "Dropped a new issue of [my books newsletter](https://tinyletter.com/darby3) last night. Spoiler alert: I really liked *Rebecca* by Daphne du Maurier. 📚\n",
				"date_published": "2022-09-07T08:27:02-05:00",
				"url": "https://darby3.micro.blog/2022/09/07/dropped-a-new.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/05/week-one-running.html",
				"title": "Week one running report 🏃",
				"content_html": "<p>One week into the half marathon training plan. Still feel like I’m trying to get back into the swing of things, trying to relearn how to actually keep easy runs…easy.</p>\n<p>The first two runs were pretty solid. I don’t think my knee is giving me any real trouble now.</p>\n<p>Saturday’s four miler was one of my uglier runs, though; had to stop once or twice to get my heart rate back down because I could feel myself redlining. It was far warmer outside than I’d anticipated, which might have been part of the problem.</p>\n<p>So that wasn’t ideal but the good takeaway was that—in the past when I’ve stopped like that I’ve typically struggled to keep going at all after; this time I did run all the miles. So that was an interesting development.</p>\n<p>Also took a new set of shoes out for the first time, switching from my New Balance 860s to the Asics GT-2000s. I’ve been feeling like I’ve been landing hard in the 860s and felt like it was a good time to try something new after 3 years. One I got going I did like the feel of the Asics. We’ll see how they do over the next week.</p>\n",
				"content_text": "One week into the half marathon training plan. Still feel like I’m trying to get back into the swing of things, trying to relearn how to actually keep easy runs…easy. \n\nThe first two runs were pretty solid. I don’t think my knee is giving me any real trouble now.\n\nSaturday’s four miler was one of my uglier runs, though; had to stop once or twice to get my heart rate back down because I could feel myself redlining. It was far warmer outside than I’d anticipated, which might have been part of the problem.\n\nSo that wasn’t ideal but the good takeaway was that—in the past when I’ve stopped like that I’ve typically struggled to keep going at all after; this time I did run all the miles. So that was an interesting development. \n\nAlso took a new set of shoes out for the first time, switching from my New Balance 860s to the Asics GT-2000s. I’ve been feeling like I’ve been landing hard in the 860s and felt like it was a good time to try something new after 3 years. One I got going I did like the feel of the Asics. We’ll see how they do over the next week. \n",
				"date_published": "2022-09-05T10:02:41-05:00",
				"url": "https://darby3.micro.blog/2022/09/05/week-one-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/09/02/i-kind-of.html",
				
				"content_html": "<p>I kind of forgot Modest Mouse put out an album last year. It&rsquo;s &hellip; not bad.</p>\n",
				"content_text": "I kind of forgot Modest Mouse put out an album last year. It's ... not bad.\n",
				"date_published": "2022-09-02T10:43:27-05:00",
				"url": "https://darby3.micro.blog/2022/09/02/i-kind-of.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/02/booted-up-ratchet.html",
				
				"content_html": "<p>Booted up Ratchet &amp; Clank: Drift Apart on the PS5 last night. I&rsquo;ve been playing these games since the first one on the PS2 in 2002. Every next-gen console has been a leap. And now here I am in 2022&hellip;literally playing cutscenes. But, like, better. Truly wild. 🎮</p>\n",
				"content_text": "Booted up Ratchet & Clank: Drift Apart on the PS5 last night. I've been playing these games since the first one on the PS2 in 2002. Every next-gen console has been a leap. And now here I am in 2022...literally playing cutscenes. But, like, better. Truly wild. 🎮 \n",
				"date_published": "2022-09-02T10:14:43-05:00",
				"url": "https://darby3.micro.blog/2022/09/02/booted-up-ratchet.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/09/02/feeling-creatively-and.html",
				
				"content_html": "<p>Feeling creatively and technically restless lately.</p>\n",
				"content_text": "Feeling creatively and technically restless lately.\n",
				"date_published": "2022-09-02T10:06:54-05:00",
				"url": "https://darby3.micro.blog/2022/09/02/feeling-creatively-and.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/31/merge-conflicts-maybe.html",
				
				"content_html": "<p>16 merge conflicts? Maybe I&rsquo;ll just redo the entire project from scratch&hellip;</p>\n",
				"content_text": "16 merge conflicts? Maybe I'll just redo the entire project from scratch...\n",
				"date_published": "2022-08-31T09:34:55-05:00",
				"url": "https://darby3.micro.blog/2022/08/31/merge-conflicts-maybe.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/29/200000.html",
				"title": "First impressions of the PlayStation 5  🎮",
				"content_html": "<p>I&rsquo;ve had two nights with the PlayStation 5. Not coincidentally, I&rsquo;ve also recently had two utterly and completely blown bedtimes. And I have thoughts!</p>\n<p>I&rsquo;ve heard about the adaptive triggers on the new controllers for a while now but I had no idea what any of it meant until I actually I booted up the <em>Astro&rsquo;s Playroom</em> demo game and actually <em>felt</em> them kick in. It&rsquo;s maybe weird to admit this, but it felt like a bit of a jaw-drop moment. I didn&rsquo;t really know that controllers themselves could still be developed in new and interesting ways. I don&rsquo;t know how <em>much</em> there is to be done with this, maybe it&rsquo;s just a weird gimmick, but it feels like a gimmick I would very much miss were it to stop being a thing.</p>\n<p>I took the <em>Demon&rsquo;s Souls</em> remake for a brief spin, just through the intro tutorial and a tiny bit into wandering around the nexus. I played the heck out of the original back in the day and I&rsquo;m sure I have an incredibly nostalgic view of how good that game looked on the PS3. I imagine if I loaded it up today, it would still look <em>good</em>, I mean it would feel more like a modern game than anything on a PS1 would feel, but it couldn&rsquo;t look or feel as good as I remember it being. The PS5 remake, though&hellip;<em>it looks like my memory of the original</em>. It&rsquo;s somehow more real than my rose-tinted memory. It made me feel like I was having the kind of disorienting, out-of-time experience that could probably only be represented by an incredibly specific 23 syllable German word. I&rsquo;m looking forward to spending at least a little more time there.</p>\n<p>From there I wanted to try something new and exclusive so I&rsquo;m taking <em>Returnal</em> for a spin. I&rsquo;ve been dipping back into <em>Dead Cells</em> again recently on my iPad so this sort of rogue-like system has been top of mind lately—it&rsquo;s kind of theoretically perfect for how I play games these days, anyways. Also, <em>Returnal</em> comes from Housemarque, which was responsible for <em>Resogun</em>, probably one of my top ten favorite games ever. So, I mean, it&rsquo;s an instant gotta-try game. I&rsquo;m telling myself I&rsquo;m not going to get locked into any one game out of the gate here, as I don&rsquo;t have much game-playing time at my disposal, and I want to sample broadly to see what&rsquo;s what out there, but darn it if after my first couple cycles through the game if I&rsquo;m not completely hooked on the story, the setting, the look, and the overall feel. It is so absurdly smooth; I&rsquo;m not prone to motion sickness in games, but oh, sometimes, jumping off a ledge, I can&rsquo;t help but kind of feel my inner ear start to tell me that <em>hey that ground sure is coming up at you real hard and fast right now</em>.</p>\n<p>Still, between these two games there&rsquo;s definitely a sense of&hellip;like I said, the PS3 is closer to a PS5 than a PS1 is to a PS3; this feels like a more powerful iteration of something familiar, not a completely new thing entirely. But&hellip;what a compelling iteration it is. I love the Nintendo Switch and I love the games I&rsquo;m playing on that with my two boys; I mean, <em>Breath of the Wild</em> is so far beyond the hype its silly. I definitely have a few other gaming itches though that I think the PS5 is going to scratch.</p>\n<p>One dumb complaint, though: the system interface feels crazy. Maybe they just nailed it with the PS4 interface, but I feel like I&rsquo;m still trying to wrap my head around what&rsquo;s available when and what these different hidden layers are and&hellip;yeah. I&rsquo;ll get used to it, I don&rsquo;t hate it, and maybe it&rsquo;ll get better if I learn what I can (and should) turn off, but right now it feels like just a bit too much.</p>\n",
				"content_text": "I've had two nights with the PlayStation 5. Not coincidentally, I've also recently had two utterly and completely blown bedtimes. And I have thoughts!\n\nI've heard about the adaptive triggers on the new controllers for a while now but I had no idea what any of it meant until I actually I booted up the *Astro's Playroom* demo game and actually *felt* them kick in. It's maybe weird to admit this, but it felt like a bit of a jaw-drop moment. I didn't really know that controllers themselves could still be developed in new and interesting ways. I don't know how *much* there is to be done with this, maybe it's just a weird gimmick, but it feels like a gimmick I would very much miss were it to stop being a thing.\n\nI took the *Demon's Souls* remake for a brief spin, just through the intro tutorial and a tiny bit into wandering around the nexus. I played the heck out of the original back in the day and I'm sure I have an incredibly nostalgic view of how good that game looked on the PS3. I imagine if I loaded it up today, it would still look *good*, I mean it would feel more like a modern game than anything on a PS1 would feel, but it couldn't look or feel as good as I remember it being. The PS5 remake, though...*it looks like my memory of the original*. It's somehow more real than my rose-tinted memory. It made me feel like I was having the kind of disorienting, out-of-time experience that could probably only be represented by an incredibly specific 23 syllable German word. I'm looking forward to spending at least a little more time there.\n\nFrom there I wanted to try something new and exclusive so I'm taking *Returnal* for a spin. I've been dipping back into *Dead Cells* again recently on my iPad so this sort of rogue-like system has been top of mind lately—it's kind of theoretically perfect for how I play games these days, anyways. Also, *Returnal* comes from Housemarque, which was responsible for *Resogun*, probably one of my top ten favorite games ever. So, I mean, it's an instant gotta-try game. I'm telling myself I'm not going to get locked into any one game out of the gate here, as I don't have much game-playing time at my disposal, and I want to sample broadly to see what's what out there, but darn it if after my first couple cycles through the game if I'm not completely hooked on the story, the setting, the look, and the overall feel. It is so absurdly smooth; I'm not prone to motion sickness in games, but oh, sometimes, jumping off a ledge, I can't help but kind of feel my inner ear start to tell me that *hey that ground sure is coming up at you real hard and fast right now*. \n\nStill, between these two games there's definitely a sense of...like I said, the PS3 is closer to a PS5 than a PS1 is to a PS3; this feels like a more powerful iteration of something familiar, not a completely new thing entirely. But...what a compelling iteration it is. I love the Nintendo Switch and I love the games I'm playing on that with my two boys; I mean, *Breath of the Wild* is so far beyond the hype its silly. I definitely have a few other gaming itches though that I think the PS5 is going to scratch.\n\nOne dumb complaint, though: the system interface feels crazy. Maybe they just nailed it with the PS4 interface, but I feel like I'm still trying to wrap my head around what's available when and what these different hidden layers are and...yeah. I'll get used to it, I don't hate it, and maybe it'll get better if I learn what I can (and should) turn off, but right now it feels like just a bit too much.\n",
				"date_published": "2022-08-29T19:00:00-05:00",
				"url": "https://darby3.micro.blog/2022/08/29/200000.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/29/190000.html",
				"title": "My (current, highly malleable) half-marathon plan 🏃",
				"content_html": "<p>I&rsquo;ve been thinking about trying a half marathon—and, yes, a full marathon—for a while now. Now, I&rsquo;m actually planning on going after my first half marathon at the <a href=\"https://www.clewestrunningclub.org/fall-classic.html\">Fall Classic</a> in Cleveland on November 22.</p>\n<p>Why now? I&rsquo;ve been running for three years now, pretty consistently for the last year, and I still like it, I want to keep doing it, and I think I&rsquo;m in a good position to go for it. Coming off the 5k in July I know that having a challenge like that in front of me helps put the day-to-day activity into a framework that helps me keep my interest levels up. Also, I&rsquo;m 44, and while I know I&rsquo;ve got plenty of potential running years ahead of me should I choose to accept them, I also know I&rsquo;m not getting any younger, so if I&rsquo;ve got even a flicker of interest in it, now&rsquo;s probably the time to go for it.</p>\n<p>I will also say that my goals here are all very soft. I know well that anything from cataclysmic injury to flagging interest in the face of the demanding commitment could derail the whole process and that&rsquo;s fine. If I make it, I want it to feel incredible, and if I don&rsquo;t, I want to remember that I&rsquo;m still running and have run more miles in this lifetime than I may ever have expected I would.</p>\n<p>All that said, my ultimate goal, of course, is to tackle a full marathon. I&rsquo;ve been toying with some plans for a bit now and I think my best bet is start off with a half marathon in November, another in May 2023, and a third in November 2023, before moving on to the full marathon in May 2024. Assuming I&rsquo;m still healthy! And happy! And that there&rsquo;s still land to run on that hasn&rsquo;t been covered by the sea. I think this gives me the chance to build up my confidence and experiment with training approaches and intensities, while still pacing things out in a way so that it stays fun. I don&rsquo;t need to rush it and make myself miserable, but I don&rsquo;t want the big goal to be total vaporware.</p>\n<p>For this first half marathon, my only goal right now is to run the whole thing without needing walking breaks. I don&rsquo;t want to set a firm time goal, though I&rsquo;m <em>guessing</em> I could land it somewhere between 2:15 and 2:30, if I can maintain a healthy pace for the duration. That said, I took walking breaks during my first 5k in 2019, and during my first 10k earlier this year, and even if I&rsquo;m running like a dream in the weeks leading up to the half marathon, I know there&rsquo;s a swell chance race-day nerves will kick in and I&rsquo;ll wind up coming out hot and I&rsquo;ll need to compensate later. Which will be perfectly fine—all the more reason for giving myself at least three attempts at the half distance before going on to full as I work on figuring out how to tame that tendency.</p>\n<p>For my training schedule, I&rsquo;m going somewhat softly this first time, more softly in some ways than I did for the 5k in July. I&rsquo;m taking a hybrid of <a href=\"https://www.verywellfit.com/half-marathon-training-schedule-for-beginners-2911618\">this beginner&rsquo;s plan</a> and <a href=\"https://www.verywellfit.com/advanced-beginner-half-marathon-training-schedule-2911617\">this advanced beginer&rsquo;s plan</a>. I&rsquo;m taking the slightly more aggressive cadence of the advanced beginner&rsquo;s plan for the Tuesday, Thursday, and Saturday runs, but I&rsquo;m swapping out the Sunday easy run in favor of cross-training, as suggested by the beginner&rsquo;s plan.</p>\n<p>I&rsquo;m going with the higher-mileage plan just because because I feel like I can do it, and that those few extra miles each week will help me feel more confident going into the race. Generally the miles will be easier miles than I did training for the 5k—like, no hard interval runs, this time out, and my &ldquo;race pace&rdquo; runs I <em>think</em> will be less intense than my threshhold runs from the 5k training plan. Mostly I want to continue educating my body about what my &ldquo;next gear&rdquo; feels like, to try to get some better sense of what sustainable and potential trouble each feel like. Honestly, pace in general is a huge question mark for me, right now, which is all the more reason to treat this first attempt as an educational experiment.</p>\n<p>As for the extra cross-training day on Sundays, while I was running four days a week training for the 5k, while I&rsquo;m really excited to know I can do that, I kind of want to keep that in reserve for next time. If this first round goes well, introducing the fourth day again next time should be an easy way to help me improve from there. I do also wonder if it was maybe a shade too much, what with including hard intervals and fairly hard threshhold runs in the mix. I&rsquo;m still working my confidence back up after the mild knee injury I developed during the race and I&rsquo;m not looking to aggravate that just yet. So aside from just, you know, taking it easy on my joints, I&rsquo;ve also started getting out on my bicycles again, which has felt really nice, and I&rsquo;m happy to use cross-training as an excuse to keep putting some easy miles in on the wheels.</p>\n<p>All that said, I can&rsquo;t lie—I&rsquo;m certainly already second-guessing myself, here. Was it a mistake to tell everyone so early that I&rsquo;m trying this? Is it a mistakle to try this at all? Is this actually already happening, is this real, am I really doing my first official training runs this week? I guess there&rsquo;s only one way to answer these questions.</p>\n",
				"content_text": "I've been thinking about trying a half marathon—and, yes, a full marathon—for a while now. Now, I'm actually planning on going after my first half marathon at the [Fall Classic](https://www.clewestrunningclub.org/fall-classic.html) in Cleveland on November 22. \n\nWhy now? I've been running for three years now, pretty consistently for the last year, and I still like it, I want to keep doing it, and I think I'm in a good position to go for it. Coming off the 5k in July I know that having a challenge like that in front of me helps put the day-to-day activity into a framework that helps me keep my interest levels up. Also, I'm 44, and while I know I've got plenty of potential running years ahead of me should I choose to accept them, I also know I'm not getting any younger, so if I've got even a flicker of interest in it, now's probably the time to go for it.\n\nI will also say that my goals here are all very soft. I know well that anything from cataclysmic injury to flagging interest in the face of the demanding commitment could derail the whole process and that's fine. If I make it, I want it to feel incredible, and if I don't, I want to remember that I'm still running and have run more miles in this lifetime than I may ever have expected I would.\n\nAll that said, my ultimate goal, of course, is to tackle a full marathon. I've been toying with some plans for a bit now and I think my best bet is start off with a half marathon in November, another in May 2023, and a third in November 2023, before moving on to the full marathon in May 2024. Assuming I'm still healthy! And happy! And that there's still land to run on that hasn't been covered by the sea. I think this gives me the chance to build up my confidence and experiment with training approaches and intensities, while still pacing things out in a way so that it stays fun. I don't need to rush it and make myself miserable, but I don't want the big goal to be total vaporware.\n\nFor this first half marathon, my only goal right now is to run the whole thing without needing walking breaks. I don't want to set a firm time goal, though I'm *guessing* I could land it somewhere between 2:15 and 2:30, if I can maintain a healthy pace for the duration. That said, I took walking breaks during my first 5k in 2019, and during my first 10k earlier this year, and even if I'm running like a dream in the weeks leading up to the half marathon, I know there's a swell chance race-day nerves will kick in and I'll wind up coming out hot and I'll need to compensate later. Which will be perfectly fine—all the more reason for giving myself at least three attempts at the half distance before going on to full as I work on figuring out how to tame that tendency.\n\nFor my training schedule, I'm going somewhat softly this first time, more softly in some ways than I did for the 5k in July. I'm taking a hybrid of [this beginner's plan](https://www.verywellfit.com/half-marathon-training-schedule-for-beginners-2911618) and [this advanced beginer's plan](https://www.verywellfit.com/advanced-beginner-half-marathon-training-schedule-2911617). I'm taking the slightly more aggressive cadence of the advanced beginner's plan for the Tuesday, Thursday, and Saturday runs, but I'm swapping out the Sunday easy run in favor of cross-training, as suggested by the beginner's plan. \n\nI'm going with the higher-mileage plan just because because I feel like I can do it, and that those few extra miles each week will help me feel more confident going into the race. Generally the miles will be easier miles than I did training for the 5k—like, no hard interval runs, this time out, and my \"race pace\" runs I *think* will be less intense than my threshhold runs from the 5k training plan. Mostly I want to continue educating my body about what my \"next gear\" feels like, to try to get some better sense of what sustainable and potential trouble each feel like. Honestly, pace in general is a huge question mark for me, right now, which is all the more reason to treat this first attempt as an educational experiment.\n\nAs for the extra cross-training day on Sundays, while I was running four days a week training for the 5k, while I'm really excited to know I can do that, I kind of want to keep that in reserve for next time. If this first round goes well, introducing the fourth day again next time should be an easy way to help me improve from there. I do also wonder if it was maybe a shade too much, what with including hard intervals and fairly hard threshhold runs in the mix. I'm still working my confidence back up after the mild knee injury I developed during the race and I'm not looking to aggravate that just yet. So aside from just, you know, taking it easy on my joints, I've also started getting out on my bicycles again, which has felt really nice, and I'm happy to use cross-training as an excuse to keep putting some easy miles in on the wheels.\n\nAll that said, I can't lie—I'm certainly already second-guessing myself, here. Was it a mistake to tell everyone so early that I'm trying this? Is it a mistakle to try this at all? Is this actually already happening, is this real, am I really doing my first official training runs this week? I guess there's only one way to answer these questions.\n",
				"date_published": "2022-08-29T18:00:00-05:00",
				"url": "https://darby3.micro.blog/2022/08/29/190000.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/28/well-all-things.html",
				
				"content_html": "<p>Well all things going well I’ll be running my first half marathon 12 weeks from today. 🏃</p>\n",
				"content_text": "Well all things going well I’ll be running my first half marathon 12 weeks from today. 🏃\n",
				"date_published": "2022-08-28T20:17:21-05:00",
				"url": "https://darby3.micro.blog/2022/08/28/well-all-things.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/25/currently-reading-abandon.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781632866585\">Abandon Me</a> by Melissa Febos 📚</p>\n",
				"content_text": "Currently reading: [Abandon Me](https://micro.blog/books/9781632866585) by Melissa Febos 📚\n",
				"date_published": "2022-08-25T14:21:08-05:00",
				"url": "https://darby3.micro.blog/2022/08/25/currently-reading-abandon.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/25/stayed-up-too.html",
				
				"content_html": "<p>Stayed up too late finishing The Faithful and the Fallen series by John Gwynne last night. Excellent summer reading binge. Not that I&rsquo;m ready to admit summer&rsquo;s ending, though. Oh no. No no no. 📚</p>\n",
				"content_text": "Stayed up too late finishing The Faithful and the Fallen series by John Gwynne last night. Excellent summer reading binge. Not that I'm ready to admit summer's ending, though. Oh no. No no no. 📚\n",
				"date_published": "2022-08-25T14:20:47-05:00",
				"url": "https://darby3.micro.blog/2022/08/25/stayed-up-too.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/23/wowi-may-have.html",
				
				"content_html": "<p>Wow&hellip;I may have just found a valid use for !important in a web project. Clearly it&rsquo;s time for lunch. Possibly dinner, too.</p>\n",
				"content_text": "Wow...I may have just found a valid use for !important in a web project. Clearly it's time for lunch. Possibly dinner, too.\n",
				"date_published": "2022-08-23T11:17:17-05:00",
				"url": "https://darby3.micro.blog/2022/08/23/wowi-may-have.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/22/i-do-like.html",
				
				"content_html": "<p>I do like PHPstorm, but, it sure does feel&hellip;crashier, the longer I use it.</p>\n",
				"content_text": "I do like PHPstorm, but, it sure does feel...crashier, the longer I use it.\n",
				"date_published": "2022-08-22T11:18:04-05:00",
				"url": "https://darby3.micro.blog/2022/08/22/i-do-like.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/21/hit-the-k.html",
				
				"content_html": "<p>Hit the 5k mark for the first time since the race. Knee feels pretty solid. Run felt like work but in the okay way. Onward. 🏃</p>\n",
				"content_text": "Hit the 5k mark for the first time since the race. Knee feels pretty solid. Run felt like work but in the okay way. Onward. 🏃\n",
				"date_published": "2022-08-21T18:43:02-05:00",
				"url": "https://darby3.micro.blog/2022/08/21/hit-the-k.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/21/from-the-asian.html",
				
				"content_html": "<p>From the Asian Lantern Festival at the Cleveland Metroparks Zoo.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "From the Asian Lantern Festival at the Cleveland Metroparks Zoo. \n\n<img src=\"uploads/2022/b3b0865c4a.jpg\" width=\"599\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-08-21T09:35:32-05:00",
				"url": "https://darby3.micro.blog/2022/08/21/from-the-asian.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/19/okay-now-what.html",
				
				"content_html": "<p>Okay now, what exactly was I hoping to find with Scrapy, that caused me to derail what I was doing, into learning how to use Scrapy&hellip;?</p>\n",
				"content_text": "Okay now, what exactly was I hoping to find with Scrapy, that caused me to derail what I was doing, into learning how to use Scrapy...?\n",
				"date_published": "2022-08-19T08:52:28-05:00",
				"url": "https://darby3.micro.blog/2022/08/19/okay-now-what.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/18/oops-accidentally-managed.html",
				
				"content_html": "<p>Oops: accidentally managed to possibly order a PS5 during today&rsquo;s Playstation Direct sale. 🎮</p>\n",
				"content_text": "Oops: accidentally managed to possibly order a PS5 during today's Playstation Direct sale. 🎮\n",
				"date_published": "2022-08-18T13:56:41-05:00",
				"url": "https://darby3.micro.blog/2022/08/18/oops-accidentally-managed.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/17/did-i-plan.html",
				
				"content_html": "<p>Did I plan to take a full month to get the next issue of my <a href=\"https://tinyletter.com/darby3\">books newsletter</a> out? No. Did it take that long? Sure. But it’s out! On to the next one! 📚</p>\n",
				"content_text": "Did I plan to take a full month to get the next issue of my [books newsletter](https://tinyletter.com/darby3) out? No. Did it take that long? Sure. But it’s out! On to the next one! 📚\n",
				"date_published": "2022-08-17T18:18:39-05:00",
				"url": "https://darby3.micro.blog/2022/08/17/did-i-plan.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/17/currently-reading-wrath.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780316386333\">Wrath</a> by John Gwynne 📚</p>\n",
				"content_text": "Currently reading: [Wrath](https://micro.blog/books/9780316386333) by John Gwynne 📚\n",
				"date_published": "2022-08-17T10:32:24-05:00",
				"url": "https://darby3.micro.blog/2022/08/17/currently-reading-wrath.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/15/bike-nerdery-my.html",
				
				"content_html": "<p>Bike nerdery:</p>\n<p>My Giant Escape hybrid. I love this bike.</p>\n<!-- raw HTML omitted -->\n<p>My Giant Defy road bike. Not getting as much use from it as I&rsquo;d like, as it&rsquo;s got a blown out tire I&rsquo;ve yet to get taken care of.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Bike nerdery:\n\nMy Giant Escape hybrid. I love this bike.\n\n<img src=\"uploads/2022/b286aa602b.jpg\" width=\"600\" height=\"800\" alt=\"Bicycle near a bridge in front of Cleveland's skyline.\" />\n\nMy Giant Defy road bike. Not getting as much use from it as I'd like, as it's got a blown out tire I've yet to get taken care of. \n\n<img src=\"uploads/2022/797662e218.jpg\" width=\"600\" height=\"450\" alt=\"Bicycle near a river in front of Cleveland's skyline.\" />\n",
				"date_published": "2022-08-15T15:42:37-05:00",
				"url": "https://darby3.micro.blog/2022/08/15/bike-nerdery-my.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/15/made-a-funky.html",
				
				"content_html": "<p>Made a funky looking bread and I’ve yet to even try it yet.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Made a funky looking bread and I’ve yet to even try it yet. \n\n<img src=\"uploads/2022/1869b62de4.jpg\" width=\"600\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-08-15T09:13:36-05:00",
				"url": "https://darby3.micro.blog/2022/08/15/made-a-funky.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/12/i-installed-raindropio.html",
				
				"content_html": "<p>I installed Raindrop.io a while ago but haven&rsquo;t used it. What I actually need is an extension that takes my existing &ldquo;bookmark this&rdquo; shortcuts and redirects them all directly into the trash. That way I don&rsquo;t feel bad about never looking at them ever again.</p>\n",
				"content_text": "I installed Raindrop.io a while ago but haven't used it. What I actually need is an extension that takes my existing \"bookmark this\" shortcuts and redirects them all directly into the trash. That way I don't feel bad about never looking at them ever again.\n",
				"date_published": "2022-08-12T11:55:07-05:00",
				"url": "https://darby3.micro.blog/2022/08/12/i-installed-raindropio.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/12/took-my-first.html",
				
				"content_html": "<p>Took my first couple tentative runs this week since the race. Feels weird having most of my body go, &ldquo;Yes please,&rdquo; while my knee is still like, &ldquo;Hey hey hey, let&rsquo;s maybe talk about this first, okay?&rdquo; 🏃</p>\n",
				"content_text": "Took my first couple tentative runs this week since the race. Feels weird having most of my body go, \"Yes please,\" while my knee is still like, \"Hey hey hey, let's maybe talk about this first, okay?\" 🏃\n",
				"date_published": "2022-08-12T09:34:26-05:00",
				"url": "https://darby3.micro.blog/2022/08/12/took-my-first.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/08/11/i-dont-do.html",
				
				"content_html": "<p>I don&rsquo;t do <em>much</em> JS work, though I probably could. Or should. So I&rsquo;m trying to fill in some knowledge gaps. And&hellip;gosh. I can&rsquo;t imagine learning all this from the ground up today. Or maybe it&rsquo;d be easier that way, without fighting through weird historical knowledge? Hmm.</p>\n",
				"content_text": "I don't do *much* JS work, though I probably could. Or should. So I'm trying to fill in some knowledge gaps. And...gosh. I can't imagine learning all this from the ground up today. Or maybe it'd be easier that way, without fighting through weird historical knowledge? Hmm.\n",
				"date_published": "2022-08-11T09:18:25-05:00",
				"url": "https://darby3.micro.blog/2022/08/11/i-dont-do.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/08/tfw-youre-excited.html",
				
				"content_html": "<p>TFW you&rsquo;re excited The Mars Volta is releasing a new album but are also a little bit nervous because none of the advance singles have grabbed your attention&hellip; 🎵</p>\n",
				"content_text": "TFW you're excited The Mars Volta is releasing a new album but are also a little bit nervous because none of the advance singles have grabbed your attention... 🎵\n",
				"date_published": "2022-08-08T16:11:06-05:00",
				"url": "https://darby3.micro.blog/2022/08/08/tfw-youre-excited.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/08/the-sand-dunes.html",
				
				"content_html": "<p>The sand dunes in western Michigan are wild.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "The sand dunes in western Michigan are wild. \n\n<img src=\"uploads/2022/1bda4a1e2a.jpg\" width=\"600\" height=\"449\" alt=\"\" />\n",
				"date_published": "2022-08-08T11:22:31-05:00",
				"url": "https://darby3.micro.blog/2022/08/08/the-sand-dunes.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/03/dont-mind-me.html",
				
				"content_html": "<p>Don&rsquo;t mind me, just out here exploring js module bundlers. In 2022. NBD.</p>\n",
				"content_text": "Don't mind me, just out here exploring js module bundlers. In 2022. NBD.\n",
				"date_published": "2022-08-03T11:06:38-05:00",
				"url": "https://darby3.micro.blog/2022/08/03/dont-mind-me.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/08/01/currently-reading-ruin.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780316386326\">Ruin</a> by John Gwynne 📚</p>\n",
				"content_text": "Currently reading: [Ruin](https://micro.blog/books/9780316386326) by John Gwynne 📚\n",
				"date_published": "2022-08-01T11:11:39-05:00",
				"url": "https://darby3.micro.blog/2022/08/01/currently-reading-ruin.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/28/hello-cleveland.html",
				
				"content_html": "<p>Hello, Cleveland.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Hello, Cleveland. \n\n<img src=\"uploads/2022/d05d9314a3.jpg\" width=\"450\" height=\"600\" alt=\"Cleveland's skyline at night, viewed through a chain link fence.\" />\n",
				"date_published": "2022-07-28T08:38:55-05:00",
				"url": "https://darby3.micro.blog/2022/07/28/hello-cleveland.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/26/have-been-off.html",
				
				"content_html": "<p>Have been off running since the race last weekend. Was thinking about taking a recovery week anyway, even before I realized I yoinked something in my knee during the race. Think I’m almost ready to try starting back up. 🏃</p>\n",
				"content_text": "Have been off running since the race last weekend. Was thinking about taking a recovery week anyway, even before I realized I yoinked something in my knee during the race. Think I’m almost ready to try starting back up. 🏃\n",
				"date_published": "2022-07-26T18:02:25-05:00",
				"url": "https://darby3.micro.blog/2022/07/26/have-been-off.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/26/feeling-suddenly-curiosityrestless.html",
				
				"content_html": "<p>Feeling suddenly curiosity-restless. Like it&rsquo;s time to learn an entirely new&hellip;something. Not sure what though.</p>\n",
				"content_text": "Feeling suddenly curiosity-restless. Like it's time to learn an entirely new...something. Not sure what though.\n",
				"date_published": "2022-07-26T09:40:18-05:00",
				"url": "https://darby3.micro.blog/2022/07/26/feeling-suddenly-curiosityrestless.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/25/finally-watched-the.html",
				
				"content_html": "<p>Finally watched the movie Strange Days last night. After watching Until the End of the World a few months ago, I’ve had pre-millennium anxiety on the mind lately. Something anyone born in the new millennium wouldn’t understand… 🍿</p>\n",
				"content_text": "Finally watched the movie Strange Days last night. After watching Until the End of the World a few months ago, I’ve had pre-millennium anxiety on the mind lately. Something anyone born in the new millennium wouldn’t understand… 🍿\n",
				"date_published": "2022-07-25T18:31:17-05:00",
				"url": "https://darby3.micro.blog/2022/07/25/finally-watched-the.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/25/did-a-very.html",
				
				"content_html": "<p>Did a very silly thing to get an idea about how Netlify Functions work. Now I guess I should be on the hunt for a less-silly use.</p>\n",
				"content_text": "Did a very silly thing to get an idea about how Netlify Functions work. Now I guess I should be on the hunt for a less-silly use.\n",
				"date_published": "2022-07-25T09:09:43-05:00",
				"url": "https://darby3.micro.blog/2022/07/25/did-a-very.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/25/currently-reading-harrow.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781250313201\">Harrow the Ninth</a> by Tamsyn Muir 📚</p>\n",
				"content_text": "Currently reading: [Harrow the Ninth](https://micro.blog/books/9781250313201) by Tamsyn Muir 📚\n",
				"date_published": "2022-07-25T08:31:42-05:00",
				"url": "https://darby3.micro.blog/2022/07/25/currently-reading-harrow.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/24/summertime.html",
				
				"content_html": "<p>Summertime. 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Summertime. 📷\n\n<img src=\"uploads/2022/5042bbf620.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-07-24T10:05:23-05:00",
				"url": "https://darby3.micro.blog/2022/07/24/summertime.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/23/cuyahoga-valley-national.html",
				
				"content_html": "<p>Cuyahoga Valley National Park. 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Cuyahoga Valley National Park. 📷\n\n<img src=\"uploads/2022/655f2ea6fc.jpg\" width=\"600\" height=\"450\" alt=\"\" />\n",
				"date_published": "2022-07-23T15:57:25-05:00",
				"url": "https://darby3.micro.blog/2022/07/23/cuyahoga-valley-national.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/21/the-document-outline.html",
				
				"content_html": "<p><a href=\"https://css-tricks.com/roundup-of-recent-document-outline-chatter/\">The document outline algorithm is dead</a>. Which mostly means I&rsquo;m back to asking myself the age-old question: have I ever actually figured out when to actually use the <code>&lt;section&gt;</code> element? Probably not! Probably never will!</p>\n",
				"content_text": "[The document outline algorithm is dead](https://css-tricks.com/roundup-of-recent-document-outline-chatter/). Which mostly means I'm back to asking myself the age-old question: have I ever actually figured out when to actually use the `<section>` element? Probably not! Probably never will!\n",
				"date_published": "2022-07-21T10:26:39-05:00",
				"url": "https://darby3.micro.blog/2022/07/21/the-document-outline.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/21/somehow-just-realized.html",
				
				"content_html": "<p>Somehow just realized I had enough content to make use of categories on Micro.blog. And then I discovered filters. Well isn&rsquo;t that all just slick as all get-out!</p>\n",
				"content_text": "Somehow just realized I had enough content to make use of categories on Micro.blog. And then I discovered filters. Well isn't that all just slick as all get-out!\n",
				"date_published": "2022-07-21T09:42:09-05:00",
				"url": "https://darby3.micro.blog/2022/07/21/somehow-just-realized.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/20/okay-world-im.html",
				
				"content_html": "<p>Okay, world: I&rsquo;m going in. I&rsquo;m going to listen to the new &hellip;And You Will Know Us By The Trail Of Dead album. All the way through. If I don&rsquo;t make it out the other side, if you don&rsquo;t hear from me in three days, send snacks. 🎵</p>\n",
				"content_text": "Okay, world: I'm going in. I'm going to listen to the new ...And You Will Know Us By The Trail Of Dead album. All the way through. If I don't make it out the other side, if you don't hear from me in three days, send snacks. 🎵\n",
				"date_published": "2022-07-20T13:47:03-05:00",
				"url": "https://darby3.micro.blog/2022/07/20/okay-world-im.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/17/post-race-thoughts.html",
				"title": "Post race thoughts 🏃",
				"content_html": "<p>First of all: I did the thing.</p>\n<p><em>I did the thing!</em></p>\n<p>That’s it. That’s the post-race thought.</p>\n<p>As for my thoughts about the thought&hellip;</p>\n<p>Before this, any time I&rsquo;ve raced, it&rsquo;s just been to finish, to cross the finish line. This was the first time I’ve trained and raced with a specific time goal. I&rsquo;m glad I went through this experiment, and not just because the training pushed me to crush my goal time. I feel like I learned a lot from it, about my range and capabilities as a runner; the effort made me stronger, the edges of my comfort zones pushed back a a couple notches, at least. And of course it kept me on track to keep running through the first hot part of summer.</p>\n<p>Of course, ultimately crushing the goal time was like throwing a perfect cherry on top of the sundae&hellip;and then throwing an entire second sundae on top of that. All I <em>needed</em> to do to feel succesful was to beat my goal time by at least one second. To come in around three minutes under that time was right up there at the top end of my most optimistic, pie-in-the-sky, head-in-the-cloud secret goals.</p>\n<p>My strategy for the run itself was to try to just <em>know</em> that I could do it, that I’d trained hard enough that I could just let my race day adrenaline do its thing. I pictured myself keeping things smooth but swift for the first two or so miles, so that I&rsquo;d be able to go all-out the last half-mile, but of course, my race day nerves had other plans, and I did almost the opposite of that, with a fast, hard first mile, and a second mile that wasn&rsquo;t too far off.</p>\n<p>After that&hellip;I knew I was running fast and hard, but I didn&rsquo;t really know by how much. (I&rsquo;d made the conscious choice not to check my watch at all during the run, because I didn&rsquo;t want to psych myself out mid-race.) Rounding mile two I knew getting to the end was going to be as much a mental game as a physical one (oh, but it was still deeply, intensely physical!). Telling myself that whole last mile that I didn’t need to stop, that it wasn&rsquo;t time to stop yet, that I didn’t even <em>want</em> to stop, despite all the extremely hard and compelling evidence my body was throwing at me with each breath, was pretty much everything.</p>\n<p>Suffice it to say, that planned last half mile kick-up wasn&rsquo;t in the cards.. I knew I was already leaving everything out there I could, and the only thing left was to dig deep and keep going. Overall, my last mile was my slowest of the three, but the funny thing in retrospect is, is that it was still one of the three fastest complete miles I&rsquo;ve run maybe ever. &ldquo;Slowing down&rdquo; to what was still a ridiculously fast mile, for me? Priceless.</p>\n<p>It&rsquo;s funny to think about now, but at the time, it really felt like time and space were starting todo really weird things that final stretch. That last half mile straight-away up Belle Ave grew longer the further away from Lake Erie I ran. Someone kept moving the train tracks that crossed the mid-point kept moving away from me. The road was in fact rising to meet me&hellip;by becoming a mountain directly in front of my face.</p>\n<p>And then somewhere past the tracks—actually, it&rsquo;s been days since the race and I&rsquo;m still not convinced I&rsquo;ve reached those tracks yet, but I digress—amid the noise of the street festival past the finish line and the folks cheering for the runners alongside the course—the cheers of strangers are, truly, gifts—there was a guy walking down the sidewalk reading numbers out loud off his phone, <em>twenty-six something</em>, <em>twenty-six something plus one</em>, <em>twenty-six something plus two</em>, and time really did actually slow down for a moment, and I slipped out of my body, and I processed this information, and I realized that I wasn’t just about to reach my goal—this big, dumb, stupid, pointless goal I’d set for myself two months earlier, that I&rsquo;d been quietly obsessing over for eight weeks—but that I was about to obliterate it, and that realization slammed be back down into my body, and I somehow ran <em>harder</em>.</p>\n<p>I may never run like that again. But to feel the <em>something else</em> that lies just below the <em>nothing left</em> briefly take over? To feel that even once was a privilege and a delight. And then going from that to crossing the finish line, running straight into my family—my poor family, having my sweat-drenched, hyperventilating form collapsing all over them—was just perfect.</p>\n",
				"content_text": "First of all: I did the thing. \n\n_I did the thing!_ \n\nThat’s it. That’s the post-race thought. \n\nAs for my thoughts about the thought...\n\nBefore this, any time I've raced, it's just been to finish, to cross the finish line. This was the first time I’ve trained and raced with a specific time goal. I'm glad I went through this experiment, and not just because the training pushed me to crush my goal time. I feel like I learned a lot from it, about my range and capabilities as a runner; the effort made me stronger, the edges of my comfort zones pushed back a a couple notches, at least. And of course it kept me on track to keep running through the first hot part of summer.\n\nOf course, ultimately crushing the goal time was like throwing a perfect cherry on top of the sundae...and then throwing an entire second sundae on top of that. All I _needed_ to do to feel succesful was to beat my goal time by at least one second. To come in around three minutes under that time was right up there at the top end of my most optimistic, pie-in-the-sky, head-in-the-cloud secret goals.\n\nMy strategy for the run itself was to try to just _know_ that I could do it, that I’d trained hard enough that I could just let my race day adrenaline do its thing. I pictured myself keeping things smooth but swift for the first two or so miles, so that I'd be able to go all-out the last half-mile, but of course, my race day nerves had other plans, and I did almost the opposite of that, with a fast, hard first mile, and a second mile that wasn't too far off. \n\nAfter that...I knew I was running fast and hard, but I didn't really know by how much. (I'd made the conscious choice not to check my watch at all during the run, because I didn't want to psych myself out mid-race.) Rounding mile two I knew getting to the end was going to be as much a mental game as a physical one (oh, but it was still deeply, intensely physical!). Telling myself that whole last mile that I didn’t need to stop, that it wasn't time to stop yet, that I didn’t even _want_ to stop, despite all the extremely hard and compelling evidence my body was throwing at me with each breath, was pretty much everything.\n\nSuffice it to say, that planned last half mile kick-up wasn't in the cards.. I knew I was already leaving everything out there I could, and the only thing left was to dig deep and keep going. Overall, my last mile was my slowest of the three, but the funny thing in retrospect is, is that it was still one of the three fastest complete miles I've run maybe ever. \"Slowing down\" to what was still a ridiculously fast mile, for me? Priceless.\n\nIt's funny to think about now, but at the time, it really felt like time and space were starting todo really weird things that final stretch. That last half mile straight-away up Belle Ave grew longer the further away from Lake Erie I ran. Someone kept moving the train tracks that crossed the mid-point kept moving away from me. The road was in fact rising to meet me...by becoming a mountain directly in front of my face.\n\nAnd then somewhere past the tracks—actually, it's been days since the race and I'm still not convinced I've reached those tracks yet, but I digress—amid the noise of the street festival past the finish line and the folks cheering for the runners alongside the course—the cheers of strangers are, truly, gifts—there was a guy walking down the sidewalk reading numbers out loud off his phone, _twenty-six something_, _twenty-six something plus one_, _twenty-six something plus two_, and time really did actually slow down for a moment, and I slipped out of my body, and I processed this information, and I realized that I wasn’t just about to reach my goal—this big, dumb, stupid, pointless goal I’d set for myself two months earlier, that I'd been quietly obsessing over for eight weeks—but that I was about to obliterate it, and that realization slammed be back down into my body, and I somehow ran _harder_.\n\nI may never run like that again. But to feel the _something else_ that lies just below the _nothing left_ briefly take over? To feel that even once was a privilege and a delight. And then going from that to crossing the finish line, running straight into my family—my poor family, having my sweat-drenched, hyperventilating form collapsing all over them—was just perfect.\n",
				"date_published": "2022-07-20T11:50:20-05:00",
				"url": "https://darby3.micro.blog/2022/07/17/post-race-thoughts.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/18/currently-reading-valor.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780316399753\">Valor</a> by John Gwynne 📚</p>\n",
				"content_text": "Currently reading: [Valor](https://micro.blog/books/9780316399753) by John Gwynne 📚\n",
				"date_published": "2022-07-18T10:21:17-05:00",
				"url": "https://darby3.micro.blog/2022/07/18/currently-reading-valor.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/17/did-the-race.html",
				
				"content_html": "<p>Did the race last night. My time to beat was 29:27. I came in at 26:27. And then I ran off into the sunset and was never seen again… 🏃</p>\n",
				"content_text": "Did the race last night. My time to beat was 29:27. I came in at 26:27. And then I ran off into the sunset and was never seen again… 🏃\n",
				"date_published": "2022-07-17T09:18:58-05:00",
				"url": "https://darby3.micro.blog/2022/07/17/did-the-race.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/16/race-day-weather.html",
				
				"content_html": "<p>Race day. Weather is calling for 75 and partly cloudy at 7 pm race time. That…shouldn’t suck. 🏃</p>\n",
				"content_text": "Race day. Weather is calling for 75 and partly cloudy at 7 pm race time. That…shouldn’t suck. 🏃\n",
				"date_published": "2022-07-16T09:22:21-05:00",
				"url": "https://darby3.micro.blog/2022/07/16/race-day-weather.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/14/wasnt-expecting-the.html",
				
				"content_html": "<p>Wasn’t expecting the pre-race jitters to start 44 hours ahead of the race but here we are. 🏃</p>\n",
				"content_text": "Wasn’t expecting the pre-race jitters to start 44 hours ahead of the race but here we are. 🏃\n",
				"date_published": "2022-07-14T21:32:40-05:00",
				"url": "https://darby3.micro.blog/2022/07/14/wasnt-expecting-the.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/13/finally-finally-got.html",
				
				"content_html": "<p>Finally (finally) got the “I quit Twitter” issue of my 📚 <a href=\"https://tinyletter.com/darby3\">books newsletter</a> out. Onward…</p>\n",
				"content_text": "Finally (finally) got the “I quit Twitter” issue of my 📚 [books newsletter](https://tinyletter.com/darby3) out. Onward…\n",
				"date_published": "2022-07-13T16:14:58-05:00",
				"url": "https://darby3.micro.blog/2022/07/13/finally-finally-got.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/13/the-new-beth.html",
				
				"content_html": "<p>The new Beth Orton songs. 😮 🎵</p>\n",
				"content_text": "The new Beth Orton songs. 😮 🎵\n",
				"date_published": "2022-07-13T10:48:27-05:00",
				"url": "https://darby3.micro.blog/2022/07/13/the-new-beth.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/12/well-my-wife.html",
				
				"content_html": "<p>Well my wife left me alone with the platter of stuffed peppers and chorizo tacos she made for dinner and let’s just say that mistakes—tasty, tasty mistakes—have been made.</p>\n",
				"content_text": "Well my wife left me alone with the platter of stuffed peppers and chorizo tacos she made for dinner and let’s just say that mistakes—tasty, tasty mistakes—have been made. \n",
				"date_published": "2022-07-12T18:24:51-05:00",
				"url": "https://darby3.micro.blog/2022/07/12/well-my-wife.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/12/look-nasa-cmon.html",
				
				"content_html": "<p>Look, NASA, c&rsquo;mon, next time, just @ me direct when you want to tell me that literally whatever I&rsquo;m doing that day, doesn&rsquo;t matter one bit!</p>\n<p>😮</p>\n",
				"content_text": "Look, NASA, c'mon, next time, just @ me direct when you want to tell me that literally whatever I'm doing that day, doesn't matter one bit!\r\n\r\n😮\n",
				"date_published": "2022-07-12T11:21:11-05:00",
				"url": "https://darby3.micro.blog/2022/07/12/look-nasa-cmon.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/11/running-thoughts-from.html",
				"title": "Running thoughts from someone you shouldn't take advice from 🏃",
				"content_html": "<p>I was chatting with a friend of mine about running, and she suggested she might come back to me for training plan advice, which is hilarious because nobody should ask me for advice about anything, ever. That said, that conversation prompted me to think I should probably brain-dump what I&rsquo;ve learned over the last eight weeks, while it&rsquo;s top of mind, even if only for my own reference later.</p>\n<p>Long story short: I ran my first official 10k in May, at which point I realized I had exactly 8 weeks to go before my next race, a 5k. I&rsquo;ve been running for about 3 years at this point, though I didn&rsquo;t get really consistent with it until about last September, after completely bottoming out last summer. Coming out of this stretch of consistency, I was concerned about the summer—I did so well during the winter, would I lose all my progress when the summer heat hit? Having a formal short-term goal on top of a real training plan felt like a good way to keep my motivation and momentum up.</p>\n<p>So, I set the goal of not just making it to the 5k, but PRing at it&hellip;even if only by one second. Up to this point I&rsquo;ve mostly tried to look at speed and pace as interesting but not important. I&rsquo;m too old to need to go fast. My goals this year have been more around consistency and racking up a certain number of miles over the course of the year. But, given how I&rsquo;ve felt lately and the level consistency I&rsquo;ve maintained, speed has felt like something interesting I could play with. I&rsquo;ve felt like I <em>could</em> consciously boost my pace a bit, even if only for one race. So I decided to go for it, knowing once the race is behind me I can happily revert to easier runs to ride out the rest of the summer.</p>\n<p>Training plans for running are a dime a dozen. After searching for one intended to help improve a 5k race time, <a href=\"https://www.verywellfit.com/5k-intermediate-run-training-2911620\">I found this one at Verywell Fit</a>, which felt <em>right</em>, for me, like something I could apply to my current situation with some ease.</p>\n<p>I say <em>apply</em> because I had no intention of following any plan to the letter, instead choosing to freely adjust it to meet my needs. I dropped the plan back to 4 runs a week rather than 5; up to that point I was still generally running only 3 times a week, and jumping to 5 felt like a bad idea. I&rsquo;ve been interested in trying to get an extra run in during the week, though, so it felt like 4 runs a week was a comfortable stretch I was ready to try to make.</p>\n<p>I kept what I thought of as the three core runs—the interval run (or, &ldquo;the one with lots of extremely short, stupidly fast runs&rdquo;), the tempo run (or, &ldquo;the one with the mid-length, maintainably swift run&rdquo;), and the long, slow run (or, &ldquo;the one with the I-feel-like-I-could-literally-do-this-forever run&rdquo;)—because I wanted to formally experiment with speed while also consciously slowing down my long run.</p>\n<p>A little back story on that last point: leading up to the 10k in May I realized that I was kind of just going out and doing the same run all the time, generally going fast-for-me every time, and while I was getting faster, it also felt unsustainable. I wasn&rsquo;t playing with all the keys on the piano. Reading around online I kept seeing the same refrain about how most of your training run time should really be lighter, slower, more at a conversational pace. So even before I started the plan I was trying to learn how to slow down more often; with the plan, dedicating a couple runs each week to speed also meant trying my hardest to keep my other runs more low-key, either by pace or heart rate.</p>\n<p>All told, all of this pushed me to broaden my sense of my range as a runner—which, yes, calling myself a &ldquo;runner&rdquo; makes me feel like a huge imposter, still, sure—to really see what I was capable of at the upper and lower ends of my dials, and to start playing around a bit more with my sense of control and feel. Should I choose to focus on speed, like I plan to do at this race, I have a better sense of what healthy speed feels like and how very bad uh-oh-bad-idea speed can feel, the difference between the pace that can get me through the first two-thirds of the race and the pace I can throw at the last half mile because there&rsquo;s no reason to hold anything back because I will never ever ever have to run ever again for as long as I live as soon as I hit that finish line (at least until I go out again for my next run sometime after the race). Whatever happens at the race, I&rsquo;m glad I&rsquo;ve bettered my sense of feel.</p>\n<p>As I said above I did introduce a fourth easy run to my week. With interval runs on Tuesday, tempo runs on Thursday, and my long run on Saturday, I put the easy run on Monday, thinking to give myself a rest day after my long run day (and a free night to enjoy an adult beverage or two on Saturdays, after that long run!). This worked for me, there was a nice rhythm to the week, and I&rsquo;m hoping after the race to keep the fourth run going, after a couple super easy recovery weeks. I might move it back to Sundays, to the weekend, because holy moly do the weeks feel <em>full</em> right now, but we&rsquo;ll see.</p>\n<p>I liked the rhythm of having at most two runs two days in a row, for me, where I&rsquo;m at now. There was one week where I did have to move my Monday easy run to Wednesday, and while I did it, while I made three days in a row work that one time, and I actually did pretty well on that Thursday tempo run, I think I still prefer the more steady rate of rest days between run days. It definitely caught up to me in the fays that followed. I&rsquo;m not there yet, at least not with those fairly intense runs in the mix.</p>\n<p>I did little cross-training, because time is hard, though I did try to make sure I walked at least one good solid mile every day to help keep things loose, either as a lunchtime break or just around parks trying to keep up with my two kids. It&rsquo;s not much, but it&rsquo;s something. Again, unless the Olympics open up to middle-aged guys who drink beer for fun, what I&rsquo;m doing right now is just fine, thanks.</p>\n<p>I also found a yoga routine that I liked, which occupied Wednesday nights. I&rsquo;m pretty hooked on that now. The one time I skipped that was the one week where I had some pain that tipped from &ldquo;I&rsquo;m an old man and I&rsquo;m naturally creaky and of course I hurt but it&rsquo;s, like, a <em>good</em> hurt&rdquo; over to &ldquo;Oh no, my body is 75 percent broken-down rusty old cars and 25 percent small woodland creatures making their homes inside those cars.&rdquo; That week I had to skip my tempo run and shorten my long run; that little bit of recovery space cleared the way for a strong finish, though, letting me land my first (and last, for a while!) 20+ mile week ever just last week.</p>\n<p>All in all, the training plan itself went pretty well. I liked making the plan and then following it—doing 90 percent of the thinking up front, mostly, and then just doing the doing after that. For the most part, at least. I definitely felt free to modify details as I went based on what I learned along the way. I learned a bit about when I&rsquo;m better doing a run by pace instead of heart rate; how to set my watch to give me useful information instead of just constantly screaming at me the whole time that I, a total hobbyist, was unable to consistently keep a completely consistent tempo within a narrow 20 second range; when to go a little harder and when to ease up.</p>\n<p>On the flip side&hellip;putting all this time toward one specific goal that&rsquo;s going to happen in a single half-hour timespan early on a single Saturday evening is a weird headspace to be in. That&rsquo;s the mental game, though. I tell myself that what actually happens at the race doesn&rsquo;t matter—I could absolutely flub it and have the worst run of my life, and it wouldn&rsquo;t matter one bit, because the process of getting to that point, the work and improvements I&rsquo;ve enjoyed leading up to the race, that&rsquo;s the part that really matters for me.</p>\n<p>Which is a very nice thing to tell myself! And it might even be true! Still, though, obviously, of course I&rsquo;d be lying if I said that reaching that goal, perhaps even crushing it, reaching one of the <em>secret goals</em> I have locked away inside my brain for fear of ruining them by even thinking of speaking them aloud, doesn&rsquo;t actually matter to me at all. It does. Doing the thing would obviously be the incredibly delightful cherry to drop on top of this sundae. The sundae doesn&rsquo;t really need it, but it sure would look nice, wouldn&rsquo;t it?</p>\n<p>I&rsquo;ve got a couple easy runs ahead of me this week, a couple extra rest days, and then it&rsquo;s race day. My hope is that I&rsquo;ve both learned a few things that will help me run a better race than I have in the past, and that I&rsquo;ve also conditioned my system enough so that I comfortably take all my extra race-day adrenaline and pour it all out onto the race course. Whatever happens, it&rsquo;s not going to matter, but also, I feel pretty good about what could happen.</p>\n<p>Once I actually get to do the thing. Can I just do it right now? Get it over with? That&rsquo;d be nice. No? No? Darn. Worth the ask, anyway.</p>\n",
				"content_text": "I was chatting with a friend of mine about running, and she suggested she might come back to me for training plan advice, which is hilarious because nobody should ask me for advice about anything, ever. That said, that conversation prompted me to think I should probably brain-dump what I've learned over the last eight weeks, while it's top of mind, even if only for my own reference later.\n\nLong story short: I ran my first official 10k in May, at which point I realized I had exactly 8 weeks to go before my next race, a 5k. I've been running for about 3 years at this point, though I didn't get really consistent with it until about last September, after completely bottoming out last summer. Coming out of this stretch of consistency, I was concerned about the summer—I did so well during the winter, would I lose all my progress when the summer heat hit? Having a formal short-term goal on top of a real training plan felt like a good way to keep my motivation and momentum up.\n\nSo, I set the goal of not just making it to the 5k, but PRing at it...even if only by one second. Up to this point I've mostly tried to look at speed and pace as interesting but not important. I'm too old to need to go fast. My goals this year have been more around consistency and racking up a certain number of miles over the course of the year. But, given how I've felt lately and the level consistency I've maintained, speed has felt like something interesting I could play with. I've felt like I *could* consciously boost my pace a bit, even if only for one race. So I decided to go for it, knowing once the race is behind me I can happily revert to easier runs to ride out the rest of the summer.\n\nTraining plans for running are a dime a dozen. After searching for one intended to help improve a 5k race time, [I found this one at Verywell Fit](https://www.verywellfit.com/5k-intermediate-run-training-2911620), which felt *right*, for me, like something I could apply to my current situation with some ease.\n\nI say *apply* because I had no intention of following any plan to the letter, instead choosing to freely adjust it to meet my needs. I dropped the plan back to 4 runs a week rather than 5; up to that point I was still generally running only 3 times a week, and jumping to 5 felt like a bad idea. I've been interested in trying to get an extra run in during the week, though, so it felt like 4 runs a week was a comfortable stretch I was ready to try to make.\n\nI kept what I thought of as the three core runs—the interval run (or, \"the one with lots of extremely short, stupidly fast runs\"), the tempo run (or, \"the one with the mid-length, maintainably swift run\"), and the long, slow run (or, \"the one with the I-feel-like-I-could-literally-do-this-forever run\")—because I wanted to formally experiment with speed while also consciously slowing down my long run.\n\nA little back story on that last point: leading up to the 10k in May I realized that I was kind of just going out and doing the same run all the time, generally going fast-for-me every time, and while I was getting faster, it also felt unsustainable. I wasn't playing with all the keys on the piano. Reading around online I kept seeing the same refrain about how most of your training run time should really be lighter, slower, more at a conversational pace. So even before I started the plan I was trying to learn how to slow down more often; with the plan, dedicating a couple runs each week to speed also meant trying my hardest to keep my other runs more low-key, either by pace or heart rate.\n\nAll told, all of this pushed me to broaden my sense of my range as a runner—which, yes, calling myself a \"runner\" makes me feel like a huge imposter, still, sure—to really see what I was capable of at the upper and lower ends of my dials, and to start playing around a bit more with my sense of control and feel. Should I choose to focus on speed, like I plan to do at this race, I have a better sense of what healthy speed feels like and how very bad uh-oh-bad-idea speed can feel, the difference between the pace that can get me through the first two-thirds of the race and the pace I can throw at the last half mile because there's no reason to hold anything back because I will never ever ever have to run ever again for as long as I live as soon as I hit that finish line (at least until I go out again for my next run sometime after the race). Whatever happens at the race, I'm glad I've bettered my sense of feel.\n\nAs I said above I did introduce a fourth easy run to my week. With interval runs on Tuesday, tempo runs on Thursday, and my long run on Saturday, I put the easy run on Monday, thinking to give myself a rest day after my long run day (and a free night to enjoy an adult beverage or two on Saturdays, after that long run!). This worked for me, there was a nice rhythm to the week, and I'm hoping after the race to keep the fourth run going, after a couple super easy recovery weeks. I might move it back to Sundays, to the weekend, because holy moly do the weeks feel *full* right now, but we'll see.\n\nI liked the rhythm of having at most two runs two days in a row, for me, where I'm at now. There was one week where I did have to move my Monday easy run to Wednesday, and while I did it, while I made three days in a row work that one time, and I actually did pretty well on that Thursday tempo run, I think I still prefer the more steady rate of rest days between run days. It definitely caught up to me in the fays that followed. I'm not there yet, at least not with those fairly intense runs in the mix.\n\nI did little cross-training, because time is hard, though I did try to make sure I walked at least one good solid mile every day to help keep things loose, either as a lunchtime break or just around parks trying to keep up with my two kids. It's not much, but it's something. Again, unless the Olympics open up to middle-aged guys who drink beer for fun, what I'm doing right now is just fine, thanks. \n\nI also found a yoga routine that I liked, which occupied Wednesday nights. I'm pretty hooked on that now. The one time I skipped that was the one week where I had some pain that tipped from \"I'm an old man and I'm naturally creaky and of course I hurt but it's, like, a *good* hurt\" over to \"Oh no, my body is 75 percent broken-down rusty old cars and 25 percent small woodland creatures making their homes inside those cars.\" That week I had to skip my tempo run and shorten my long run; that little bit of recovery space cleared the way for a strong finish, though, letting me land my first (and last, for a while!) 20+ mile week ever just last week.\n\nAll in all, the training plan itself went pretty well. I liked making the plan and then following it—doing 90 percent of the thinking up front, mostly, and then just doing the doing after that. For the most part, at least. I definitely felt free to modify details as I went based on what I learned along the way. I learned a bit about when I'm better doing a run by pace instead of heart rate; how to set my watch to give me useful information instead of just constantly screaming at me the whole time that I, a total hobbyist, was unable to consistently keep a completely consistent tempo within a narrow 20 second range; when to go a little harder and when to ease up.\n\nOn the flip side...putting all this time toward one specific goal that's going to happen in a single half-hour timespan early on a single Saturday evening is a weird headspace to be in. That's the mental game, though. I tell myself that what actually happens at the race doesn't matter—I could absolutely flub it and have the worst run of my life, and it wouldn't matter one bit, because the process of getting to that point, the work and improvements I've enjoyed leading up to the race, that's the part that really matters for me.\n\nWhich is a very nice thing to tell myself! And it might even be true! Still, though, obviously, of course I'd be lying if I said that reaching that goal, perhaps even crushing it, reaching one of the *secret goals* I have locked away inside my brain for fear of ruining them by even thinking of speaking them aloud, doesn't actually matter to me at all. It does. Doing the thing would obviously be the incredibly delightful cherry to drop on top of this sundae. The sundae doesn't really need it, but it sure would look nice, wouldn't it?\n\nI've got a couple easy runs ahead of me this week, a couple extra rest days, and then it's race day. My hope is that I've both learned a few things that will help me run a better race than I have in the past, and that I've also conditioned my system enough so that I comfortably take all my extra race-day adrenaline and pour it all out onto the race course. Whatever happens, it's not going to matter, but also, I feel pretty good about what could happen. \n\nOnce I actually get to do the thing. Can I just do it right now? Get it over with? That'd be nice. No? No? Darn. Worth the ask, anyway.\n",
				"date_published": "2022-07-11T17:54:00-05:00",
				"url": "https://darby3.micro.blog/2022/07/11/running-thoughts-from.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/11/currently-reading-rebecca.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780380730407\">Rebecca</a> by Daphne Du Maurier 📚</p>\n",
				"content_text": "Currently reading: [Rebecca](https://micro.blog/books/9780380730407) by Daphne Du Maurier 📚\n",
				"date_published": "2022-07-11T15:03:12-05:00",
				"url": "https://darby3.micro.blog/2022/07/11/currently-reading-rebecca.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/10/tracks.html",
				
				"content_html": "<p>2 Tracks.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "2 Tracks. \n\n<img src=\"uploads/2022/1d6a98fbb8.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-07-10T12:24:09-05:00",
				"url": "https://darby3.micro.blog/2022/07/10/tracks.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/07/when-i-realize.html",
				
				"content_html": "<p>When I realize the web is mostly powered by folks like me making confused faces at obscure variable dumps, I find it truly amazing any of it works at all.</p>\n",
				"content_text": "When I realize the web is mostly powered by folks like me making confused faces at obscure variable dumps, I find it truly amazing any of it works at all.\n",
				"date_published": "2022-07-07T10:13:47-05:00",
				"url": "https://darby3.micro.blog/2022/07/07/when-i-realize.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/07/did-a-big.html",
				
				"content_html": "<p>Did a big shuffle of the 📚 TBR pile last night. If I can just take a solid 6 months off from all my other responsibilities, I think I could get it back down to less-than-night-terror-sweats-inducing proportions.</p>\n",
				"content_text": "Did a big shuffle of the 📚 TBR pile last night. If I can just take a solid 6 months off from all my other responsibilities, I think I could get it back down to less-than-night-terror-sweats-inducing proportions.\n",
				"date_published": "2022-07-07T09:50:31-05:00",
				"url": "https://darby3.micro.blog/2022/07/07/did-a-big.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/06/final-interval-run.html",
				
				"content_html": "<p>Final interval run last night. 🏃 7 weeks ago: 4x0.25 mile intervals from 8:56/mile pace down to 7:56/mile pace. I&rsquo;ve experimented a bit since then—shorter breaks, walking some during breaks. Last night, did 6x0.25 mile intervals, between 7:32 and 8:00/mile paces.</p>\n",
				"content_text": "Final interval run last night. 🏃 7 weeks ago: 4x0.25 mile intervals from 8:56/mile pace down to 7:56/mile pace. I've experimented a bit since then—shorter breaks, walking some during breaks. Last night, did 6x0.25 mile intervals, between 7:32 and 8:00/mile paces.\n",
				"date_published": "2022-07-06T10:06:19-05:00",
				"url": "https://darby3.micro.blog/2022/07/06/final-interval-run.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/05/currently-reading-taco.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781439148624\">Taco USA</a> by Gustavo Arellano 📚</p>\n",
				"content_text": "Currently reading: [Taco USA](https://micro.blog/books/9781439148624) by Gustavo Arellano 📚\n",
				"date_published": "2022-07-05T09:33:47-05:00",
				"url": "https://darby3.micro.blog/2022/07/05/currently-reading-taco.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/07/03/my-sourdough-still.html",
				
				"content_html": "<p>My sourdough still kicks.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "My sourdough still kicks. \n\n<img src=\"uploads/2022/2ed0e267e0.jpg\" width=\"600\" height=\"600\" alt=\"sourdough bread loaf\" />\n",
				"date_published": "2022-07-03T13:38:24-05:00",
				"url": "https://darby3.micro.blog/2022/07/03/my-sourdough-still.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/07/02/cracked-miles-running.html",
				
				"content_html": "<p>Cracked 300+ miles running for the year this morning. 🏃</p>\n",
				"content_text": "Cracked 300+ miles running for the year this morning. 🏃\n",
				"date_published": "2022-07-02T12:45:30-05:00",
				"url": "https://darby3.micro.blog/2022/07/02/cracked-miles-running.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/29/164600.html",
				
				"content_html": "<p>After posting last week how well my running was going&hellip;I had some less-swell runs just after. Naturally! Seem to be just hiccups though. Had a great 3x half-mile interval session last night. 🏃</p>\n",
				"content_text": "After posting last week how well my running was going...I had some less-swell runs just after. Naturally! Seem to be just hiccups though. Had a great 3x half-mile interval session last night. 🏃 \n",
				"date_published": "2022-06-29T15:46:00-05:00",
				"url": "https://darby3.micro.blog/2022/06/29/164600.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/28/sky-division.html",
				
				"content_html": "<p>Sky division.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Sky division. \n\n<img src=\"uploads/2022/db9513dfad.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-06-28T17:34:40-05:00",
				"url": "https://darby3.micro.blog/2022/06/28/sky-division.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/28/new-brutus-hard.html",
				
				"content_html": "<p><a href=\"https://www.youtube.com/watch?v=8Akgt2Bq-3s\">New Brutus</a>! 🎵 Hard to remember the last time I&rsquo;ve looked forward a new album this much. First song does not disappoint.</p>\n",
				"content_text": "[New Brutus](https://www.youtube.com/watch?v=8Akgt2Bq-3s)! 🎵 Hard to remember the last time I've looked forward a new album this much. First song does not disappoint.\n",
				"date_published": "2022-06-28T08:53:49-05:00",
				"url": "https://darby3.micro.blog/2022/06/28/new-brutus-hard.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/25/uh-oh-too.html",
				
				"content_html": "<p>Uh oh. Too much sourdough starter. Time for a baking binge…</p>\n",
				"content_text": "Uh oh. Too much sourdough starter. Time for a baking binge…\n",
				"date_published": "2022-06-25T10:18:49-05:00",
				"url": "https://darby3.micro.blog/2022/06/25/uh-oh-too.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/23/after-testing-about.html",
				
				"content_html": "<p>After testing about half the fresh cherries from this week’s CSA bag I think I might have to test the other half to confirm they are good. So good. So so good.</p>\n",
				"content_text": "After testing about half the fresh cherries from this week’s CSA bag I think I might have to test the other half to confirm they are good. So good. So so good. \n",
				"date_published": "2022-06-23T15:45:25-05:00",
				"url": "https://darby3.micro.blog/2022/06/23/after-testing-about.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/23/more-stereolab.html",
				
				"content_html": "<p><a href=\"https://pitchfork.com/news/stereolab-announce-new-switched-on-compilation-pulse-of-the-early-brain-share-robot-riot-listen/\">More Stereolab!</a> 🎵</p>\n",
				"content_text": "[More Stereolab!](https://pitchfork.com/news/stereolab-announce-new-switched-on-compilation-pulse-of-the-early-brain-share-robot-riot-listen/) 🎵\n",
				"date_published": "2022-06-23T10:27:46-05:00",
				"url": "https://darby3.micro.blog/2022/06/23/more-stereolab.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/23/summer-running-update.html",
				"title": "Summer 2022 running update 🏃",
				"content_html": "<p>I started running in 2019 in order to do the <a href=\"https://runsignup.com/Race/OH/Cleveland/StrollRoll5K1MileFunRun\">MetroHealth Friends of Mothers &amp; Infants Stroll &amp; Roll 5K</a>. The race supports a great cause, and in just a few months, it forced me to go from “Running a full mile would be kind of a neat thing to do!” to “Wow, I just ran three miles! Nobody in the history of the world has ever done that before! I am <em>amazing</em>!”</p>\n<p>And then I kept running.</p>\n<p>Kind of.</p>\n<p>Looking back, I realize my consistency those first two years was very hit or miss. I&rsquo;m not surprised that it culminated in a full-scale break-down blow-out &ldquo;This is stupid! I quit! And&hellip;and…did I mention this is stupid?&rdquo; moment last summer. There were other factors at play, sure, but also, it was stupid and running was stupid and I quit.</p>\n<p>Turns out, sometimes quitting is smart. I needed to walk away from my running-induced frustrations for a while. After clearing my head, I realized running wasn&rsquo;t <em>that</em> stupid. And that I wasn&rsquo;t ready to quit.</p>\n<p>So I started back up September with a nice easy 1 mile run.</p>\n<p>And <em>then</em> I kept running.</p>\n<p>Not every specific run has been fun, obviously, but running itself has been fun in general. I&rsquo;m not setting world records, I&rsquo;m not looking to compete against others. But my confidence and enjoyment have both increased.</p>\n<p>Races have helped. I did the Stroll &amp; Roll again in the fall, and then I ran a chilly 5k at the <a href=\"https://www.clewestrunningclub.org/fall-classic.html\">Cleveland Fall Classic</a>, and then in the spring I achieved the personal bucket list item of doing a 5k in under 30 minutes at the <a href=\"https://runsignup.com/Race/OH/Cleveland/TreatYoSelf\">Treat Yo Self 5k</a>.</p>\n<p>Turns out, consistency is good. Who knew! Doing the thing means you can do the thing! And I’m pretty sure I have gotten better at doing the thing, too. Now, I think, from a certain angle, if you squint at the last nine months <em>just</em> right, I think you can safely say that I’ve gone from “very slow but well-meaning” to “kind of actually approaching something resembling thoroughly average”.</p>\n<p>Progress!</p>\n<p>Most recently I ran the 10k the weekend of the <a href=\"https://www.clevelandmarathon.com/\">Cleveland Marathon</a>, where I didn&rsquo;t do as well as I&rsquo;d hoped I would, and am totally and completely fine with that. What mattered to me more was just doing it at all, getting the experience of it, the education from it, and also oh yeah surprising myself with some really great runs leading up to the race.</p>\n<p>And, just, I mean&hellip;I did the thing! It&rsquo;s possible I wore my finisher medal around the house for about a week afterward! Ask my family how much fun and totally not insufferable I am!</p>\n<p>Next up, I&rsquo;m running the <a href=\"https://runsignup.com/Race/OH/Lakewood/SummerMeltdown5K\">Lakewood Summer Meltdown 5k</a>. This race happens in shouting distance of my house and I&rsquo;ve wanted to do it since I started running. Since even before that: being a bystander at the party in the preceding years, seeing people crossing the finish line, feeling the energy in the air around it all, I think that contributed a lot to me even <em>thinking</em> about starting running.</p>\n<p>After I finished the 10k in May I realized I had exactly 8 weeks until the Meltdown 5k. It felt like a good time to experiment with my running schedule and explore different kinds of runs, with the goal of getting my speed up, even just a quarter-notch or so, in order to try to set a new 5k PR at the race. Lo and behold, I found <a href=\"https://www.verywellfit.com/5k-intermediate-run-training-2911620\">a training plan that catered exactly to that</a>.</p>\n<p>I&rsquo;m about halfway through this 8 week session. I think it&rsquo;s been going well! I stepped that plan back slightly at the outset—before this I was only running 3 days a week; and 5 felt like it would have been too much of a jump, especially for an old man like me, but 4 felt like a nice, attainable stretch goal, a limit I could get behind pushing. So I&rsquo;m following the interval run, tempo run, and long run routine, with an extra easy run mixed in there.</p>\n<p>This has smoothly but also dramatically pushed my weekly mileage up each week from where I was around the time of the 10k. It&rsquo;s also varied the kinds of miles I&rsquo;m running, which has been educational. Consciously doing &ldquo;easier&rdquo; miles has felt weird, even for someone who doesn&rsquo;t really go all that fast when he&rsquo;s going his fastest, but getting a broader sense of my range, a greater feel for what I can do (run 0.25 mile sprint at a sub-7:30 pace!) and can’t do (run a 0.25 mile sprint at a sub-7:30 pace if I’m going to do more than a few of those sprints in a single session!) has been interesting. It&rsquo;s fun to know what my hardest-run interval feels like, compared to those easy-breezy I-could-do-this-forever slow-boat long-run miles. Also turns out I absolutely love whatever passes for my version of a tempo run. Cool! That probably means I’m doing it wrong! Bummer!</p>\n<p>As for my race goal, if I can shave just one second off my last 5k race time, this will be a total and complete personal victory. And if I don’t, I don’t. But I think I can. So I’m going to go for it.</p>\n<p>After that, I’m pondering where I’m going to go from here. There’s a lot of options, now, which is kind of a wild place to be.</p>\n",
				"content_text": "I started running in 2019 in order to do the [MetroHealth Friends of Mothers & Infants Stroll & Roll 5K](https://runsignup.com/Race/OH/Cleveland/StrollRoll5K1MileFunRun). The race supports a great cause, and in just a few months, it forced me to go from “Running a full mile would be kind of a neat thing to do!” to “Wow, I just ran three miles! Nobody in the history of the world has ever done that before! I am _amazing_!”\n\nAnd then I kept running.\n\nKind of.\n\nLooking back, I realize my consistency those first two years was very hit or miss. I'm not surprised that it culminated in a full-scale break-down blow-out \"This is stupid! I quit! And...and…did I mention this is stupid?\" moment last summer. There were other factors at play, sure, but also, it was stupid and running was stupid and I quit.\n\nTurns out, sometimes quitting is smart. I needed to walk away from my running-induced frustrations for a while. After clearing my head, I realized running wasn't _that_ stupid. And that I wasn't ready to quit. \n\nSo I started back up September with a nice easy 1 mile run.\n\nAnd _then_ I kept running.\n\nNot every specific run has been fun, obviously, but running itself has been fun in general. I'm not setting world records, I'm not looking to compete against others. But my confidence and enjoyment have both increased. \n\nRaces have helped. I did the Stroll & Roll again in the fall, and then I ran a chilly 5k at the [Cleveland Fall Classic](https://www.clewestrunningclub.org/fall-classic.html), and then in the spring I achieved the personal bucket list item of doing a 5k in under 30 minutes at the [Treat Yo Self 5k](https://runsignup.com/Race/OH/Cleveland/TreatYoSelf).\n\nTurns out, consistency is good. Who knew! Doing the thing means you can do the thing! And I’m pretty sure I have gotten better at doing the thing, too. Now, I think, from a certain angle, if you squint at the last nine months _just_ right, I think you can safely say that I’ve gone from “very slow but well-meaning” to “kind of actually approaching something resembling thoroughly average”. \n\nProgress!\n\nMost recently I ran the 10k the weekend of the [Cleveland Marathon](https://www.clevelandmarathon.com/), where I didn't do as well as I'd hoped I would, and am totally and completely fine with that. What mattered to me more was just doing it at all, getting the experience of it, the education from it, and also oh yeah surprising myself with some really great runs leading up to the race. \n\nAnd, just, I mean...I did the thing! It's possible I wore my finisher medal around the house for about a week afterward! Ask my family how much fun and totally not insufferable I am!\n\nNext up, I'm running the [Lakewood Summer Meltdown 5k](https://runsignup.com/Race/OH/Lakewood/SummerMeltdown5K). This race happens in shouting distance of my house and I've wanted to do it since I started running. Since even before that: being a bystander at the party in the preceding years, seeing people crossing the finish line, feeling the energy in the air around it all, I think that contributed a lot to me even _thinking_ about starting running.\n\nAfter I finished the 10k in May I realized I had exactly 8 weeks until the Meltdown 5k. It felt like a good time to experiment with my running schedule and explore different kinds of runs, with the goal of getting my speed up, even just a quarter-notch or so, in order to try to set a new 5k PR at the race. Lo and behold, I found [a training plan that catered exactly to that](https://www.verywellfit.com/5k-intermediate-run-training-2911620).  \n\nI'm about halfway through this 8 week session. I think it's been going well! I stepped that plan back slightly at the outset—before this I was only running 3 days a week; and 5 felt like it would have been too much of a jump, especially for an old man like me, but 4 felt like a nice, attainable stretch goal, a limit I could get behind pushing. So I'm following the interval run, tempo run, and long run routine, with an extra easy run mixed in there. \n\nThis has smoothly but also dramatically pushed my weekly mileage up each week from where I was around the time of the 10k. It's also varied the kinds of miles I'm running, which has been educational. Consciously doing \"easier\" miles has felt weird, even for someone who doesn't really go all that fast when he's going his fastest, but getting a broader sense of my range, a greater feel for what I can do (run 0.25 mile sprint at a sub-7:30 pace!) and can’t do (run a 0.25 mile sprint at a sub-7:30 pace if I’m going to do more than a few of those sprints in a single session!) has been interesting. It's fun to know what my hardest-run interval feels like, compared to those easy-breezy I-could-do-this-forever slow-boat long-run miles. Also turns out I absolutely love whatever passes for my version of a tempo run. Cool! That probably means I’m doing it wrong! Bummer!\n\nAs for my race goal, if I can shave just one second off my last 5k race time, this will be a total and complete personal victory. And if I don’t, I don’t. But I think I can. So I’m going to go for it.\n\nAfter that, I’m pondering where I’m going to go from here. There’s a lot of options, now, which is kind of a wild place to be. \n",
				"date_published": "2022-06-23T09:30:00-05:00",
				"url": "https://darby3.micro.blog/2022/06/23/summer-running-update.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/21/currently-reading-the.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780316525305\">The Gutter Prayer</a> by Gareth Hanrahan 📚</p>\n",
				"content_text": "Currently reading: [The Gutter Prayer](https://micro.blog/books/9780316525305) by Gareth Hanrahan 📚\n",
				"date_published": "2022-06-21T09:55:02-05:00",
				"url": "https://darby3.micro.blog/2022/06/21/currently-reading-the.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/18/had-a-very.html",
				
				"content_html": "<p>Had a very nice run today. 🏃</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Had a very nice run today. 🏃\n\n<img src=\"uploads/2022/aa06fc0c57.jpg\" width=\"450\" height=\"600\" alt=\"bridge against blue sky\" />\n",
				"date_published": "2022-06-18T17:04:14-05:00",
				"url": "https://darby3.micro.blog/2022/06/18/had-a-very.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/17/you-rang.html",
				
				"content_html": "<p>You rang?</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "You rang?\n\n<img src=\"uploads/2022/cf74d9f178.jpg\" width=\"599\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-06-17T17:44:00-05:00",
				"url": "https://darby3.micro.blog/2022/06/17/you-rang.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/17/hi-there.html",
				
				"content_html": "<p>Hi there.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Hi there. \n\n<img src=\"uploads/2022/16844ff4eb.jpg\" width=\"599\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-06-17T17:40:56-05:00",
				"url": "https://darby3.micro.blog/2022/06/17/hi-there.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/16/most-of-my.html",
				
				"content_html": "<p>Most of my photos are variations of this photo but I like this photo so it’s cool.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Most of my photos are variations of this photo but I like this photo so it’s cool. \n\n<img src=\"uploads/2022/af018346dd.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-06-16T09:14:40-05:00",
				"url": "https://darby3.micro.blog/2022/06/16/most-of-my.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/16/leaf-and-shadows.html",
				
				"content_html": "<p>Leaf and shadows.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Leaf and shadows. \n\n<img src=\"uploads/2022/50923ca533.jpg\" width=\"600\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-06-16T09:11:42-05:00",
				"url": "https://darby3.micro.blog/2022/06/16/leaf-and-shadows.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/06/14/currently-reading-how.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781429943482\">How Should a Person Be?</a> by Sheila Heti 📚</p>\n",
				"content_text": "Currently reading: [How Should a Person Be?](https://micro.blog/books/9781429943482) by Sheila Heti 📚\n",
				"date_published": "2022-06-14T22:36:09-05:00",
				"url": "https://darby3.micro.blog/2022/06/14/currently-reading-how.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/14/currently-reading-the.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781939931771\">The Bishop&rsquo;s Bedroom</a> by Piero Chiara 📚</p>\n",
				"content_text": "Currently reading: [The Bishop's Bedroom](https://micro.blog/books/9781939931771) by Piero Chiara 📚\n",
				"date_published": "2022-06-14T12:54:27-05:00",
				"url": "https://darby3.micro.blog/2022/06/14/currently-reading-the.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/12/had-my-first.html",
				
				"content_html": "<p>Had my first 16+ mile week of running this week. Not sure I’m going to keep this up but pushing my limits a bit has been fun. 🏃</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Had my first 16+ mile week of running this week. Not sure I’m going to keep this up but pushing my limits a bit has been fun. 🏃\n\n<img src=\"uploads/2022/582f5659d3.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-06-12T09:40:26-05:00",
				"url": "https://darby3.micro.blog/2022/06/12/had-my-first.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/11/currently-reading-things.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780593136775\">100 Things We&rsquo;ve Lost to the Internet</a> by Pamela Paul 📚</p>\n",
				"content_text": "Currently reading: [100 Things We've Lost to the Internet](https://micro.blog/books/9780593136775) by Pamela Paul 📚\n",
				"date_published": "2022-06-11T08:57:08-05:00",
				"url": "https://darby3.micro.blog/2022/06/11/currently-reading-things.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/08/currently-reading-eileen.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780143128755\">Eileen</a> by Ottessa Moshfegh 📚</p>\n",
				"content_text": "Currently reading: [Eileen](https://micro.blog/books/9780143128755) by Ottessa Moshfegh 📚\n",
				"date_published": "2022-06-08T13:16:19-05:00",
				"url": "https://darby3.micro.blog/2022/06/08/currently-reading-eileen.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/06/currently-reading-bored.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781250124951\">Bored and Brilliant</a> by Manoush Zomorodi 📚</p>\n",
				"content_text": "Currently reading: [Bored and Brilliant](https://micro.blog/books/9781250124951) by Manoush Zomorodi 📚\n",
				"date_published": "2022-06-06T11:08:07-05:00",
				"url": "https://darby3.micro.blog/2022/06/06/currently-reading-bored.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/06/05/love-running-in.html",
				
				"content_html": "<p>Love running in the Cleveland Metroparks. 🏃‍♂️</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Love running in the Cleveland Metroparks. 🏃‍♂️\n\n<img src=\"uploads/2022/1b372f3481.jpg\" width=\"450\" height=\"600\" alt=\"\" /><img src=\"uploads/2022/1be786023f.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-06-05T10:42:39-05:00",
				"url": "https://darby3.micro.blog/2022/06/05/love-running-in.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/05/29/currently-reading-how.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781612198552\">How to Do Nothing</a> by Jenny Odell 📚</p>\n",
				"content_text": "Currently reading: [How to Do Nothing](https://micro.blog/books/9781612198552) by Jenny Odell 📚\n",
				"date_published": "2022-05-29T14:54:33-05:00",
				"url": "https://darby3.micro.blog/2022/05/29/currently-reading-how.html",
				"tags": ["reading"]
			},
			{
				"id": "http://darby3.micro.blog/2022/05/28/capping-off-my.html",
				
				"content_html": "<p>Capping off my first 15+ mile running week. 🏃</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Capping off my first 15+ mile running week. 🏃\n\n<img src=\"uploads/2022/87063b8ee4.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-05-28T15:50:50-05:00",
				"url": "https://darby3.micro.blog/2022/05/28/capping-off-my.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/05/21/ran-my-first.html",
				
				"content_html": "<p>Ran my first 10k race today. What an experience. 🏃</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Ran my first 10k race today. What an experience. 🏃\n\n<img src=\"uploads/2022/db0ba451be.jpg\" width=\"480\" height=\"600\" alt=\"10k bib and finisher medal from the Cleveland Marathon event.\" />\n",
				"date_published": "2022-05-21T12:21:42-05:00",
				"url": "https://darby3.micro.blog/2022/05/21/ran-my-first.html",
				"tags": ["running"]
			},
			{
				"id": "http://darby3.micro.blog/2022/05/20/poppin.html",
				
				"content_html": "<p>Poppin’. 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Poppin’. 📷\n\n\n<img src=\"uploads/2022/226d96aa02.jpg\" width=\"450\" height=\"600\" alt=\"Tree in bloom. \" />\n",
				"date_published": "2022-05-20T15:37:51-05:00",
				"url": "https://darby3.micro.blog/2022/05/20/poppin.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/05/20/day-beverage-or.html",
				
				"content_html": "<p>Day 20: beverage (or, self portrait in the side of my coffee cup). 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Day 20: beverage (or, self portrait in the side of my coffee cup). 📷\n\n<img src=\"uploads/2022/89b153703c.jpg\" width=\"600\" height=\"600\" alt=\"Reflection of office in side of coffee mug.\" />\n",
				"date_published": "2022-05-20T10:36:41-05:00",
				"url": "https://darby3.micro.blog/2022/05/20/day-beverage-or.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/05/19/day-indulgence.html",
				
				"content_html": "<p>Day 19: Indulgence. 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Day 19: Indulgence. 📷\n\n<img src=\"uploads/2022/721a505199.jpg\" width=\"599\" height=\"600\" alt=\"A close up view of a cup of coffee.\" />\n",
				"date_published": "2022-05-19T08:29:00-05:00",
				"url": "https://darby3.micro.blog/2022/05/19/day-indulgence.html"
			},
			{
				"id": "http://darby3.micro.blog/2022/05/18/day-random.html",
				
				"content_html": "<p>Day 18: Random. 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Day 18: Random. 📷\n\n<img src=\"uploads/2022/121251e4c6.jpg\" width=\"450\" height=\"600\" alt=\"A 'No Thru Street' sign against a backdrop of green tree leaves and a bright blue sky.\" />\n",
				"date_published": "2022-05-18T18:51:00-05:00",
				"url": "https://darby3.micro.blog/2022/05/18/day-random.html"
			}
	]
}
